goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
/** ###################################################################
**     THIS BEAN MODULE IS GENERATED BY THE TOOL. DO NOT MODIFY IT.
**     Filename  : IO_Map.H
**     Project   : _1234
**     Processor : 56F8037
**     Beantype  : IO_Map
**     Version   : Driver 01.00
**     Compiler  : Metrowerks DSP C Compiler
**     Date/Time : 30/06/2011, 18:04
**     Abstract  :
**         IO_Map.h - implements an IO device's mapping. 
**         This module contains symbol definitions of all peripheral 
**         registers and bits. 
**     Settings  :
**
**     Contents  :
**         No public methods
**
**     (c) Copyright UNIS, spol. s r.o. 1997-2006
**     UNIS, spol. s r.o.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
** ###################################################################*/

#ifndef __IO_Map_H
#define __IO_Map_H

/* Based on CPU DB 56F8037, version 2.87.240 (RegistersPrg V2.09) */
/* DataSheet : Blue_SS_Version_0_1 */

#include "PE_Types.h"

/******************************************
*** Peripheral TMRA0
*******************************************/
typedef volatile struct {
  /*** TMRA0_COMP1 - Timer A Channel 0 Compare Register #1; 0x0000F000 ***/
  union {
    word Word;
  } TMRA0_COMP1_STR;
  
  #define TMRA0_COMP1                   *((volatile word *)0x0000F000)


  /*** TMRA0_COMP2 - Timer A Channel 0 Compare Register #2; 0x0000F001 ***/
  union {
    word Word;
  } TMRA0_COMP2_STR;
  
  #define TMRA0_COMP2                   *((volatile word *)0x0000F001)


  /*** TMRA0_CAPT - Timer A Channel 0 Capture Register; 0x0000F002 ***/
  union {
    word Word;
  } TMRA0_CAPT_STR;
  
  #define TMRA0_CAPT                    *((volatile word *)0x0000F002)


  /*** TMRA0_LOAD - Timer A Channel 0 Load Register; 0x0000F003 ***/
  union {
    word Word;
  } TMRA0_LOAD_STR;
  
  #define TMRA0_LOAD_LOAD0_MASK         0x01U
  #define TMRA0_LOAD_LOAD1_MASK         0x02U
  #define TMRA0_LOAD_LOAD2_MASK         0x04U
  #define TMRA0_LOAD_LOAD3_MASK         0x08U
  #define TMRA0_LOAD_LOAD4_MASK         0x10U
  #define TMRA0_LOAD_LOAD5_MASK         0x20U
  #define TMRA0_LOAD_LOAD6_MASK         0x40U
  #define TMRA0_LOAD_LOAD7_MASK         0x80U
  #define TMRA0_LOAD_LOAD8_MASK         0x0100U
  #define TMRA0_LOAD_LOAD9_MASK         0x0200U
  #define TMRA0_LOAD_LOAD10_MASK        0x0400U
  #define TMRA0_LOAD_LOAD11_MASK        0x0800U
  #define TMRA0_LOAD_LOAD12_MASK        0x1000U
  #define TMRA0_LOAD_LOAD13_MASK        0x2000U
  #define TMRA0_LOAD_LOAD14_MASK        0x4000U
  #define TMRA0_LOAD_LOAD15_MASK        0x8000U
  #define TMRA0_LOAD                    *((volatile word *)0x0000F003)


  /*** TMRA0_HOLD - Timer A Channel 0 Hold Register; 0x0000F004 ***/
  union {
    word Word;
  } TMRA0_HOLD_STR;
  
  #define TMRA0_HOLD_HOLD0_MASK         0x01U
  #define TMRA0_HOLD_HOLD1_MASK         0x02U
  #define TMRA0_HOLD_HOLD2_MASK         0x04U
  #define TMRA0_HOLD_HOLD3_MASK         0x08U
  #define TMRA0_HOLD_HOLD4_MASK         0x10U
  #define TMRA0_HOLD_HOLD5_MASK         0x20U
  #define TMRA0_HOLD_HOLD6_MASK         0x40U
  #define TMRA0_HOLD_HOLD7_MASK         0x80U
  #define TMRA0_HOLD_HOLD8_MASK         0x0100U
  #define TMRA0_HOLD_HOLD9_MASK         0x0200U
  #define TMRA0_HOLD_HOLD10_MASK        0x0400U
  #define TMRA0_HOLD_HOLD11_MASK        0x0800U
  #define TMRA0_HOLD_HOLD12_MASK        0x1000U
  #define TMRA0_HOLD_HOLD13_MASK        0x2000U
  #define TMRA0_HOLD_HOLD14_MASK        0x4000U
  #define TMRA0_HOLD_HOLD15_MASK        0x8000U
  #define TMRA0_HOLD                    *((volatile word *)0x0000F004)


  /*** TMRA0_CNTR - Timer A Channel 0 Counter Register; 0x0000F005 ***/
  union {
    word Word;
  } TMRA0_CNTR_STR;
  
  #define TMRA0_CNTR                    *((volatile word *)0x0000F005)


  /*** TMRA0_CTRL - Timer A Channel 0 Control Register; 0x0000F006 ***/
  union {
    word Word;
  } TMRA0_CTRL_STR;
  
  #define TMRA0_CTRL_OM0_MASK           0x01U
  #define TMRA0_CTRL_OM1_MASK           0x02U
  #define TMRA0_CTRL_OM2_MASK           0x04U
  #define TMRA0_CTRL_Co_INIT_MASK       0x08U
  #define TMRA0_CTRL_DIR_MASK           0x10U
  #define TMRA0_CTRL_LENGTH_MASK        0x20U
  #define TMRA0_CTRL_ONCE_MASK          0x40U
  #define TMRA0_CTRL_SCS0_MASK          0x80U
  #define TMRA0_CTRL_SCS1_MASK          0x0100U
  #define TMRA0_CTRL_PCS0_MASK          0x0200U
  #define TMRA0_CTRL_PCS1_MASK          0x0400U
  #define TMRA0_CTRL_PCS2_MASK          0x0800U
  #define TMRA0_CTRL_PCS3_MASK          0x1000U
  #define TMRA0_CTRL_CM0_MASK           0x2000U
  #define TMRA0_CTRL_CM1_MASK           0x4000U
  #define TMRA0_CTRL_CM2_MASK           0x8000U
  #define TMRA0_CTRL_OM_MASK            0x07U
  #define TMRA0_CTRL_OM_BITNUM          0x00U
  #define TMRA0_CTRL_SCS_MASK           0x0180U
  #define TMRA0_CTRL_SCS_BITNUM         0x07U
  #define TMRA0_CTRL_PCS_MASK           0x1E00U
  #define TMRA0_CTRL_PCS_BITNUM         0x09U
  #define TMRA0_CTRL_CM_MASK            0xE000U
  #define TMRA0_CTRL_CM_BITNUM          0x0DU
  #define TMRA0_CTRL                    *((volatile word *)0x0000F006)


  /*** TMRA0_SCTRL - Timer A Channel 0 Status and Control Register; 0x0000F007 ***/
  union {
    word Word;
  } TMRA0_SCTRL_STR;
  
  #define TMRA0_SCTRL_OEN_MASK          0x01U
  #define TMRA0_SCTRL_OPS_MASK          0x02U
  #define TMRA0_SCTRL_FORCE_MASK        0x04U
  #define TMRA0_SCTRL_VAL_MASK          0x08U
  #define TMRA0_SCTRL_EEOF_MASK         0x10U
  #define TMRA0_SCTRL_MSTR_MASK         0x20U
  #define TMRA0_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRA0_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRA0_SCTRL_INPUT_MASK        0x0100U
  #define TMRA0_SCTRL_IPS_MASK          0x0200U
  #define TMRA0_SCTRL_IEFIE_MASK        0x0400U
  #define TMRA0_SCTRL_IEF_MASK          0x0800U
  #define TMRA0_SCTRL_TOFIE_MASK        0x1000U
  #define TMRA0_SCTRL_TOF_MASK          0x2000U
  #define TMRA0_SCTRL_TCFIE_MASK        0x4000U
  #define TMRA0_SCTRL_TCF_MASK          0x8000U
  #define TMRA0_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRA0_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRA0_SCTRL                   *((volatile word *)0x0000F007)


  /*** TMRA0_CMPLD1 - Timer A Channel 0 Comparator Load Register 1; 0x0000F008 ***/
  union {
    word Word;
  } TMRA0_CMPLD1_STR;
  
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRA0_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRA0_CMPLD1                  *((volatile word *)0x0000F008)


  /*** TMRA0_CMPLD2 - Timer A Channel 0 Comparator Load Register 2; 0x0000F009 ***/
  union {
    word Word;
  } TMRA0_CMPLD2_STR;
  
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRA0_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRA0_CMPLD2                  *((volatile word *)0x0000F009)


  /*** TMRA0_CSCTRL - Timer A Channel 0 Comparator Status and Control Register; 0x0000F00A ***/
  union {
    word Word;
  } TMRA0_CSCTRL_STR;
  
