goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define TMRA0_CSCTRL_CL10_MASK        0x01U
  #define TMRA0_CSCTRL_CL11_MASK        0x02U
  #define TMRA0_CSCTRL_CL20_MASK        0x04U
  #define TMRA0_CSCTRL_CL21_MASK        0x08U
  #define TMRA0_CSCTRL_TCF1_MASK        0x10U
  #define TMRA0_CSCTRL_TCF2_MASK        0x20U
  #define TMRA0_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRA0_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRA0_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRA0_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRA0_CSCTRL_CL1_MASK         0x03U
  #define TMRA0_CSCTRL_CL1_BITNUM       0x00U
  #define TMRA0_CSCTRL_CL2_MASK         0x0CU
  #define TMRA0_CSCTRL_CL2_BITNUM       0x02U
  #define TMRA0_CSCTRL_TCF_1_MASK       0x30U
  #define TMRA0_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRA0_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRA0_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRA0_CSCTRL                  *((volatile word *)0x0000F00A)


  /*** TMRA0_FILT - Timer A Channel 0 Input Filter Register; 0x0000F00B ***/
  union {
    word Word;
  } TMRA0_FILT_STR;
  
  #define TMRA0_FILT_FILT_PER0_MASK     0x01U
  #define TMRA0_FILT_FILT_PER1_MASK     0x02U
  #define TMRA0_FILT_FILT_PER2_MASK     0x04U
  #define TMRA0_FILT_FILT_PER3_MASK     0x08U
  #define TMRA0_FILT_FILT_PER4_MASK     0x10U
  #define TMRA0_FILT_FILT_PER5_MASK     0x20U
  #define TMRA0_FILT_FILT_PER6_MASK     0x40U
  #define TMRA0_FILT_FILT_PER7_MASK     0x80U
  #define TMRA0_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRA0_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRA0_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRA0_FILT_FILT_PER_MASK      0xFFU
  #define TMRA0_FILT_FILT_PER_BITNUM    0x00U
  #define TMRA0_FILT_FILT_CNT_MASK      0x0700U
  #define TMRA0_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRA0_FILT                    *((volatile word *)0x0000F00B)


  word Reserved0[3];                   /* Reserved (unused) registers */
  
  /*** TMRA_ENBL - Timer A Channel Enable Register; 0x0000F00F ***/
  union {
    word Word;
  } TMRA_ENBL_STR;
  
  #define TMRA_ENBL_ENBL0_MASK          0x01U
  #define TMRA_ENBL_ENBL1_MASK          0x02U
  #define TMRA_ENBL_ENBL2_MASK          0x04U
  #define TMRA_ENBL_ENBL3_MASK          0x08U
  #define TMRA_ENBL_ENBL_MASK           0x0FU
  #define TMRA_ENBL_ENBL_BITNUM         0x00U
  #define TMRA_ENBL                     *((volatile word *)0x0000F00F)


} TMRA0_PRPH;

/******************************************
*** Peripheral TMRA1
*******************************************/
typedef volatile struct {
  /*** TMRA1_COMP1 - Timer A Channel 1 Compare Register #1; 0x0000F010 ***/
  union {
    word Word;
  } TMRA1_COMP1_STR;
  
  #define TMRA1_COMP1                   *((volatile word *)0x0000F010)


  /*** TMRA1_COMP2 - Timer A Channel 1 Compare Register #2; 0x0000F011 ***/
  union {
    word Word;
  } TMRA1_COMP2_STR;
  
  #define TMRA1_COMP2                   *((volatile word *)0x0000F011)


  /*** TMRA1_CAPT - Timer A Channel 1 Capture Register; 0x0000F012 ***/
  union {
    word Word;
  } TMRA1_CAPT_STR;
  
  #define TMRA1_CAPT                    *((volatile word *)0x0000F012)


  /*** TMRA1_LOAD - Timer A Channel 1 Load Register; 0x0000F013 ***/
  union {
    word Word;
  } TMRA1_LOAD_STR;
  
  #define TMRA1_LOAD_LOAD0_MASK         0x01U
  #define TMRA1_LOAD_LOAD1_MASK         0x02U
  #define TMRA1_LOAD_LOAD2_MASK         0x04U
  #define TMRA1_LOAD_LOAD3_MASK         0x08U
  #define TMRA1_LOAD_LOAD4_MASK         0x10U
  #define TMRA1_LOAD_LOAD5_MASK         0x20U
  #define TMRA1_LOAD_LOAD6_MASK         0x40U
  #define TMRA1_LOAD_LOAD7_MASK         0x80U
  #define TMRA1_LOAD_LOAD8_MASK         0x0100U
  #define TMRA1_LOAD_LOAD9_MASK         0x0200U
  #define TMRA1_LOAD_LOAD10_MASK        0x0400U
  #define TMRA1_LOAD_LOAD11_MASK        0x0800U
  #define TMRA1_LOAD_LOAD12_MASK        0x1000U
  #define TMRA1_LOAD_LOAD13_MASK        0x2000U
  #define TMRA1_LOAD_LOAD14_MASK        0x4000U
  #define TMRA1_LOAD_LOAD15_MASK        0x8000U
  #define TMRA1_LOAD                    *((volatile word *)0x0000F013)


  /*** TMRA1_HOLD - Timer A Channel 1 Hold Register; 0x0000F014 ***/
  union {
    word Word;
  } TMRA1_HOLD_STR;
  
  #define TMRA1_HOLD_HOLD0_MASK         0x01U
  #define TMRA1_HOLD_HOLD1_MASK         0x02U
  #define TMRA1_HOLD_HOLD2_MASK         0x04U
  #define TMRA1_HOLD_HOLD3_MASK         0x08U
  #define TMRA1_HOLD_HOLD4_MASK         0x10U
  #define TMRA1_HOLD_HOLD5_MASK         0x20U
  #define TMRA1_HOLD_HOLD6_MASK         0x40U
  #define TMRA1_HOLD_HOLD7_MASK         0x80U
  #define TMRA1_HOLD_HOLD8_MASK         0x0100U
  #define TMRA1_HOLD_HOLD9_MASK         0x0200U
  #define TMRA1_HOLD_HOLD10_MASK        0x0400U
  #define TMRA1_HOLD_HOLD11_MASK        0x0800U
  #define TMRA1_HOLD_HOLD12_MASK        0x1000U
  #define TMRA1_HOLD_HOLD13_MASK        0x2000U
  #define TMRA1_HOLD_HOLD14_MASK        0x4000U
  #define TMRA1_HOLD_HOLD15_MASK        0x8000U
  #define TMRA1_HOLD                    *((volatile word *)0x0000F014)


  /*** TMRA1_CNTR - Timer A Channel 1 Counter Register; 0x0000F015 ***/
  union {
    word Word;
  } TMRA1_CNTR_STR;
  
  #define TMRA1_CNTR                    *((volatile word *)0x0000F015)


  /*** TMRA1_CTRL - Timer A Channel 1 Control Register; 0x0000F016 ***/
  union {
    word Word;
  } TMRA1_CTRL_STR;
  
  #define TMRA1_CTRL_OM0_MASK           0x01U
  #define TMRA1_CTRL_OM1_MASK           0x02U
  #define TMRA1_CTRL_OM2_MASK           0x04U
  #define TMRA1_CTRL_Co_INIT_MASK       0x08U
  #define TMRA1_CTRL_DIR_MASK           0x10U
  #define TMRA1_CTRL_LENGTH_MASK        0x20U
  #define TMRA1_CTRL_ONCE_MASK          0x40U
  #define TMRA1_CTRL_SCS0_MASK          0x80U
  #define TMRA1_CTRL_SCS1_MASK          0x0100U
  #define TMRA1_CTRL_PCS0_MASK          0x0200U
  #define TMRA1_CTRL_PCS1_MASK          0x0400U
  #define TMRA1_CTRL_PCS2_MASK          0x0800U
  #define TMRA1_CTRL_PCS3_MASK          0x1000U
  #define TMRA1_CTRL_CM0_MASK           0x2000U
  #define TMRA1_CTRL_CM1_MASK           0x4000U
  #define TMRA1_CTRL_CM2_MASK           0x8000U
  #define TMRA1_CTRL_OM_MASK            0x07U
  #define TMRA1_CTRL_OM_BITNUM          0x00U
  #define TMRA1_CTRL_SCS_MASK           0x0180U
  #define TMRA1_CTRL_SCS_BITNUM         0x07U
  #define TMRA1_CTRL_PCS_MASK           0x1E00U
  #define TMRA1_CTRL_PCS_BITNUM         0x09U
  #define TMRA1_CTRL_CM_MASK            0xE000U
  #define TMRA1_CTRL_CM_BITNUM          0x0DU
  #define TMRA1_CTRL                    *((volatile word *)0x0000F016)


  /*** TMRA1_SCTRL - Timer A Channel 1 Status and Control Register; 0x0000F017 ***/
  union {
    word Word;
  } TMRA1_SCTRL_STR;
  
  #define TMRA1_SCTRL_OEN_MASK          0x01U
  #define TMRA1_SCTRL_OPS_MASK          0x02U
  #define TMRA1_SCTRL_FORCE_MASK        0x04U
  #define TMRA1_SCTRL_VAL_MASK          0x08U
  #define TMRA1_SCTRL_EEOF_MASK         0x10U
  #define TMRA1_SCTRL_MSTR_MASK         0x20U
  #define TMRA1_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRA1_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRA1_SCTRL_INPUT_MASK        0x0100U
  #define TMRA1_SCTRL_IPS_MASK          0x0200U
  #define TMRA1_SCTRL_IEFIE_MASK        0x0400U
  #define TMRA1_SCTRL_IEF_MASK          0x0800U
  #define TMRA1_SCTRL_TOFIE_MASK        0x1000U
  #define TMRA1_SCTRL_TOF_MASK          0x2000U
  #define TMRA1_SCTRL_TCFIE_MASK        0x4000U
  #define TMRA1_SCTRL_TCF_MASK          0x8000U
  #define TMRA1_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRA1_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRA1_SCTRL                   *((volatile word *)0x0000F017)


  /*** TMRA1_CMPLD1 - Timer A Channel 1 Comparator Load Register 1; 0x0000F018 ***/
  union {
    word Word;
  } TMRA1_CMPLD1_STR;
  
