goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRA1_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRA1_CMPLD1                  *((volatile word *)0x0000F018)


  /*** TMRA1_CMPLD2 - Timer A Channel 1 Comparator Load Register 2; 0x0000F019 ***/
  union {
    word Word;
  } TMRA1_CMPLD2_STR;
  
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRA1_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRA1_CMPLD2                  *((volatile word *)0x0000F019)


  /*** TMRA1_CSCTRL - Timer A Channel 1 Comparator Status and Control Register; 0x0000F01A ***/
  union {
    word Word;
  } TMRA1_CSCTRL_STR;
  
  #define TMRA1_CSCTRL_CL10_MASK        0x01U
  #define TMRA1_CSCTRL_CL11_MASK        0x02U
  #define TMRA1_CSCTRL_CL20_MASK        0x04U
  #define TMRA1_CSCTRL_CL21_MASK        0x08U
  #define TMRA1_CSCTRL_TCF1_MASK        0x10U
  #define TMRA1_CSCTRL_TCF2_MASK        0x20U
  #define TMRA1_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRA1_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRA1_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRA1_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRA1_CSCTRL_CL1_MASK         0x03U
  #define TMRA1_CSCTRL_CL1_BITNUM       0x00U
  #define TMRA1_CSCTRL_CL2_MASK         0x0CU
  #define TMRA1_CSCTRL_CL2_BITNUM       0x02U
  #define TMRA1_CSCTRL_TCF_1_MASK       0x30U
  #define TMRA1_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRA1_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRA1_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRA1_CSCTRL                  *((volatile word *)0x0000F01A)


  /*** TMRA1_FILT - Timer A Channel 1 Input Filter Register; 0x0000F01B ***/
  union {
    word Word;
  } TMRA1_FILT_STR;
  
  #define TMRA1_FILT_FILT_PER0_MASK     0x01U
  #define TMRA1_FILT_FILT_PER1_MASK     0x02U
  #define TMRA1_FILT_FILT_PER2_MASK     0x04U
  #define TMRA1_FILT_FILT_PER3_MASK     0x08U
  #define TMRA1_FILT_FILT_PER4_MASK     0x10U
  #define TMRA1_FILT_FILT_PER5_MASK     0x20U
  #define TMRA1_FILT_FILT_PER6_MASK     0x40U
  #define TMRA1_FILT_FILT_PER7_MASK     0x80U
  #define TMRA1_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRA1_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRA1_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRA1_FILT_FILT_PER_MASK      0xFFU
  #define TMRA1_FILT_FILT_PER_BITNUM    0x00U
  #define TMRA1_FILT_FILT_CNT_MASK      0x0700U
  #define TMRA1_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRA1_FILT                    *((volatile word *)0x0000F01B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} TMRA1_PRPH;

/******************************************
*** Peripheral TMRA2
*******************************************/
typedef volatile struct {
  /*** TMRA2_COMP1 - Timer A Channel 2 Compare Register #1; 0x0000F020 ***/
  union {
    word Word;
  } TMRA2_COMP1_STR;
  
  #define TMRA2_COMP1                   *((volatile word *)0x0000F020)


  /*** TMRA2_COMP2 - Timer A Channel 2 Compare Register #2; 0x0000F021 ***/
  union {
    word Word;
  } TMRA2_COMP2_STR;
  
  #define TMRA2_COMP2                   *((volatile word *)0x0000F021)


  /*** TMRA2_CAPT - Timer A Channel 2 Capture Register; 0x0000F022 ***/
  union {
    word Word;
  } TMRA2_CAPT_STR;
  
  #define TMRA2_CAPT                    *((volatile word *)0x0000F022)


  /*** TMRA2_LOAD - Timer A Channel 2 Load Register; 0x0000F023 ***/
  union {
    word Word;
  } TMRA2_LOAD_STR;
  
  #define TMRA2_LOAD_LOAD0_MASK         0x01U
  #define TMRA2_LOAD_LOAD1_MASK         0x02U
  #define TMRA2_LOAD_LOAD2_MASK         0x04U
  #define TMRA2_LOAD_LOAD3_MASK         0x08U
  #define TMRA2_LOAD_LOAD4_MASK         0x10U
  #define TMRA2_LOAD_LOAD5_MASK         0x20U
  #define TMRA2_LOAD_LOAD6_MASK         0x40U
  #define TMRA2_LOAD_LOAD7_MASK         0x80U
  #define TMRA2_LOAD_LOAD8_MASK         0x0100U
  #define TMRA2_LOAD_LOAD9_MASK         0x0200U
  #define TMRA2_LOAD_LOAD10_MASK        0x0400U
  #define TMRA2_LOAD_LOAD11_MASK        0x0800U
  #define TMRA2_LOAD_LOAD12_MASK        0x1000U
  #define TMRA2_LOAD_LOAD13_MASK        0x2000U
  #define TMRA2_LOAD_LOAD14_MASK        0x4000U
  #define TMRA2_LOAD_LOAD15_MASK        0x8000U
  #define TMRA2_LOAD                    *((volatile word *)0x0000F023)


  /*** TMRA2_HOLD - Timer A Channel 2 Hold Register; 0x0000F024 ***/
  union {
    word Word;
  } TMRA2_HOLD_STR;
  
  #define TMRA2_HOLD_HOLD0_MASK         0x01U
  #define TMRA2_HOLD_HOLD1_MASK         0x02U
  #define TMRA2_HOLD_HOLD2_MASK         0x04U
  #define TMRA2_HOLD_HOLD3_MASK         0x08U
  #define TMRA2_HOLD_HOLD4_MASK         0x10U
  #define TMRA2_HOLD_HOLD5_MASK         0x20U
  #define TMRA2_HOLD_HOLD6_MASK         0x40U
  #define TMRA2_HOLD_HOLD7_MASK         0x80U
  #define TMRA2_HOLD_HOLD8_MASK         0x0100U
  #define TMRA2_HOLD_HOLD9_MASK         0x0200U
  #define TMRA2_HOLD_HOLD10_MASK        0x0400U
  #define TMRA2_HOLD_HOLD11_MASK        0x0800U
  #define TMRA2_HOLD_HOLD12_MASK        0x1000U
  #define TMRA2_HOLD_HOLD13_MASK        0x2000U
  #define TMRA2_HOLD_HOLD14_MASK        0x4000U
  #define TMRA2_HOLD_HOLD15_MASK        0x8000U
  #define TMRA2_HOLD                    *((volatile word *)0x0000F024)


  /*** TMRA2_CNTR - Timer A Channel 2 Counter Register; 0x0000F025 ***/
  union {
    word Word;
  } TMRA2_CNTR_STR;
  
