goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define TMRA2_CNTR                    *((volatile word *)0x0000F025)


  /*** TMRA2_CTRL - Timer A Channel 2 Control Register; 0x0000F026 ***/
  union {
    word Word;
  } TMRA2_CTRL_STR;
  
  #define TMRA2_CTRL_OM0_MASK           0x01U
  #define TMRA2_CTRL_OM1_MASK           0x02U
  #define TMRA2_CTRL_OM2_MASK           0x04U
  #define TMRA2_CTRL_Co_INIT_MASK       0x08U
  #define TMRA2_CTRL_DIR_MASK           0x10U
  #define TMRA2_CTRL_LENGTH_MASK        0x20U
  #define TMRA2_CTRL_ONCE_MASK          0x40U
  #define TMRA2_CTRL_SCS0_MASK          0x80U
  #define TMRA2_CTRL_SCS1_MASK          0x0100U
  #define TMRA2_CTRL_PCS0_MASK          0x0200U
  #define TMRA2_CTRL_PCS1_MASK          0x0400U
  #define TMRA2_CTRL_PCS2_MASK          0x0800U
  #define TMRA2_CTRL_PCS3_MASK          0x1000U
  #define TMRA2_CTRL_CM0_MASK           0x2000U
  #define TMRA2_CTRL_CM1_MASK           0x4000U
  #define TMRA2_CTRL_CM2_MASK           0x8000U
  #define TMRA2_CTRL_OM_MASK            0x07U
  #define TMRA2_CTRL_OM_BITNUM          0x00U
  #define TMRA2_CTRL_SCS_MASK           0x0180U
  #define TMRA2_CTRL_SCS_BITNUM         0x07U
  #define TMRA2_CTRL_PCS_MASK           0x1E00U
  #define TMRA2_CTRL_PCS_BITNUM         0x09U
  #define TMRA2_CTRL_CM_MASK            0xE000U
  #define TMRA2_CTRL_CM_BITNUM          0x0DU
  #define TMRA2_CTRL                    *((volatile word *)0x0000F026)


  /*** TMRA2_SCTRL - Timer A Channel 2 Status and Control Register; 0x0000F027 ***/
  union {
    word Word;
  } TMRA2_SCTRL_STR;
  
  #define TMRA2_SCTRL_OEN_MASK          0x01U
  #define TMRA2_SCTRL_OPS_MASK          0x02U
  #define TMRA2_SCTRL_FORCE_MASK        0x04U
  #define TMRA2_SCTRL_VAL_MASK          0x08U
  #define TMRA2_SCTRL_EEOF_MASK         0x10U
  #define TMRA2_SCTRL_MSTR_MASK         0x20U
  #define TMRA2_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRA2_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRA2_SCTRL_INPUT_MASK        0x0100U
  #define TMRA2_SCTRL_IPS_MASK          0x0200U
  #define TMRA2_SCTRL_IEFIE_MASK        0x0400U
  #define TMRA2_SCTRL_IEF_MASK          0x0800U
  #define TMRA2_SCTRL_TOFIE_MASK        0x1000U
  #define TMRA2_SCTRL_TOF_MASK          0x2000U
  #define TMRA2_SCTRL_TCFIE_MASK        0x4000U
  #define TMRA2_SCTRL_TCF_MASK          0x8000U
  #define TMRA2_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRA2_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRA2_SCTRL                   *((volatile word *)0x0000F027)


  /*** TMRA2_CMPLD1 - Timer A Channel 2 Comparator Load Register 1; 0x0000F028 ***/
  union {
    word Word;
  } TMRA2_CMPLD1_STR;
  
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRA2_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRA2_CMPLD1                  *((volatile word *)0x0000F028)


  /*** TMRA2_CMPLD2 - Timer A Channel 2 Comparator Load Register 2; 0x0000F029 ***/
  union {
    word Word;
  } TMRA2_CMPLD2_STR;
  
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRA2_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRA2_CMPLD2                  *((volatile word *)0x0000F029)


  /*** TMRA2_CSCTRL - Timer A Channel 2 Comparator Status and Control Register; 0x0000F02A ***/
  union {
    word Word;
  } TMRA2_CSCTRL_STR;
  
  #define TMRA2_CSCTRL_CL10_MASK        0x01U
  #define TMRA2_CSCTRL_CL11_MASK        0x02U
  #define TMRA2_CSCTRL_CL20_MASK        0x04U
  #define TMRA2_CSCTRL_CL21_MASK        0x08U
  #define TMRA2_CSCTRL_TCF1_MASK        0x10U
  #define TMRA2_CSCTRL_TCF2_MASK        0x20U
  #define TMRA2_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRA2_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRA2_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRA2_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRA2_CSCTRL_CL1_MASK         0x03U
  #define TMRA2_CSCTRL_CL1_BITNUM       0x00U
  #define TMRA2_CSCTRL_CL2_MASK         0x0CU
  #define TMRA2_CSCTRL_CL2_BITNUM       0x02U
  #define TMRA2_CSCTRL_TCF_1_MASK       0x30U
  #define TMRA2_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRA2_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRA2_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRA2_CSCTRL                  *((volatile word *)0x0000F02A)


  /*** TMRA2_FILT - Timer A Channel 2 Input Filter Register; 0x0000F02B ***/
  union {
    word Word;
  } TMRA2_FILT_STR;
  
  #define TMRA2_FILT_FILT_PER0_MASK     0x01U
  #define TMRA2_FILT_FILT_PER1_MASK     0x02U
  #define TMRA2_FILT_FILT_PER2_MASK     0x04U
  #define TMRA2_FILT_FILT_PER3_MASK     0x08U
  #define TMRA2_FILT_FILT_PER4_MASK     0x10U
  #define TMRA2_FILT_FILT_PER5_MASK     0x20U
  #define TMRA2_FILT_FILT_PER6_MASK     0x40U
  #define TMRA2_FILT_FILT_PER7_MASK     0x80U
  #define TMRA2_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRA2_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRA2_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRA2_FILT_FILT_PER_MASK      0xFFU
  #define TMRA2_FILT_FILT_PER_BITNUM    0x00U
  #define TMRA2_FILT_FILT_CNT_MASK      0x0700U
  #define TMRA2_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRA2_FILT                    *((volatile word *)0x0000F02B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} TMRA2_PRPH;

/******************************************
*** Peripheral TMRA3
*******************************************/
typedef volatile struct {
  /*** TMRA3_COMP1 - Timer A Channel 3 Compare Register #1; 0x0000F030 ***/
  union {
    word Word;
  } TMRA3_COMP1_STR;
  
  #define TMRA3_COMP1                   *((volatile word *)0x0000F030)


