goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** TMRA3_COMP2 - Timer A Channel 3 Compare Register #2; 0x0000F031 ***/
  union {
    word Word;
  } TMRA3_COMP2_STR;
  
  #define TMRA3_COMP2                   *((volatile word *)0x0000F031)


  /*** TMRA3_CAPT - Timer A Channel 3 Capture Register; 0x0000F032 ***/
  union {
    word Word;
  } TMRA3_CAPT_STR;
  
  #define TMRA3_CAPT                    *((volatile word *)0x0000F032)


  /*** TMRA3_LOAD - Timer A Channel 3 Load Register; 0x0000F033 ***/
  union {
    word Word;
  } TMRA3_LOAD_STR;
  
  #define TMRA3_LOAD_LOAD0_MASK         0x01U
  #define TMRA3_LOAD_LOAD1_MASK         0x02U
  #define TMRA3_LOAD_LOAD2_MASK         0x04U
  #define TMRA3_LOAD_LOAD3_MASK         0x08U
  #define TMRA3_LOAD_LOAD4_MASK         0x10U
  #define TMRA3_LOAD_LOAD5_MASK         0x20U
  #define TMRA3_LOAD_LOAD6_MASK         0x40U
  #define TMRA3_LOAD_LOAD7_MASK         0x80U
  #define TMRA3_LOAD_LOAD8_MASK         0x0100U
  #define TMRA3_LOAD_LOAD9_MASK         0x0200U
  #define TMRA3_LOAD_LOAD10_MASK        0x0400U
  #define TMRA3_LOAD_LOAD11_MASK        0x0800U
  #define TMRA3_LOAD_LOAD12_MASK        0x1000U
  #define TMRA3_LOAD_LOAD13_MASK        0x2000U
  #define TMRA3_LOAD_LOAD14_MASK        0x4000U
  #define TMRA3_LOAD_LOAD15_MASK        0x8000U
  #define TMRA3_LOAD                    *((volatile word *)0x0000F033)


  /*** TMRA3_HOLD - Timer A Channel 3 Hold Register; 0x0000F034 ***/
  union {
    word Word;
  } TMRA3_HOLD_STR;
  
  #define TMRA3_HOLD_HOLD0_MASK         0x01U
  #define TMRA3_HOLD_HOLD1_MASK         0x02U
  #define TMRA3_HOLD_HOLD2_MASK         0x04U
  #define TMRA3_HOLD_HOLD3_MASK         0x08U
  #define TMRA3_HOLD_HOLD4_MASK         0x10U
  #define TMRA3_HOLD_HOLD5_MASK         0x20U
  #define TMRA3_HOLD_HOLD6_MASK         0x40U
  #define TMRA3_HOLD_HOLD7_MASK         0x80U
  #define TMRA3_HOLD_HOLD8_MASK         0x0100U
  #define TMRA3_HOLD_HOLD9_MASK         0x0200U
  #define TMRA3_HOLD_HOLD10_MASK        0x0400U
  #define TMRA3_HOLD_HOLD11_MASK        0x0800U
  #define TMRA3_HOLD_HOLD12_MASK        0x1000U
  #define TMRA3_HOLD_HOLD13_MASK        0x2000U
  #define TMRA3_HOLD_HOLD14_MASK        0x4000U
  #define TMRA3_HOLD_HOLD15_MASK        0x8000U
  #define TMRA3_HOLD                    *((volatile word *)0x0000F034)


  /*** TMRA3_CNTR - Timer A Channel 3 Counter Register; 0x0000F035 ***/
  union {
    word Word;
  } TMRA3_CNTR_STR;
  
  #define TMRA3_CNTR                    *((volatile word *)0x0000F035)


  /*** TMRA3_CTRL - Timer A Channel 3 Control Register; 0x0000F036 ***/
  union {
    word Word;
  } TMRA3_CTRL_STR;
  
  #define TMRA3_CTRL_OM0_MASK           0x01U
  #define TMRA3_CTRL_OM1_MASK           0x02U
  #define TMRA3_CTRL_OM2_MASK           0x04U
  #define TMRA3_CTRL_Co_INIT_MASK       0x08U
  #define TMRA3_CTRL_DIR_MASK           0x10U
  #define TMRA3_CTRL_LENGTH_MASK        0x20U
  #define TMRA3_CTRL_ONCE_MASK          0x40U
  #define TMRA3_CTRL_SCS0_MASK          0x80U
  #define TMRA3_CTRL_SCS1_MASK          0x0100U
  #define TMRA3_CTRL_PCS0_MASK          0x0200U
  #define TMRA3_CTRL_PCS1_MASK          0x0400U
  #define TMRA3_CTRL_PCS2_MASK          0x0800U
  #define TMRA3_CTRL_PCS3_MASK          0x1000U
  #define TMRA3_CTRL_CM0_MASK           0x2000U
  #define TMRA3_CTRL_CM1_MASK           0x4000U
  #define TMRA3_CTRL_CM2_MASK           0x8000U
  #define TMRA3_CTRL_OM_MASK            0x07U
  #define TMRA3_CTRL_OM_BITNUM          0x00U
  #define TMRA3_CTRL_SCS_MASK           0x0180U
  #define TMRA3_CTRL_SCS_BITNUM         0x07U
  #define TMRA3_CTRL_PCS_MASK           0x1E00U
  #define TMRA3_CTRL_PCS_BITNUM         0x09U
  #define TMRA3_CTRL_CM_MASK            0xE000U
  #define TMRA3_CTRL_CM_BITNUM          0x0DU
  #define TMRA3_CTRL                    *((volatile word *)0x0000F036)


  /*** TMRA3_SCTRL - Timer A Channel 3 Status and Control Register; 0x0000F037 ***/
  union {
    word Word;
  } TMRA3_SCTRL_STR;
  
  #define TMRA3_SCTRL_OEN_MASK          0x01U
  #define TMRA3_SCTRL_OPS_MASK          0x02U
  #define TMRA3_SCTRL_FORCE_MASK        0x04U
  #define TMRA3_SCTRL_VAL_MASK          0x08U
  #define TMRA3_SCTRL_EEOF_MASK         0x10U
  #define TMRA3_SCTRL_MSTR_MASK         0x20U
  #define TMRA3_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRA3_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRA3_SCTRL_INPUT_MASK        0x0100U
  #define TMRA3_SCTRL_IPS_MASK          0x0200U
  #define TMRA3_SCTRL_IEFIE_MASK        0x0400U
  #define TMRA3_SCTRL_IEF_MASK          0x0800U
  #define TMRA3_SCTRL_TOFIE_MASK        0x1000U
  #define TMRA3_SCTRL_TOF_MASK          0x2000U
  #define TMRA3_SCTRL_TCFIE_MASK        0x4000U
  #define TMRA3_SCTRL_TCF_MASK          0x8000U
  #define TMRA3_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRA3_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRA3_SCTRL                   *((volatile word *)0x0000F037)


  /*** TMRA3_CMPLD1 - Timer A Channel 3 Comparator Load Register 1; 0x0000F038 ***/
  union {
    word Word;
  } TMRA3_CMPLD1_STR;
  
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRA3_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRA3_CMPLD1                  *((volatile word *)0x0000F038)


  /*** TMRA3_CMPLD2 - Timer A Channel 3 Comparator Load Register 2; 0x0000F039 ***/
  union {
    word Word;
  } TMRA3_CMPLD2_STR;
  
