goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRB0_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRB0_CMPLD2                  *((volatile word *)0x0000F049)


  /*** TMRB0_CSCTRL - Timer B Channel 0 Comparator Status and Control Register; 0x0000F04A ***/
  union {
    word Word;
  } TMRB0_CSCTRL_STR;
  
  #define TMRB0_CSCTRL_CL10_MASK        0x01U
  #define TMRB0_CSCTRL_CL11_MASK        0x02U
  #define TMRB0_CSCTRL_CL20_MASK        0x04U
  #define TMRB0_CSCTRL_CL21_MASK        0x08U
  #define TMRB0_CSCTRL_TCF1_MASK        0x10U
  #define TMRB0_CSCTRL_TCF2_MASK        0x20U
  #define TMRB0_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRB0_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRB0_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRB0_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRB0_CSCTRL_CL1_MASK         0x03U
  #define TMRB0_CSCTRL_CL1_BITNUM       0x00U
  #define TMRB0_CSCTRL_CL2_MASK         0x0CU
  #define TMRB0_CSCTRL_CL2_BITNUM       0x02U
  #define TMRB0_CSCTRL_TCF_1_MASK       0x30U
  #define TMRB0_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRB0_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRB0_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRB0_CSCTRL                  *((volatile word *)0x0000F04A)


  /*** TMRB0_FILT - Timer B Channel 0 Input Filter Register; 0x0000F04B ***/
  union {
    word Word;
  } TMRB0_FILT_STR;
  
  #define TMRB0_FILT_FILT_PER0_MASK     0x01U
  #define TMRB0_FILT_FILT_PER1_MASK     0x02U
  #define TMRB0_FILT_FILT_PER2_MASK     0x04U
  #define TMRB0_FILT_FILT_PER3_MASK     0x08U
  #define TMRB0_FILT_FILT_PER4_MASK     0x10U
  #define TMRB0_FILT_FILT_PER5_MASK     0x20U
  #define TMRB0_FILT_FILT_PER6_MASK     0x40U
  #define TMRB0_FILT_FILT_PER7_MASK     0x80U
  #define TMRB0_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRB0_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRB0_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRB0_FILT_FILT_PER_MASK      0xFFU
  #define TMRB0_FILT_FILT_PER_BITNUM    0x00U
  #define TMRB0_FILT_FILT_CNT_MASK      0x0700U
  #define TMRB0_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRB0_FILT                    *((volatile word *)0x0000F04B)


  word Reserved0[3];                   /* Reserved (unused) registers */
  
  /*** TMRB_ENBL - Timer B Channel Enable Register; 0x0000F04F ***/
  union {
    word Word;
  } TMRB_ENBL_STR;
  
  #define TMRB_ENBL_ENBL0_MASK          0x01U
  #define TMRB_ENBL_ENBL1_MASK          0x02U
  #define TMRB_ENBL_ENBL2_MASK          0x04U
  #define TMRB_ENBL_ENBL3_MASK          0x08U
  #define TMRB_ENBL_ENBL_MASK           0x0FU
  #define TMRB_ENBL_ENBL_BITNUM         0x00U
  #define TMRB_ENBL                     *((volatile word *)0x0000F04F)


} TMRB0_PRPH;

/******************************************
*** Peripheral TMRB1
*******************************************/
typedef volatile struct {
  /*** TMRB1_COMP1 - Timer B Channel 1 Compare Register #1; 0x0000F050 ***/
  union {
    word Word;
  } TMRB1_COMP1_STR;
  
  #define TMRB1_COMP1                   *((volatile word *)0x0000F050)


  /*** TMRB1_COMP2 - Timer B Channel 1 Compare Register #2; 0x0000F051 ***/
  union {
    word Word;
  } TMRB1_COMP2_STR;
  
  #define TMRB1_COMP2                   *((volatile word *)0x0000F051)


  /*** TMRB1_CAPT - Timer B Channel 1 Capture Register; 0x0000F052 ***/
  union {
    word Word;
  } TMRB1_CAPT_STR;
  
  #define TMRB1_CAPT                    *((volatile word *)0x0000F052)


  /*** TMRB1_LOAD - Timer B Channel 1 Load Register; 0x0000F053 ***/
  union {
    word Word;
  } TMRB1_LOAD_STR;
  
  #define TMRB1_LOAD_LOAD0_MASK         0x01U
  #define TMRB1_LOAD_LOAD1_MASK         0x02U
  #define TMRB1_LOAD_LOAD2_MASK         0x04U
  #define TMRB1_LOAD_LOAD3_MASK         0x08U
  #define TMRB1_LOAD_LOAD4_MASK         0x10U
  #define TMRB1_LOAD_LOAD5_MASK         0x20U
  #define TMRB1_LOAD_LOAD6_MASK         0x40U
  #define TMRB1_LOAD_LOAD7_MASK         0x80U
  #define TMRB1_LOAD_LOAD8_MASK         0x0100U
  #define TMRB1_LOAD_LOAD9_MASK         0x0200U
  #define TMRB1_LOAD_LOAD10_MASK        0x0400U
  #define TMRB1_LOAD_LOAD11_MASK        0x0800U
  #define TMRB1_LOAD_LOAD12_MASK        0x1000U
  #define TMRB1_LOAD_LOAD13_MASK        0x2000U
  #define TMRB1_LOAD_LOAD14_MASK        0x4000U
  #define TMRB1_LOAD_LOAD15_MASK        0x8000U
  #define TMRB1_LOAD                    *((volatile word *)0x0000F053)


  /*** TMRB1_HOLD - Timer B Channel 1 Hold Register; 0x0000F054 ***/
  union {
    word Word;
  } TMRB1_HOLD_STR;
  
  #define TMRB1_HOLD_HOLD0_MASK         0x01U
  #define TMRB1_HOLD_HOLD1_MASK         0x02U
  #define TMRB1_HOLD_HOLD2_MASK         0x04U
  #define TMRB1_HOLD_HOLD3_MASK         0x08U
  #define TMRB1_HOLD_HOLD4_MASK         0x10U
  #define TMRB1_HOLD_HOLD5_MASK         0x20U
  #define TMRB1_HOLD_HOLD6_MASK         0x40U
  #define TMRB1_HOLD_HOLD7_MASK         0x80U
  #define TMRB1_HOLD_HOLD8_MASK         0x0100U
  #define TMRB1_HOLD_HOLD9_MASK         0x0200U
  #define TMRB1_HOLD_HOLD10_MASK        0x0400U
  #define TMRB1_HOLD_HOLD11_MASK        0x0800U
  #define TMRB1_HOLD_HOLD12_MASK        0x1000U
  #define TMRB1_HOLD_HOLD13_MASK        0x2000U
  #define TMRB1_HOLD_HOLD14_MASK        0x4000U
  #define TMRB1_HOLD_HOLD15_MASK        0x8000U
  #define TMRB1_HOLD                    *((volatile word *)0x0000F054)


