goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** TMRB1_CNTR - Timer B Channel 1 Counter Register; 0x0000F055 ***/
  union {
    word Word;
  } TMRB1_CNTR_STR;
  
  #define TMRB1_CNTR                    *((volatile word *)0x0000F055)


  /*** TMRB1_CTRL - Timer B Channel 1 Control Register; 0x0000F056 ***/
  union {
    word Word;
  } TMRB1_CTRL_STR;
  
  #define TMRB1_CTRL_OM0_MASK           0x01U
  #define TMRB1_CTRL_OM1_MASK           0x02U
  #define TMRB1_CTRL_OM2_MASK           0x04U
  #define TMRB1_CTRL_Co_INIT_MASK       0x08U
  #define TMRB1_CTRL_DIR_MASK           0x10U
  #define TMRB1_CTRL_LENGTH_MASK        0x20U
  #define TMRB1_CTRL_ONCE_MASK          0x40U
  #define TMRB1_CTRL_SCS0_MASK          0x80U
  #define TMRB1_CTRL_SCS1_MASK          0x0100U
  #define TMRB1_CTRL_PCS0_MASK          0x0200U
  #define TMRB1_CTRL_PCS1_MASK          0x0400U
  #define TMRB1_CTRL_PCS2_MASK          0x0800U
  #define TMRB1_CTRL_PCS3_MASK          0x1000U
  #define TMRB1_CTRL_CM0_MASK           0x2000U
  #define TMRB1_CTRL_CM1_MASK           0x4000U
  #define TMRB1_CTRL_CM2_MASK           0x8000U
  #define TMRB1_CTRL_OM_MASK            0x07U
  #define TMRB1_CTRL_OM_BITNUM          0x00U
  #define TMRB1_CTRL_SCS_MASK           0x0180U
  #define TMRB1_CTRL_SCS_BITNUM         0x07U
  #define TMRB1_CTRL_PCS_MASK           0x1E00U
  #define TMRB1_CTRL_PCS_BITNUM         0x09U
  #define TMRB1_CTRL_CM_MASK            0xE000U
  #define TMRB1_CTRL_CM_BITNUM          0x0DU
  #define TMRB1_CTRL                    *((volatile word *)0x0000F056)


  /*** TMRB1_SCTRL - Timer B Channel 1 Status and Control Register; 0x0000F057 ***/
  union {
    word Word;
  } TMRB1_SCTRL_STR;
  
  #define TMRB1_SCTRL_OEN_MASK          0x01U
  #define TMRB1_SCTRL_OPS_MASK          0x02U
  #define TMRB1_SCTRL_FORCE_MASK        0x04U
  #define TMRB1_SCTRL_VAL_MASK          0x08U
  #define TMRB1_SCTRL_EEOF_MASK         0x10U
  #define TMRB1_SCTRL_MSTR_MASK         0x20U
  #define TMRB1_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRB1_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRB1_SCTRL_INPUT_MASK        0x0100U
  #define TMRB1_SCTRL_IPS_MASK          0x0200U
  #define TMRB1_SCTRL_IEFIE_MASK        0x0400U
  #define TMRB1_SCTRL_IEF_MASK          0x0800U
  #define TMRB1_SCTRL_TOFIE_MASK        0x1000U
  #define TMRB1_SCTRL_TOF_MASK          0x2000U
  #define TMRB1_SCTRL_TCFIE_MASK        0x4000U
  #define TMRB1_SCTRL_TCF_MASK          0x8000U
  #define TMRB1_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRB1_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRB1_SCTRL                   *((volatile word *)0x0000F057)


  /*** TMRB1_CMPLD1 - Timer B Channel 1 Comparator Load Register 1; 0x0000F058 ***/
  union {
    word Word;
  } TMRB1_CMPLD1_STR;
  
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRB1_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRB1_CMPLD1                  *((volatile word *)0x0000F058)


  /*** TMRB1_CMPLD2 - Timer B Channel 1 Comparator Load Register 2; 0x0000F059 ***/
  union {
    word Word;
  } TMRB1_CMPLD2_STR;
  
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRB1_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRB1_CMPLD2                  *((volatile word *)0x0000F059)


  /*** TMRB1_CSCTRL - Timer B Channel 1 Comparator Status and Control Register; 0x0000F05A ***/
  union {
    word Word;
  } TMRB1_CSCTRL_STR;
  
  #define TMRB1_CSCTRL_CL10_MASK        0x01U
  #define TMRB1_CSCTRL_CL11_MASK        0x02U
  #define TMRB1_CSCTRL_CL20_MASK        0x04U
  #define TMRB1_CSCTRL_CL21_MASK        0x08U
  #define TMRB1_CSCTRL_TCF1_MASK        0x10U
  #define TMRB1_CSCTRL_TCF2_MASK        0x20U
  #define TMRB1_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRB1_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRB1_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRB1_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRB1_CSCTRL_CL1_MASK         0x03U
  #define TMRB1_CSCTRL_CL1_BITNUM       0x00U
  #define TMRB1_CSCTRL_CL2_MASK         0x0CU
  #define TMRB1_CSCTRL_CL2_BITNUM       0x02U
  #define TMRB1_CSCTRL_TCF_1_MASK       0x30U
  #define TMRB1_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRB1_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRB1_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRB1_CSCTRL                  *((volatile word *)0x0000F05A)


  /*** TMRB1_FILT - Timer B Channel 1 Input Filter Register; 0x0000F05B ***/
  union {
    word Word;
  } TMRB1_FILT_STR;
  
  #define TMRB1_FILT_FILT_PER0_MASK     0x01U
  #define TMRB1_FILT_FILT_PER1_MASK     0x02U
  #define TMRB1_FILT_FILT_PER2_MASK     0x04U
  #define TMRB1_FILT_FILT_PER3_MASK     0x08U
  #define TMRB1_FILT_FILT_PER4_MASK     0x10U
  #define TMRB1_FILT_FILT_PER5_MASK     0x20U
  #define TMRB1_FILT_FILT_PER6_MASK     0x40U
  #define TMRB1_FILT_FILT_PER7_MASK     0x80U
  #define TMRB1_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRB1_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRB1_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRB1_FILT_FILT_PER_MASK      0xFFU
  #define TMRB1_FILT_FILT_PER_BITNUM    0x00U
  #define TMRB1_FILT_FILT_CNT_MASK      0x0700U
  #define TMRB1_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRB1_FILT                    *((volatile word *)0x0000F05B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} TMRB1_PRPH;

/******************************************
*** Peripheral TMRB2
*******************************************/
typedef volatile struct {
  /*** TMRB2_COMP1 - Timer B Channel 2 Compare Register #1; 0x0000F060 ***/
  union {
    word Word;
  } TMRB2_COMP1_STR;
  
  #define TMRB2_COMP1                   *((volatile word *)0x0000F060)


  /*** TMRB2_COMP2 - Timer B Channel 2 Compare Register #2; 0x0000F061 ***/
  union {
    word Word;
  } TMRB2_COMP2_STR;
  
  #define TMRB2_COMP2                   *((volatile word *)0x0000F061)


  /*** TMRB2_CAPT - Timer B Channel 2 Capture Register; 0x0000F062 ***/
  union {
    word Word;
  } TMRB2_CAPT_STR;
  
  #define TMRB2_CAPT                    *((volatile word *)0x0000F062)


  /*** TMRB2_LOAD - Timer B Channel 2 Load Register; 0x0000F063 ***/
  union {
    word Word;
  } TMRB2_LOAD_STR;
  
  #define TMRB2_LOAD_LOAD0_MASK         0x01U
  #define TMRB2_LOAD_LOAD1_MASK         0x02U
  #define TMRB2_LOAD_LOAD2_MASK         0x04U
  #define TMRB2_LOAD_LOAD3_MASK         0x08U
  #define TMRB2_LOAD_LOAD4_MASK         0x10U
  #define TMRB2_LOAD_LOAD5_MASK         0x20U
  #define TMRB2_LOAD_LOAD6_MASK         0x40U
  #define TMRB2_LOAD_LOAD7_MASK         0x80U
  #define TMRB2_LOAD_LOAD8_MASK         0x0100U
  #define TMRB2_LOAD_LOAD9_MASK         0x0200U
  #define TMRB2_LOAD_LOAD10_MASK        0x0400U
  #define TMRB2_LOAD_LOAD11_MASK        0x0800U
  #define TMRB2_LOAD_LOAD12_MASK        0x1000U
  #define TMRB2_LOAD_LOAD13_MASK        0x2000U
  #define TMRB2_LOAD_LOAD14_MASK        0x4000U
  #define TMRB2_LOAD_LOAD15_MASK        0x8000U
  #define TMRB2_LOAD                    *((volatile word *)0x0000F063)


  /*** TMRB2_HOLD - Timer B Channel 2 Hold Register; 0x0000F064 ***/
  union {
    word Word;
  } TMRB2_HOLD_STR;
  
  #define TMRB2_HOLD_HOLD0_MASK         0x01U
  #define TMRB2_HOLD_HOLD1_MASK         0x02U
  #define TMRB2_HOLD_HOLD2_MASK         0x04U
  #define TMRB2_HOLD_HOLD3_MASK         0x08U
  #define TMRB2_HOLD_HOLD4_MASK         0x10U
  #define TMRB2_HOLD_HOLD5_MASK         0x20U
  #define TMRB2_HOLD_HOLD6_MASK         0x40U
  #define TMRB2_HOLD_HOLD7_MASK         0x80U
  #define TMRB2_HOLD_HOLD8_MASK         0x0100U
  #define TMRB2_HOLD_HOLD9_MASK         0x0200U
  #define TMRB2_HOLD_HOLD10_MASK        0x0400U
  #define TMRB2_HOLD_HOLD11_MASK        0x0800U
  #define TMRB2_HOLD_HOLD12_MASK        0x1000U
  #define TMRB2_HOLD_HOLD13_MASK        0x2000U
  #define TMRB2_HOLD_HOLD14_MASK        0x4000U
  #define TMRB2_HOLD_HOLD15_MASK        0x8000U
  #define TMRB2_HOLD                    *((volatile word *)0x0000F064)


