goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
} TMRB2_PRPH;

/******************************************
*** Peripheral TMRB3
*******************************************/
typedef volatile struct {
  /*** TMRB3_COMP1 - Timer B Channel 3 Compare Register #1; 0x0000F070 ***/
  union {
    word Word;
  } TMRB3_COMP1_STR;
  
  #define TMRB3_COMP1                   *((volatile word *)0x0000F070)


  /*** TMRB3_COMP2 - Timer B Channel 3 Compare Register #2; 0x0000F071 ***/
  union {
    word Word;
  } TMRB3_COMP2_STR;
  
  #define TMRB3_COMP2                   *((volatile word *)0x0000F071)


  /*** TMRB3_CAPT - Timer B Channel 3 Capture Register; 0x0000F072 ***/
  union {
    word Word;
  } TMRB3_CAPT_STR;
  
  #define TMRB3_CAPT                    *((volatile word *)0x0000F072)


  /*** TMRB3_LOAD - Timer B Channel 3 Load Register; 0x0000F073 ***/
  union {
    word Word;
  } TMRB3_LOAD_STR;
  
  #define TMRB3_LOAD_LOAD0_MASK         0x01U
  #define TMRB3_LOAD_LOAD1_MASK         0x02U
  #define TMRB3_LOAD_LOAD2_MASK         0x04U
  #define TMRB3_LOAD_LOAD3_MASK         0x08U
  #define TMRB3_LOAD_LOAD4_MASK         0x10U
  #define TMRB3_LOAD_LOAD5_MASK         0x20U
  #define TMRB3_LOAD_LOAD6_MASK         0x40U
  #define TMRB3_LOAD_LOAD7_MASK         0x80U
  #define TMRB3_LOAD_LOAD8_MASK         0x0100U
  #define TMRB3_LOAD_LOAD9_MASK         0x0200U
  #define TMRB3_LOAD_LOAD10_MASK        0x0400U
  #define TMRB3_LOAD_LOAD11_MASK        0x0800U
  #define TMRB3_LOAD_LOAD12_MASK        0x1000U
  #define TMRB3_LOAD_LOAD13_MASK        0x2000U
  #define TMRB3_LOAD_LOAD14_MASK        0x4000U
  #define TMRB3_LOAD_LOAD15_MASK        0x8000U
  #define TMRB3_LOAD                    *((volatile word *)0x0000F073)


  /*** TMRB3_HOLD - Timer B Channel 3 Hold Register; 0x0000F074 ***/
  union {
    word Word;
  } TMRB3_HOLD_STR;
  
  #define TMRB3_HOLD_HOLD0_MASK         0x01U
  #define TMRB3_HOLD_HOLD1_MASK         0x02U
  #define TMRB3_HOLD_HOLD2_MASK         0x04U
  #define TMRB3_HOLD_HOLD3_MASK         0x08U
  #define TMRB3_HOLD_HOLD4_MASK         0x10U
  #define TMRB3_HOLD_HOLD5_MASK         0x20U
  #define TMRB3_HOLD_HOLD6_MASK         0x40U
  #define TMRB3_HOLD_HOLD7_MASK         0x80U
  #define TMRB3_HOLD_HOLD8_MASK         0x0100U
  #define TMRB3_HOLD_HOLD9_MASK         0x0200U
  #define TMRB3_HOLD_HOLD10_MASK        0x0400U
  #define TMRB3_HOLD_HOLD11_MASK        0x0800U
  #define TMRB3_HOLD_HOLD12_MASK        0x1000U
  #define TMRB3_HOLD_HOLD13_MASK        0x2000U
  #define TMRB3_HOLD_HOLD14_MASK        0x4000U
  #define TMRB3_HOLD_HOLD15_MASK        0x8000U
  #define TMRB3_HOLD                    *((volatile word *)0x0000F074)


  /*** TMRB3_CNTR - Timer B Channel 3 Counter Register; 0x0000F075 ***/
  union {
    word Word;
  } TMRB3_CNTR_STR;
  
  #define TMRB3_CNTR                    *((volatile word *)0x0000F075)


  /*** TMRB3_CTRL - Timer B Channel 3 Control Register; 0x0000F076 ***/
  union {
    word Word;
  } TMRB3_CTRL_STR;
  
  #define TMRB3_CTRL_OM0_MASK           0x01U
  #define TMRB3_CTRL_OM1_MASK           0x02U
  #define TMRB3_CTRL_OM2_MASK           0x04U
  #define TMRB3_CTRL_Co_INIT_MASK       0x08U
  #define TMRB3_CTRL_DIR_MASK           0x10U
  #define TMRB3_CTRL_LENGTH_MASK        0x20U
  #define TMRB3_CTRL_ONCE_MASK          0x40U
  #define TMRB3_CTRL_SCS0_MASK          0x80U
  #define TMRB3_CTRL_SCS1_MASK          0x0100U
  #define TMRB3_CTRL_PCS0_MASK          0x0200U
  #define TMRB3_CTRL_PCS1_MASK          0x0400U
  #define TMRB3_CTRL_PCS2_MASK          0x0800U
  #define TMRB3_CTRL_PCS3_MASK          0x1000U
  #define TMRB3_CTRL_CM0_MASK           0x2000U
  #define TMRB3_CTRL_CM1_MASK           0x4000U
  #define TMRB3_CTRL_CM2_MASK           0x8000U
  #define TMRB3_CTRL_OM_MASK            0x07U
  #define TMRB3_CTRL_OM_BITNUM          0x00U
  #define TMRB3_CTRL_SCS_MASK           0x0180U
  #define TMRB3_CTRL_SCS_BITNUM         0x07U
  #define TMRB3_CTRL_PCS_MASK           0x1E00U
  #define TMRB3_CTRL_PCS_BITNUM         0x09U
  #define TMRB3_CTRL_CM_MASK            0xE000U
  #define TMRB3_CTRL_CM_BITNUM          0x0DU
  #define TMRB3_CTRL                    *((volatile word *)0x0000F076)


  /*** TMRB3_SCTRL - Timer B Channel 3 Status and Control Register; 0x0000F077 ***/
  union {
    word Word;
  } TMRB3_SCTRL_STR;
  
  #define TMRB3_SCTRL_OEN_MASK          0x01U
  #define TMRB3_SCTRL_OPS_MASK          0x02U
  #define TMRB3_SCTRL_FORCE_MASK        0x04U
  #define TMRB3_SCTRL_VAL_MASK          0x08U
  #define TMRB3_SCTRL_EEOF_MASK         0x10U
  #define TMRB3_SCTRL_MSTR_MASK         0x20U
  #define TMRB3_SCTRL_Capture_Mode0_MASK 0x40U
  #define TMRB3_SCTRL_Capture_Mode1_MASK 0x80U
  #define TMRB3_SCTRL_INPUT_MASK        0x0100U
  #define TMRB3_SCTRL_IPS_MASK          0x0200U
  #define TMRB3_SCTRL_IEFIE_MASK        0x0400U
  #define TMRB3_SCTRL_IEF_MASK          0x0800U
  #define TMRB3_SCTRL_TOFIE_MASK        0x1000U
  #define TMRB3_SCTRL_TOF_MASK          0x2000U
  #define TMRB3_SCTRL_TCFIE_MASK        0x4000U
  #define TMRB3_SCTRL_TCF_MASK          0x8000U
  #define TMRB3_SCTRL_Capture_Mode_MASK 0xC0U
  #define TMRB3_SCTRL_Capture_Mode_BITNUM 0x06U
  #define TMRB3_SCTRL                   *((volatile word *)0x0000F077)


  /*** TMRB3_CMPLD1 - Timer B Channel 3 Comparator Load Register 1; 0x0000F078 ***/
  union {
    word Word;
  } TMRB3_CMPLD1_STR;
  
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_10_MASK 0x01U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_11_MASK 0x02U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_12_MASK 0x04U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_13_MASK 0x08U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_14_MASK 0x10U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_15_MASK 0x20U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_16_MASK 0x40U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_17_MASK 0x80U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_18_MASK 0x0100U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_19_MASK 0x0200U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_110_MASK 0x0400U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_111_MASK 0x0800U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_112_MASK 0x1000U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_113_MASK 0x2000U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_114_MASK 0x4000U
  #define TMRB3_CMPLD1_COMPARATOR_LOAD_115_MASK 0x8000U
  #define TMRB3_CMPLD1                  *((volatile word *)0x0000F078)


  /*** TMRB3_CMPLD2 - Timer B Channel 3 Comparator Load Register 2; 0x0000F079 ***/
  union {
    word Word;
  } TMRB3_CMPLD2_STR;
  
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_20_MASK 0x01U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_21_MASK 0x02U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_22_MASK 0x04U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_23_MASK 0x08U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_24_MASK 0x10U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_25_MASK 0x20U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_26_MASK 0x40U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_27_MASK 0x80U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_28_MASK 0x0100U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_29_MASK 0x0200U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_210_MASK 0x0400U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_211_MASK 0x0800U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_212_MASK 0x1000U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_213_MASK 0x2000U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_214_MASK 0x4000U
  #define TMRB3_CMPLD2_COMPARATOR_LOAD_215_MASK 0x8000U
  #define TMRB3_CMPLD2                  *((volatile word *)0x0000F079)


  /*** TMRB3_CSCTRL - Timer B Channel 3 Comparator Status and Control Register; 0x0000F07A ***/
  union {
    word Word;
  } TMRB3_CSCTRL_STR;
  
