goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define TMRB3_CSCTRL_CL10_MASK        0x01U
  #define TMRB3_CSCTRL_CL11_MASK        0x02U
  #define TMRB3_CSCTRL_CL20_MASK        0x04U
  #define TMRB3_CSCTRL_CL21_MASK        0x08U
  #define TMRB3_CSCTRL_TCF1_MASK        0x10U
  #define TMRB3_CSCTRL_TCF2_MASK        0x20U
  #define TMRB3_CSCTRL_TCF1EN_MASK      0x40U
  #define TMRB3_CSCTRL_TCF2EN_MASK      0x80U
  #define TMRB3_CSCTRL_DBG_EN0_MASK     0x4000U
  #define TMRB3_CSCTRL_DBG_EN1_MASK     0x8000U
  #define TMRB3_CSCTRL_CL1_MASK         0x03U
  #define TMRB3_CSCTRL_CL1_BITNUM       0x00U
  #define TMRB3_CSCTRL_CL2_MASK         0x0CU
  #define TMRB3_CSCTRL_CL2_BITNUM       0x02U
  #define TMRB3_CSCTRL_TCF_1_MASK       0x30U
  #define TMRB3_CSCTRL_TCF_1_BITNUM     0x04U
  #define TMRB3_CSCTRL_DBG_EN_MASK      0xC000U
  #define TMRB3_CSCTRL_DBG_EN_BITNUM    0x0EU
  #define TMRB3_CSCTRL                  *((volatile word *)0x0000F07A)


  /*** TMRB3_FILT - Timer B Channel 3 Input Filter Register; 0x0000F07B ***/
  union {
    word Word;
  } TMRB3_FILT_STR;
  
  #define TMRB3_FILT_FILT_PER0_MASK     0x01U
  #define TMRB3_FILT_FILT_PER1_MASK     0x02U
  #define TMRB3_FILT_FILT_PER2_MASK     0x04U
  #define TMRB3_FILT_FILT_PER3_MASK     0x08U
  #define TMRB3_FILT_FILT_PER4_MASK     0x10U
  #define TMRB3_FILT_FILT_PER5_MASK     0x20U
  #define TMRB3_FILT_FILT_PER6_MASK     0x40U
  #define TMRB3_FILT_FILT_PER7_MASK     0x80U
  #define TMRB3_FILT_FILT_CNT0_MASK     0x0100U
  #define TMRB3_FILT_FILT_CNT1_MASK     0x0200U
  #define TMRB3_FILT_FILT_CNT2_MASK     0x0400U
  #define TMRB3_FILT_FILT_PER_MASK      0xFFU
  #define TMRB3_FILT_FILT_PER_BITNUM    0x00U
  #define TMRB3_FILT_FILT_CNT_MASK      0x0700U
  #define TMRB3_FILT_FILT_CNT_BITNUM    0x08U
  #define TMRB3_FILT                    *((volatile word *)0x0000F07B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} TMRB3_PRPH;

/******************************************
*** Peripheral ADC
*******************************************/
typedef volatile struct {
  /*** ADC_CTRL1 - ADC Control Register; 0x0000F080 ***/
  union {
    word Word;
  } ADC_CTRL1_STR;
  
  #define ADC_CTRL1_SMODE0_MASK         0x01U
  #define ADC_CTRL1_SMODE1_MASK         0x02U
  #define ADC_CTRL1_SMODE2_MASK         0x04U
  #define ADC_CTRL1_CHNCFG_L0_MASK      0x10U
  #define ADC_CTRL1_CHNCFG_L1_MASK      0x20U
  #define ADC_CTRL1_CHNCFG_L2_MASK      0x40U
  #define ADC_CTRL1_CHNCFG_L3_MASK      0x80U
  #define ADC_CTRL1_HLMTIE_MASK         0x0100U
  #define ADC_CTRL1_LLMTIE_MASK         0x0200U
  #define ADC_CTRL1_ZCIE_MASK           0x0400U
  #define ADC_CTRL1_EOSIE0_MASK         0x0800U
  #define ADC_CTRL1_SYNC0_MASK          0x1000U
  #define ADC_CTRL1_START0_MASK         0x2000U
  #define ADC_CTRL1_STOP0_MASK          0x4000U
  #define ADC_CTRL1_SMODE_MASK          0x07U
  #define ADC_CTRL1_SMODE_BITNUM        0x00U
  #define ADC_CTRL1_CHNCFG_L_MASK       0xF0U
  #define ADC_CTRL1_CHNCFG_L_BITNUM     0x04U
  #define ADC_CTRL1                     *((volatile word *)0x0000F080)


  /*** ADC_CTRL2 - ADC Control Register 2; 0x0000F081 ***/
  union {
    word Word;
  } ADC_CTRL2_STR;
  
  #define ADC_CTRL2_DIV0_MASK           0x01U
  #define ADC_CTRL2_DIV1_MASK           0x02U
  #define ADC_CTRL2_DIV2_MASK           0x04U
  #define ADC_CTRL2_DIV3_MASK           0x08U
  #define ADC_CTRL2_DIV4_MASK           0x10U
  #define ADC_CTRL2_SIMULT_MASK         0x20U
  #define ADC_CTRL2_CHNCFG_H0_MASK      0x40U
  #define ADC_CTRL2_CHNCFG_H1_MASK      0x80U
  #define ADC_CTRL2_CHNCFG_H2_MASK      0x0100U
  #define ADC_CTRL2_CHNCFG_H3_MASK      0x0200U
  #define ADC_CTRL2_EOSIE1_MASK         0x0800U
  #define ADC_CTRL2_SYNC1_MASK          0x1000U
  #define ADC_CTRL2_START1_MASK         0x2000U
  #define ADC_CTRL2_STOP1_MASK          0x4000U
  #define ADC_CTRL2_DIV_MASK            0x1FU
  #define ADC_CTRL2_DIV_BITNUM          0x00U
  #define ADC_CTRL2_CHNCFG_H_MASK       0x03C0U
  #define ADC_CTRL2_CHNCFG_H_BITNUM     0x06U
  #define ADC_CTRL2                     *((volatile word *)0x0000F081)


  /*** ADC_ZXCTRL - ADC Zero Crossing Control Register; 0x0000F082 ***/
  union {
    word Word;
  } ADC_ZXCTRL_STR;
  
  #define ADC_ZXCTRL_ZCE00_MASK         0x01U
  #define ADC_ZXCTRL_ZCE01_MASK         0x02U
  #define ADC_ZXCTRL_ZCE10_MASK         0x04U
  #define ADC_ZXCTRL_ZCE11_MASK         0x08U
  #define ADC_ZXCTRL_ZCE20_MASK         0x10U
  #define ADC_ZXCTRL_ZCE21_MASK         0x20U
  #define ADC_ZXCTRL_ZCE30_MASK         0x40U
  #define ADC_ZXCTRL_ZCE31_MASK         0x80U
  #define ADC_ZXCTRL_ZCE40_MASK         0x0100U
  #define ADC_ZXCTRL_ZCE41_MASK         0x0200U
  #define ADC_ZXCTRL_ZCE50_MASK         0x0400U
  #define ADC_ZXCTRL_ZCE51_MASK         0x0800U
  #define ADC_ZXCTRL_ZCE60_MASK         0x1000U
  #define ADC_ZXCTRL_ZCE61_MASK         0x2000U
  #define ADC_ZXCTRL_ZCE70_MASK         0x4000U
  #define ADC_ZXCTRL_ZCE71_MASK         0x8000U
  #define ADC_ZXCTRL_ZCE0_MASK          0x03U
  #define ADC_ZXCTRL_ZCE0_BITNUM        0x00U
  #define ADC_ZXCTRL_ZCE1_MASK          0x0CU
  #define ADC_ZXCTRL_ZCE1_BITNUM        0x02U
  #define ADC_ZXCTRL_ZCE2_MASK          0x30U
  #define ADC_ZXCTRL_ZCE2_BITNUM        0x04U
  #define ADC_ZXCTRL_ZCE3_MASK          0xC0U
  #define ADC_ZXCTRL_ZCE3_BITNUM        0x06U
  #define ADC_ZXCTRL_ZCE4_MASK          0x0300U
  #define ADC_ZXCTRL_ZCE4_BITNUM        0x08U
  #define ADC_ZXCTRL_ZCE5_MASK          0x0C00U
  #define ADC_ZXCTRL_ZCE5_BITNUM        0x0AU
  #define ADC_ZXCTRL_ZCE6_MASK          0x3000U
  #define ADC_ZXCTRL_ZCE6_BITNUM        0x0CU
  #define ADC_ZXCTRL_ZCE7_MASK          0xC000U
  #define ADC_ZXCTRL_ZCE7_BITNUM        0x0EU
  #define ADC_ZXCTRL                    *((volatile word *)0x0000F082)


  /*** ADC_CLIST1 - ADC Channel List Register 1; 0x0000F083 ***/
  union {
    word Word;
  } ADC_CLIST1_STR;
  
  #define ADC_CLIST1_SAMPLE00_MASK      0x01U
  #define ADC_CLIST1_SAMPLE01_MASK      0x02U
  #define ADC_CLIST1_SAMPLE02_MASK      0x04U
  #define ADC_CLIST1_SAMPLE03_MASK      0x08U
  #define ADC_CLIST1_SAMPLE10_MASK      0x10U
  #define ADC_CLIST1_SAMPLE11_MASK      0x20U
  #define ADC_CLIST1_SAMPLE12_MASK      0x40U
  #define ADC_CLIST1_SAMPLE13_MASK      0x80U
  #define ADC_CLIST1_SAMPLE20_MASK      0x0100U
  #define ADC_CLIST1_SAMPLE21_MASK      0x0200U
  #define ADC_CLIST1_SAMPLE22_MASK      0x0400U
  #define ADC_CLIST1_SAMPLE23_MASK      0x0800U
  #define ADC_CLIST1_SAMPLE30_MASK      0x1000U
  #define ADC_CLIST1_SAMPLE31_MASK      0x2000U
  #define ADC_CLIST1_SAMPLE32_MASK      0x4000U
  #define ADC_CLIST1_SAMPLE33_MASK      0x8000U
  #define ADC_CLIST1_SAMPLE0_MASK       0x0FU
  #define ADC_CLIST1_SAMPLE0_BITNUM     0x00U
  #define ADC_CLIST1_SAMPLE1_MASK       0xF0U
  #define ADC_CLIST1_SAMPLE1_BITNUM     0x04U
  #define ADC_CLIST1_SAMPLE2_MASK       0x0F00U
  #define ADC_CLIST1_SAMPLE2_BITNUM     0x08U
  #define ADC_CLIST1_SAMPLE3_MASK       0xF000U
  #define ADC_CLIST1_SAMPLE3_BITNUM     0x0CU
  #define ADC_CLIST1                    *((volatile word *)0x0000F083)


  /*** ADC_CLIST2 - ADC Channel List Register 2; 0x0000F084 ***/
  union {
    word Word;
  } ADC_CLIST2_STR;
  
