goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define ADC_CLIST2_SAMPLE40_MASK      0x01U
  #define ADC_CLIST2_SAMPLE41_MASK      0x02U
  #define ADC_CLIST2_SAMPLE42_MASK      0x04U
  #define ADC_CLIST2_SAMPLE43_MASK      0x08U
  #define ADC_CLIST2_SAMPLE50_MASK      0x10U
  #define ADC_CLIST2_SAMPLE51_MASK      0x20U
  #define ADC_CLIST2_SAMPLE52_MASK      0x40U
  #define ADC_CLIST2_SAMPLE53_MASK      0x80U
  #define ADC_CLIST2_SAMPLE60_MASK      0x0100U
  #define ADC_CLIST2_SAMPLE61_MASK      0x0200U
  #define ADC_CLIST2_SAMPLE62_MASK      0x0400U
  #define ADC_CLIST2_SAMPLE63_MASK      0x0800U
  #define ADC_CLIST2_SAMPLE70_MASK      0x1000U
  #define ADC_CLIST2_SAMPLE71_MASK      0x2000U
  #define ADC_CLIST2_SAMPLE72_MASK      0x4000U
  #define ADC_CLIST2_SAMPLE73_MASK      0x8000U
  #define ADC_CLIST2_SAMPLE4_MASK       0x0FU
  #define ADC_CLIST2_SAMPLE4_BITNUM     0x00U
  #define ADC_CLIST2_SAMPLE5_MASK       0xF0U
  #define ADC_CLIST2_SAMPLE5_BITNUM     0x04U
  #define ADC_CLIST2_SAMPLE6_MASK       0x0F00U
  #define ADC_CLIST2_SAMPLE6_BITNUM     0x08U
  #define ADC_CLIST2_SAMPLE7_MASK       0xF000U
  #define ADC_CLIST2_SAMPLE7_BITNUM     0x0CU
  #define ADC_CLIST2                    *((volatile word *)0x0000F084)


  /*** ADC_CLIST3 - ADC Channel List Register 3; 0x0000F085 ***/
  union {
    word Word;
  } ADC_CLIST3_STR;
  
  #define ADC_CLIST3_SAMPLE80_MASK      0x01U
  #define ADC_CLIST3_SAMPLE81_MASK      0x02U
  #define ADC_CLIST3_SAMPLE82_MASK      0x04U
  #define ADC_CLIST3_SAMPLE83_MASK      0x08U
  #define ADC_CLIST3_SAMPLE90_MASK      0x10U
  #define ADC_CLIST3_SAMPLE91_MASK      0x20U
  #define ADC_CLIST3_SAMPLE92_MASK      0x40U
  #define ADC_CLIST3_SAMPLE93_MASK      0x80U
  #define ADC_CLIST3_SAMPLE100_MASK     0x0100U
  #define ADC_CLIST3_SAMPLE101_MASK     0x0200U
  #define ADC_CLIST3_SAMPLE102_MASK     0x0400U
  #define ADC_CLIST3_SAMPLE103_MASK     0x0800U
  #define ADC_CLIST3_SAMPLE110_MASK     0x1000U
  #define ADC_CLIST3_SAMPLE111_MASK     0x2000U
  #define ADC_CLIST3_SAMPLE112_MASK     0x4000U
  #define ADC_CLIST3_SAMPLE113_MASK     0x8000U
  #define ADC_CLIST3_SAMPLE8_MASK       0x0FU
  #define ADC_CLIST3_SAMPLE8_BITNUM     0x00U
  #define ADC_CLIST3_SAMPLE9_MASK       0xF0U
  #define ADC_CLIST3_SAMPLE9_BITNUM     0x04U
  #define ADC_CLIST3_SAMPLE10_MASK      0x0F00U
  #define ADC_CLIST3_SAMPLE10_BITNUM    0x08U
  #define ADC_CLIST3_SAMPLE11_MASK      0xF000U
  #define ADC_CLIST3_SAMPLE11_BITNUM    0x0CU
  #define ADC_CLIST3                    *((volatile word *)0x0000F085)


  /*** ADC_CLIST4 - ADC Channel List Register 4; 0x0000F086 ***/
  union {
    word Word;
  } ADC_CLIST4_STR;
  
  #define ADC_CLIST4_SAMPLE120_MASK     0x01U
  #define ADC_CLIST4_SAMPLE121_MASK     0x02U
  #define ADC_CLIST4_SAMPLE122_MASK     0x04U
  #define ADC_CLIST4_SAMPLE123_MASK     0x08U
  #define ADC_CLIST4_SAMPLE130_MASK     0x10U
  #define ADC_CLIST4_SAMPLE131_MASK     0x20U
  #define ADC_CLIST4_SAMPLE132_MASK     0x40U
  #define ADC_CLIST4_SAMPLE133_MASK     0x80U
  #define ADC_CLIST4_SAMPLE140_MASK     0x0100U
  #define ADC_CLIST4_SAMPLE141_MASK     0x0200U
  #define ADC_CLIST4_SAMPLE142_MASK     0x0400U
  #define ADC_CLIST4_SAMPLE143_MASK     0x0800U
  #define ADC_CLIST4_SAMPLE150_MASK     0x1000U
  #define ADC_CLIST4_SAMPLE151_MASK     0x2000U
  #define ADC_CLIST4_SAMPLE152_MASK     0x4000U
  #define ADC_CLIST4_SAMPLE153_MASK     0x8000U
  #define ADC_CLIST4_SAMPLE12_MASK      0x0FU
  #define ADC_CLIST4_SAMPLE12_BITNUM    0x00U
  #define ADC_CLIST4_SAMPLE13_MASK      0xF0U
  #define ADC_CLIST4_SAMPLE13_BITNUM    0x04U
  #define ADC_CLIST4_SAMPLE14_MASK      0x0F00U
  #define ADC_CLIST4_SAMPLE14_BITNUM    0x08U
  #define ADC_CLIST4_SAMPLE15_MASK      0xF000U
  #define ADC_CLIST4_SAMPLE15_BITNUM    0x0CU
  #define ADC_CLIST4                    *((volatile word *)0x0000F086)


  /*** ADC_SDIS - ADC Sample Disable Register; 0x0000F087 ***/
  union {
    word Word;
  } ADC_SDIS_STR;
  
  #define ADC_SDIS_DS0_MASK             0x01U
  #define ADC_SDIS_DS1_MASK             0x02U
  #define ADC_SDIS_DS2_MASK             0x04U
  #define ADC_SDIS_DS3_MASK             0x08U
  #define ADC_SDIS_DS4_MASK             0x10U
  #define ADC_SDIS_DS5_MASK             0x20U
  #define ADC_SDIS_DS6_MASK             0x40U
  #define ADC_SDIS_DS7_MASK             0x80U
  #define ADC_SDIS_DS8_MASK             0x0100U
  #define ADC_SDIS_DS9_MASK             0x0200U
  #define ADC_SDIS_DS10_MASK            0x0400U
  #define ADC_SDIS_DS11_MASK            0x0800U
  #define ADC_SDIS_DS12_MASK            0x1000U
  #define ADC_SDIS_DS13_MASK            0x2000U
  #define ADC_SDIS_DS14_MASK            0x4000U
  #define ADC_SDIS_DS15_MASK            0x8000U
  #define ADC_SDIS                      *((volatile word *)0x0000F087)


  /*** ADC_STAT - ADC Status Register; 0x0000F088 ***/
  union {
    word Word;
  } ADC_STAT_STR;
  
  #define ADC_STAT_RDY0_MASK            0x01U
  #define ADC_STAT_RDY1_MASK            0x02U
  #define ADC_STAT_RDY2_MASK            0x04U
  #define ADC_STAT_RDY3_MASK            0x08U
  #define ADC_STAT_RDY4_MASK            0x10U
  #define ADC_STAT_RDY5_MASK            0x20U
  #define ADC_STAT_RDY6_MASK            0x40U
  #define ADC_STAT_RDY7_MASK            0x80U
  #define ADC_STAT_HLMTI_MASK           0x0100U
  #define ADC_STAT_LLMTI_MASK           0x0200U
  #define ADC_STAT_ZCI_MASK             0x0400U
  #define ADC_STAT_EOSI0_MASK           0x0800U
  #define ADC_STAT_EOSI1_MASK           0x1000U
  #define ADC_STAT_CIP1_MASK            0x4000U
  #define ADC_STAT_CIP0_MASK            0x8000U
  #define ADC_STAT_RDY_MASK             0xFFU
  #define ADC_STAT_RDY_BITNUM           0x00U
  #define ADC_STAT_EOSI_MASK            0x1800U
  #define ADC_STAT_EOSI_BITNUM          0x0BU
  #define ADC_STAT                      *((volatile word *)0x0000F088)


  /*** ADC_RDY - ADC Conversion Ready Register; 0x0000F089 ***/
  union {
    word Word;
  } ADC_RDY_STR;
  
