goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define ADC_RDY_RDY0_MASK             0x01U
  #define ADC_RDY_RDY1_MASK             0x02U
  #define ADC_RDY_RDY2_MASK             0x04U
  #define ADC_RDY_RDY3_MASK             0x08U
  #define ADC_RDY_RDY4_MASK             0x10U
  #define ADC_RDY_RDY5_MASK             0x20U
  #define ADC_RDY_RDY6_MASK             0x40U
  #define ADC_RDY_RDY7_MASK             0x80U
  #define ADC_RDY_RDY8_MASK             0x0100U
  #define ADC_RDY_RDY9_MASK             0x0200U
  #define ADC_RDY_RDY10_MASK            0x0400U
  #define ADC_RDY_RDY11_MASK            0x0800U
  #define ADC_RDY_RDY12_MASK            0x1000U
  #define ADC_RDY_RDY13_MASK            0x2000U
  #define ADC_RDY_RDY14_MASK            0x4000U
  #define ADC_RDY_RDY15_MASK            0x8000U
  #define ADC_RDY                       *((volatile word *)0x0000F089)


  /*** ADC_LIMSTAT - ADC Limit Status Register; 0x0000F08A ***/
  union {
    word Word;
  } ADC_LIMSTAT_STR;
  
  #define ADC_LIMSTAT_LLS0_MASK         0x01U
  #define ADC_LIMSTAT_LLS1_MASK         0x02U
  #define ADC_LIMSTAT_LLS2_MASK         0x04U
  #define ADC_LIMSTAT_LLS3_MASK         0x08U
  #define ADC_LIMSTAT_LLS4_MASK         0x10U
  #define ADC_LIMSTAT_LLS5_MASK         0x20U
  #define ADC_LIMSTAT_LLS6_MASK         0x40U
  #define ADC_LIMSTAT_LLS7_MASK         0x80U
  #define ADC_LIMSTAT_HLS0_MASK         0x0100U
  #define ADC_LIMSTAT_HLS1_MASK         0x0200U
  #define ADC_LIMSTAT_HLS2_MASK         0x0400U
  #define ADC_LIMSTAT_HLS3_MASK         0x0800U
  #define ADC_LIMSTAT_HLS4_MASK         0x1000U
  #define ADC_LIMSTAT_HLS5_MASK         0x2000U
  #define ADC_LIMSTAT_HLS6_MASK         0x4000U
  #define ADC_LIMSTAT_HLS7_MASK         0x8000U
  #define ADC_LIMSTAT_LLS_MASK          0xFFU
  #define ADC_LIMSTAT_LLS_BITNUM        0x00U
  #define ADC_LIMSTAT_HLS_MASK          0xFF00U
  #define ADC_LIMSTAT_HLS_BITNUM        0x08U
  #define ADC_LIMSTAT                   *((volatile word *)0x0000F08A)


  /*** ADC_ZXSTAT - ADC Zero Crossing Status Register; 0x0000F08B ***/
  union {
    word Word;
  } ADC_ZXSTAT_STR;
  
  #define ADC_ZXSTAT_ZCS0_MASK          0x01U
  #define ADC_ZXSTAT_ZCS1_MASK          0x02U
  #define ADC_ZXSTAT_ZCS2_MASK          0x04U
  #define ADC_ZXSTAT_ZCS3_MASK          0x08U
  #define ADC_ZXSTAT_ZCS4_MASK          0x10U
  #define ADC_ZXSTAT_ZCS5_MASK          0x20U
  #define ADC_ZXSTAT_ZCS6_MASK          0x40U
  #define ADC_ZXSTAT_ZCS7_MASK          0x80U
  #define ADC_ZXSTAT_ZCS_MASK           0xFFU
  #define ADC_ZXSTAT_ZCS_BITNUM         0x00U
  #define ADC_ZXSTAT                    *((volatile word *)0x0000F08B)


  /*** ADC_RSLT0 - ADC Result Register 0; 0x0000F08C ***/
  union {
    word Word;
  } ADC_RSLT0_STR;
  
  #define ADC_RSLT0_RSLT0_MASK          0x08U
  #define ADC_RSLT0_RSLT1_MASK          0x10U
  #define ADC_RSLT0_RSLT2_MASK          0x20U
  #define ADC_RSLT0_RSLT3_MASK          0x40U
  #define ADC_RSLT0_RSLT4_MASK          0x80U
  #define ADC_RSLT0_RSLT5_MASK          0x0100U
  #define ADC_RSLT0_RSLT6_MASK          0x0200U
  #define ADC_RSLT0_RSLT7_MASK          0x0400U
  #define ADC_RSLT0_RSLT8_MASK          0x0800U
  #define ADC_RSLT0_RSLT9_MASK          0x1000U
  #define ADC_RSLT0_RSLT10_MASK         0x2000U
  #define ADC_RSLT0_RSLT11_MASK         0x4000U
  #define ADC_RSLT0_SEXT_MASK           0x8000U
  #define ADC_RSLT0_RSLT_MASK           0x7FF8U
  #define ADC_RSLT0_RSLT_BITNUM         0x03U
  #define ADC_RSLT0                     *((volatile word *)0x0000F08C)


  /*** ADC_RSLT1 - ADC Result Register 1; 0x0000F08D ***/
  union {
    word Word;
  } ADC_RSLT1_STR;
  
  #define ADC_RSLT1_RSLT0_MASK          0x08U
  #define ADC_RSLT1_RSLT1_MASK          0x10U
  #define ADC_RSLT1_RSLT2_MASK          0x20U
  #define ADC_RSLT1_RSLT3_MASK          0x40U
  #define ADC_RSLT1_RSLT4_MASK          0x80U
  #define ADC_RSLT1_RSLT5_MASK          0x0100U
  #define ADC_RSLT1_RSLT6_MASK          0x0200U
  #define ADC_RSLT1_RSLT7_MASK          0x0400U
  #define ADC_RSLT1_RSLT8_MASK          0x0800U
  #define ADC_RSLT1_RSLT9_MASK          0x1000U
  #define ADC_RSLT1_RSLT10_MASK         0x2000U
  #define ADC_RSLT1_RSLT11_MASK         0x4000U
  #define ADC_RSLT1_SEXT_MASK           0x8000U
  #define ADC_RSLT1_RSLT_MASK           0x7FF8U
  #define ADC_RSLT1_RSLT_BITNUM         0x03U
  #define ADC_RSLT1                     *((volatile word *)0x0000F08D)


  /*** ADC_RSLT2 - ADC Result Register 2; 0x0000F08E ***/
  union {
    word Word;
  } ADC_RSLT2_STR;
  
  #define ADC_RSLT2_RSLT0_MASK          0x08U
  #define ADC_RSLT2_RSLT1_MASK          0x10U
  #define ADC_RSLT2_RSLT2_MASK          0x20U
  #define ADC_RSLT2_RSLT3_MASK          0x40U
  #define ADC_RSLT2_RSLT4_MASK          0x80U
  #define ADC_RSLT2_RSLT5_MASK          0x0100U
  #define ADC_RSLT2_RSLT6_MASK          0x0200U
  #define ADC_RSLT2_RSLT7_MASK          0x0400U
  #define ADC_RSLT2_RSLT8_MASK          0x0800U
  #define ADC_RSLT2_RSLT9_MASK          0x1000U
  #define ADC_RSLT2_RSLT10_MASK         0x2000U
  #define ADC_RSLT2_RSLT11_MASK         0x4000U
  #define ADC_RSLT2_SEXT_MASK           0x8000U
  #define ADC_RSLT2_RSLT_MASK           0x7FF8U
  #define ADC_RSLT2_RSLT_BITNUM         0x03U
  #define ADC_RSLT2                     *((volatile word *)0x0000F08E)


  /*** ADC_RSLT3 - ADC Result Register 3; 0x0000F08F ***/
  union {
    word Word;
  } ADC_RSLT3_STR;
  
  #define ADC_RSLT3_RSLT0_MASK          0x08U
  #define ADC_RSLT3_RSLT1_MASK          0x10U
  #define ADC_RSLT3_RSLT2_MASK          0x20U
  #define ADC_RSLT3_RSLT3_MASK          0x40U
  #define ADC_RSLT3_RSLT4_MASK          0x80U
  #define ADC_RSLT3_RSLT5_MASK          0x0100U
  #define ADC_RSLT3_RSLT6_MASK          0x0200U
  #define ADC_RSLT3_RSLT7_MASK          0x0400U
  #define ADC_RSLT3_RSLT8_MASK          0x0800U
  #define ADC_RSLT3_RSLT9_MASK          0x1000U
  #define ADC_RSLT3_RSLT10_MASK         0x2000U
  #define ADC_RSLT3_RSLT11_MASK         0x4000U
  #define ADC_RSLT3_SEXT_MASK           0x8000U
  #define ADC_RSLT3_RSLT_MASK           0x7FF8U
  #define ADC_RSLT3_RSLT_BITNUM         0x03U
  #define ADC_RSLT3                     *((volatile word *)0x0000F08F)


