goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** ADC_RSLT4 - ADC Result Register 4; 0x0000F090 ***/
  union {
    word Word;
  } ADC_RSLT4_STR;
  
  #define ADC_RSLT4_RSLT0_MASK          0x08U
  #define ADC_RSLT4_RSLT1_MASK          0x10U
  #define ADC_RSLT4_RSLT2_MASK          0x20U
  #define ADC_RSLT4_RSLT3_MASK          0x40U
  #define ADC_RSLT4_RSLT4_MASK          0x80U
  #define ADC_RSLT4_RSLT5_MASK          0x0100U
  #define ADC_RSLT4_RSLT6_MASK          0x0200U
  #define ADC_RSLT4_RSLT7_MASK          0x0400U
  #define ADC_RSLT4_RSLT8_MASK          0x0800U
  #define ADC_RSLT4_RSLT9_MASK          0x1000U
  #define ADC_RSLT4_RSLT10_MASK         0x2000U
  #define ADC_RSLT4_RSLT11_MASK         0x4000U
  #define ADC_RSLT4_SEXT_MASK           0x8000U
  #define ADC_RSLT4_RSLT_MASK           0x7FF8U
  #define ADC_RSLT4_RSLT_BITNUM         0x03U
  #define ADC_RSLT4                     *((volatile word *)0x0000F090)


  /*** ADC_RSLT5 - ADC Result Register 5; 0x0000F091 ***/
  union {
    word Word;
  } ADC_RSLT5_STR;
  
  #define ADC_RSLT5_RSLT0_MASK          0x08U
  #define ADC_RSLT5_RSLT1_MASK          0x10U
  #define ADC_RSLT5_RSLT2_MASK          0x20U
  #define ADC_RSLT5_RSLT3_MASK          0x40U
  #define ADC_RSLT5_RSLT4_MASK          0x80U
  #define ADC_RSLT5_RSLT5_MASK          0x0100U
  #define ADC_RSLT5_RSLT6_MASK          0x0200U
  #define ADC_RSLT5_RSLT7_MASK          0x0400U
  #define ADC_RSLT5_RSLT8_MASK          0x0800U
  #define ADC_RSLT5_RSLT9_MASK          0x1000U
  #define ADC_RSLT5_RSLT10_MASK         0x2000U
  #define ADC_RSLT5_RSLT11_MASK         0x4000U
  #define ADC_RSLT5_SEXT_MASK           0x8000U
  #define ADC_RSLT5_RSLT_MASK           0x7FF8U
  #define ADC_RSLT5_RSLT_BITNUM         0x03U
  #define ADC_RSLT5                     *((volatile word *)0x0000F091)


  /*** ADC_RSLT6 - ADC Result Register 6; 0x0000F092 ***/
  union {
    word Word;
  } ADC_RSLT6_STR;
  
  #define ADC_RSLT6_RSLT0_MASK          0x08U
  #define ADC_RSLT6_RSLT1_MASK          0x10U
  #define ADC_RSLT6_RSLT2_MASK          0x20U
  #define ADC_RSLT6_RSLT3_MASK          0x40U
  #define ADC_RSLT6_RSLT4_MASK          0x80U
  #define ADC_RSLT6_RSLT5_MASK          0x0100U
  #define ADC_RSLT6_RSLT6_MASK          0x0200U
  #define ADC_RSLT6_RSLT7_MASK          0x0400U
  #define ADC_RSLT6_RSLT8_MASK          0x0800U
  #define ADC_RSLT6_RSLT9_MASK          0x1000U
  #define ADC_RSLT6_RSLT10_MASK         0x2000U
  #define ADC_RSLT6_RSLT11_MASK         0x4000U
  #define ADC_RSLT6_SEXT_MASK           0x8000U
  #define ADC_RSLT6_RSLT_MASK           0x7FF8U
  #define ADC_RSLT6_RSLT_BITNUM         0x03U
  #define ADC_RSLT6                     *((volatile word *)0x0000F092)


  /*** ADC_RSLT7 - ADC Result Register 7; 0x0000F093 ***/
  union {
    word Word;
  } ADC_RSLT7_STR;
  
  #define ADC_RSLT7_RSLT0_MASK          0x08U
  #define ADC_RSLT7_RSLT1_MASK          0x10U
  #define ADC_RSLT7_RSLT2_MASK          0x20U
  #define ADC_RSLT7_RSLT3_MASK          0x40U
  #define ADC_RSLT7_RSLT4_MASK          0x80U
  #define ADC_RSLT7_RSLT5_MASK          0x0100U
  #define ADC_RSLT7_RSLT6_MASK          0x0200U
  #define ADC_RSLT7_RSLT7_MASK          0x0400U
  #define ADC_RSLT7_RSLT8_MASK          0x0800U
  #define ADC_RSLT7_RSLT9_MASK          0x1000U
  #define ADC_RSLT7_RSLT10_MASK         0x2000U
  #define ADC_RSLT7_RSLT11_MASK         0x4000U
  #define ADC_RSLT7_SEXT_MASK           0x8000U
  #define ADC_RSLT7_RSLT_MASK           0x7FF8U
  #define ADC_RSLT7_RSLT_BITNUM         0x03U
  #define ADC_RSLT7                     *((volatile word *)0x0000F093)


  /*** ADC_RSLT8 - ADC Result Register 8; 0x0000F094 ***/
  union {
    word Word;
  } ADC_RSLT8_STR;
  
  #define ADC_RSLT8_RSLT0_MASK          0x08U
  #define ADC_RSLT8_RSLT1_MASK          0x10U
  #define ADC_RSLT8_RSLT2_MASK          0x20U
  #define ADC_RSLT8_RSLT3_MASK          0x40U
  #define ADC_RSLT8_RSLT4_MASK          0x80U
  #define ADC_RSLT8_RSLT5_MASK          0x0100U
  #define ADC_RSLT8_RSLT6_MASK          0x0200U
  #define ADC_RSLT8_RSLT7_MASK          0x0400U
  #define ADC_RSLT8_RSLT8_MASK          0x0800U
  #define ADC_RSLT8_RSLT9_MASK          0x1000U
  #define ADC_RSLT8_RSLT10_MASK         0x2000U
  #define ADC_RSLT8_RSLT11_MASK         0x4000U
  #define ADC_RSLT8_SEXT_MASK           0x8000U
  #define ADC_RSLT8_RSLT_MASK           0x7FF8U
  #define ADC_RSLT8_RSLT_BITNUM         0x03U
  #define ADC_RSLT8                     *((volatile word *)0x0000F094)


  /*** ADC_RSLT9 - ADC Result Register 9; 0x0000F095 ***/
  union {
    word Word;
  } ADC_RSLT9_STR;
  
  #define ADC_RSLT9_RSLT0_MASK          0x08U
  #define ADC_RSLT9_RSLT1_MASK          0x10U
  #define ADC_RSLT9_RSLT2_MASK          0x20U
  #define ADC_RSLT9_RSLT3_MASK          0x40U
  #define ADC_RSLT9_RSLT4_MASK          0x80U
  #define ADC_RSLT9_RSLT5_MASK          0x0100U
  #define ADC_RSLT9_RSLT6_MASK          0x0200U
  #define ADC_RSLT9_RSLT7_MASK          0x0400U
  #define ADC_RSLT9_RSLT8_MASK          0x0800U
  #define ADC_RSLT9_RSLT9_MASK          0x1000U
  #define ADC_RSLT9_RSLT10_MASK         0x2000U
  #define ADC_RSLT9_RSLT11_MASK         0x4000U
  #define ADC_RSLT9_SEXT_MASK           0x8000U
  #define ADC_RSLT9_RSLT_MASK           0x7FF8U
  #define ADC_RSLT9_RSLT_BITNUM         0x03U
  #define ADC_RSLT9                     *((volatile word *)0x0000F095)


  /*** ADC_RSLT10 - ADC Result Register 10; 0x0000F096 ***/
  union {
    word Word;
  } ADC_RSLT10_STR;
  
  #define ADC_RSLT10_RSLT0_MASK         0x08U
  #define ADC_RSLT10_RSLT1_MASK         0x10U
  #define ADC_RSLT10_RSLT2_MASK         0x20U
  #define ADC_RSLT10_RSLT3_MASK         0x40U
  #define ADC_RSLT10_RSLT4_MASK         0x80U
  #define ADC_RSLT10_RSLT5_MASK         0x0100U
  #define ADC_RSLT10_RSLT6_MASK         0x0200U
  #define ADC_RSLT10_RSLT7_MASK         0x0400U
  #define ADC_RSLT10_RSLT8_MASK         0x0800U
  #define ADC_RSLT10_RSLT9_MASK         0x1000U
  #define ADC_RSLT10_RSLT10_MASK        0x2000U
  #define ADC_RSLT10_RSLT11_MASK        0x4000U
  #define ADC_RSLT10_SEXT_MASK          0x8000U
  #define ADC_RSLT10_RSLT_MASK          0x7FF8U
  #define ADC_RSLT10_RSLT_BITNUM        0x03U
  #define ADC_RSLT10                    *((volatile word *)0x0000F096)


