goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** ADC_RSLT11 - ADC Result Register 11; 0x0000F097 ***/
  union {
    word Word;
  } ADC_RSLT11_STR;
  
  #define ADC_RSLT11_RSLT0_MASK         0x08U
  #define ADC_RSLT11_RSLT1_MASK         0x10U
  #define ADC_RSLT11_RSLT2_MASK         0x20U
  #define ADC_RSLT11_RSLT3_MASK         0x40U
  #define ADC_RSLT11_RSLT4_MASK         0x80U
  #define ADC_RSLT11_RSLT5_MASK         0x0100U
  #define ADC_RSLT11_RSLT6_MASK         0x0200U
  #define ADC_RSLT11_RSLT7_MASK         0x0400U
  #define ADC_RSLT11_RSLT8_MASK         0x0800U
  #define ADC_RSLT11_RSLT9_MASK         0x1000U
  #define ADC_RSLT11_RSLT10_MASK        0x2000U
  #define ADC_RSLT11_RSLT11_MASK        0x4000U
  #define ADC_RSLT11_SEXT_MASK          0x8000U
  #define ADC_RSLT11_RSLT_MASK          0x7FF8U
  #define ADC_RSLT11_RSLT_BITNUM        0x03U
  #define ADC_RSLT11                    *((volatile word *)0x0000F097)


  /*** ADC_RSLT12 - ADC Result Register 12; 0x0000F098 ***/
  union {
    word Word;
  } ADC_RSLT12_STR;
  
  #define ADC_RSLT12_RSLT0_MASK         0x08U
  #define ADC_RSLT12_RSLT1_MASK         0x10U
  #define ADC_RSLT12_RSLT2_MASK         0x20U
  #define ADC_RSLT12_RSLT3_MASK         0x40U
  #define ADC_RSLT12_RSLT4_MASK         0x80U
  #define ADC_RSLT12_RSLT5_MASK         0x0100U
  #define ADC_RSLT12_RSLT6_MASK         0x0200U
  #define ADC_RSLT12_RSLT7_MASK         0x0400U
  #define ADC_RSLT12_RSLT8_MASK         0x0800U
  #define ADC_RSLT12_RSLT9_MASK         0x1000U
  #define ADC_RSLT12_RSLT10_MASK        0x2000U
  #define ADC_RSLT12_RSLT11_MASK        0x4000U
  #define ADC_RSLT12_SEXT_MASK          0x8000U
  #define ADC_RSLT12_RSLT_MASK          0x7FF8U
  #define ADC_RSLT12_RSLT_BITNUM        0x03U
  #define ADC_RSLT12                    *((volatile word *)0x0000F098)


  /*** ADC_RSLT13 - ADC Result Register 13; 0x0000F099 ***/
  union {
    word Word;
  } ADC_RSLT13_STR;
  
  #define ADC_RSLT13_RSLT0_MASK         0x08U
  #define ADC_RSLT13_RSLT1_MASK         0x10U
  #define ADC_RSLT13_RSLT2_MASK         0x20U
  #define ADC_RSLT13_RSLT3_MASK         0x40U
  #define ADC_RSLT13_RSLT4_MASK         0x80U
  #define ADC_RSLT13_RSLT5_MASK         0x0100U
  #define ADC_RSLT13_RSLT6_MASK         0x0200U
  #define ADC_RSLT13_RSLT7_MASK         0x0400U
  #define ADC_RSLT13_RSLT8_MASK         0x0800U
  #define ADC_RSLT13_RSLT9_MASK         0x1000U
  #define ADC_RSLT13_RSLT10_MASK        0x2000U
  #define ADC_RSLT13_RSLT11_MASK        0x4000U
  #define ADC_RSLT13_SEXT_MASK          0x8000U
  #define ADC_RSLT13_RSLT_MASK          0x7FF8U
  #define ADC_RSLT13_RSLT_BITNUM        0x03U
  #define ADC_RSLT13                    *((volatile word *)0x0000F099)


  /*** ADC_RSLT14 - ADC Result Register 14; 0x0000F09A ***/
  union {
    word Word;
  } ADC_RSLT14_STR;
  
  #define ADC_RSLT14_RSLT0_MASK         0x08U
  #define ADC_RSLT14_RSLT1_MASK         0x10U
  #define ADC_RSLT14_RSLT2_MASK         0x20U
  #define ADC_RSLT14_RSLT3_MASK         0x40U
  #define ADC_RSLT14_RSLT4_MASK         0x80U
  #define ADC_RSLT14_RSLT5_MASK         0x0100U
  #define ADC_RSLT14_RSLT6_MASK         0x0200U
  #define ADC_RSLT14_RSLT7_MASK         0x0400U
  #define ADC_RSLT14_RSLT8_MASK         0x0800U
  #define ADC_RSLT14_RSLT9_MASK         0x1000U
  #define ADC_RSLT14_RSLT10_MASK        0x2000U
  #define ADC_RSLT14_RSLT11_MASK        0x4000U
  #define ADC_RSLT14_SEXT_MASK          0x8000U
  #define ADC_RSLT14_RSLT_MASK          0x7FF8U
  #define ADC_RSLT14_RSLT_BITNUM        0x03U
  #define ADC_RSLT14                    *((volatile word *)0x0000F09A)


  /*** ADC_RSLT15 - ADC Result Register 15; 0x0000F09B ***/
  union {
    word Word;
  } ADC_RSLT15_STR;
  
  #define ADC_RSLT15_RSLT0_MASK         0x08U
  #define ADC_RSLT15_RSLT1_MASK         0x10U
  #define ADC_RSLT15_RSLT2_MASK         0x20U
  #define ADC_RSLT15_RSLT3_MASK         0x40U
  #define ADC_RSLT15_RSLT4_MASK         0x80U
  #define ADC_RSLT15_RSLT5_MASK         0x0100U
  #define ADC_RSLT15_RSLT6_MASK         0x0200U
  #define ADC_RSLT15_RSLT7_MASK         0x0400U
  #define ADC_RSLT15_RSLT8_MASK         0x0800U
  #define ADC_RSLT15_RSLT9_MASK         0x1000U
  #define ADC_RSLT15_RSLT10_MASK        0x2000U
  #define ADC_RSLT15_RSLT11_MASK        0x4000U
  #define ADC_RSLT15_SEXT_MASK          0x8000U
  #define ADC_RSLT15_RSLT_MASK          0x7FF8U
  #define ADC_RSLT15_RSLT_BITNUM        0x03U
  #define ADC_RSLT15                    *((volatile word *)0x0000F09B)


  /*** ADC_LOLIM0 - ADC Low Limit Register 0; 0x0000F09C ***/
  union {
    word Word;
  } ADC_LOLIM0_STR;
  
  #define ADC_LOLIM0_LLMT0_MASK         0x08U
  #define ADC_LOLIM0_LLMT1_MASK         0x10U
  #define ADC_LOLIM0_LLMT2_MASK         0x20U
  #define ADC_LOLIM0_LLMT3_MASK         0x40U
  #define ADC_LOLIM0_LLMT4_MASK         0x80U
  #define ADC_LOLIM0_LLMT5_MASK         0x0100U
  #define ADC_LOLIM0_LLMT6_MASK         0x0200U
  #define ADC_LOLIM0_LLMT7_MASK         0x0400U
  #define ADC_LOLIM0_LLMT8_MASK         0x0800U
  #define ADC_LOLIM0_LLMT9_MASK         0x1000U
  #define ADC_LOLIM0_LLMT10_MASK        0x2000U
  #define ADC_LOLIM0_LLMT11_MASK        0x4000U
  #define ADC_LOLIM0_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM0_LLMT_BITNUM        0x03U
  #define ADC_LOLIM0                    *((volatile word *)0x0000F09C)


  /*** ADC_LOLIM1 - ADC Low Limit Register 1; 0x0000F09D ***/
  union {
    word Word;
  } ADC_LOLIM1_STR;
  
  #define ADC_LOLIM1_LLMT0_MASK         0x08U
  #define ADC_LOLIM1_LLMT1_MASK         0x10U
  #define ADC_LOLIM1_LLMT2_MASK         0x20U
  #define ADC_LOLIM1_LLMT3_MASK         0x40U
  #define ADC_LOLIM1_LLMT4_MASK         0x80U
  #define ADC_LOLIM1_LLMT5_MASK         0x0100U
  #define ADC_LOLIM1_LLMT6_MASK         0x0200U
  #define ADC_LOLIM1_LLMT7_MASK         0x0400U
  #define ADC_LOLIM1_LLMT8_MASK         0x0800U
  #define ADC_LOLIM1_LLMT9_MASK         0x1000U
  #define ADC_LOLIM1_LLMT10_MASK        0x2000U
  #define ADC_LOLIM1_LLMT11_MASK        0x4000U
  #define ADC_LOLIM1_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM1_LLMT_BITNUM        0x03U
  #define ADC_LOLIM1                    *((volatile word *)0x0000F09D)


  /*** ADC_LOLIM2 - ADC Low Limit Register 2; 0x0000F09E ***/
  union {
    word Word;
  } ADC_LOLIM2_STR;
  
