goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define ADC_LOLIM2_LLMT0_MASK         0x08U
  #define ADC_LOLIM2_LLMT1_MASK         0x10U
  #define ADC_LOLIM2_LLMT2_MASK         0x20U
  #define ADC_LOLIM2_LLMT3_MASK         0x40U
  #define ADC_LOLIM2_LLMT4_MASK         0x80U
  #define ADC_LOLIM2_LLMT5_MASK         0x0100U
  #define ADC_LOLIM2_LLMT6_MASK         0x0200U
  #define ADC_LOLIM2_LLMT7_MASK         0x0400U
  #define ADC_LOLIM2_LLMT8_MASK         0x0800U
  #define ADC_LOLIM2_LLMT9_MASK         0x1000U
  #define ADC_LOLIM2_LLMT10_MASK        0x2000U
  #define ADC_LOLIM2_LLMT11_MASK        0x4000U
  #define ADC_LOLIM2_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM2_LLMT_BITNUM        0x03U
  #define ADC_LOLIM2                    *((volatile word *)0x0000F09E)


  /*** ADC_LOLIM3 - ADC Low Limit Register 3; 0x0000F09F ***/
  union {
    word Word;
  } ADC_LOLIM3_STR;
  
  #define ADC_LOLIM3_LLMT0_MASK         0x08U
  #define ADC_LOLIM3_LLMT1_MASK         0x10U
  #define ADC_LOLIM3_LLMT2_MASK         0x20U
  #define ADC_LOLIM3_LLMT3_MASK         0x40U
  #define ADC_LOLIM3_LLMT4_MASK         0x80U
  #define ADC_LOLIM3_LLMT5_MASK         0x0100U
  #define ADC_LOLIM3_LLMT6_MASK         0x0200U
  #define ADC_LOLIM3_LLMT7_MASK         0x0400U
  #define ADC_LOLIM3_LLMT8_MASK         0x0800U
  #define ADC_LOLIM3_LLMT9_MASK         0x1000U
  #define ADC_LOLIM3_LLMT10_MASK        0x2000U
  #define ADC_LOLIM3_LLMT11_MASK        0x4000U
  #define ADC_LOLIM3_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM3_LLMT_BITNUM        0x03U
  #define ADC_LOLIM3                    *((volatile word *)0x0000F09F)


  /*** ADC_LOLIM4 - ADC Low Limit Register 4; 0x0000F0A0 ***/
  union {
    word Word;
  } ADC_LOLIM4_STR;
  
  #define ADC_LOLIM4_LLMT0_MASK         0x08U
  #define ADC_LOLIM4_LLMT1_MASK         0x10U
  #define ADC_LOLIM4_LLMT2_MASK         0x20U
  #define ADC_LOLIM4_LLMT3_MASK         0x40U
  #define ADC_LOLIM4_LLMT4_MASK         0x80U
  #define ADC_LOLIM4_LLMT5_MASK         0x0100U
  #define ADC_LOLIM4_LLMT6_MASK         0x0200U
  #define ADC_LOLIM4_LLMT7_MASK         0x0400U
  #define ADC_LOLIM4_LLMT8_MASK         0x0800U
  #define ADC_LOLIM4_LLMT9_MASK         0x1000U
  #define ADC_LOLIM4_LLMT10_MASK        0x2000U
  #define ADC_LOLIM4_LLMT11_MASK        0x4000U
  #define ADC_LOLIM4_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM4_LLMT_BITNUM        0x03U
  #define ADC_LOLIM4                    *((volatile word *)0x0000F0A0)


  /*** ADC_LOLIM5 - ADC Low Limit Register 5; 0x0000F0A1 ***/
  union {
    word Word;
  } ADC_LOLIM5_STR;
  
  #define ADC_LOLIM5_LLMT0_MASK         0x08U
  #define ADC_LOLIM5_LLMT1_MASK         0x10U
  #define ADC_LOLIM5_LLMT2_MASK         0x20U
  #define ADC_LOLIM5_LLMT3_MASK         0x40U
  #define ADC_LOLIM5_LLMT4_MASK         0x80U
  #define ADC_LOLIM5_LLMT5_MASK         0x0100U
  #define ADC_LOLIM5_LLMT6_MASK         0x0200U
  #define ADC_LOLIM5_LLMT7_MASK         0x0400U
  #define ADC_LOLIM5_LLMT8_MASK         0x0800U
  #define ADC_LOLIM5_LLMT9_MASK         0x1000U
  #define ADC_LOLIM5_LLMT10_MASK        0x2000U
  #define ADC_LOLIM5_LLMT11_MASK        0x4000U
  #define ADC_LOLIM5_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM5_LLMT_BITNUM        0x03U
  #define ADC_LOLIM5                    *((volatile word *)0x0000F0A1)


  /*** ADC_LOLIM6 - ADC Low Limit Register 6; 0x0000F0A2 ***/
  union {
    word Word;
  } ADC_LOLIM6_STR;
  
  #define ADC_LOLIM6_LLMT0_MASK         0x08U
  #define ADC_LOLIM6_LLMT1_MASK         0x10U
  #define ADC_LOLIM6_LLMT2_MASK         0x20U
  #define ADC_LOLIM6_LLMT3_MASK         0x40U
  #define ADC_LOLIM6_LLMT4_MASK         0x80U
  #define ADC_LOLIM6_LLMT5_MASK         0x0100U
  #define ADC_LOLIM6_LLMT6_MASK         0x0200U
  #define ADC_LOLIM6_LLMT7_MASK         0x0400U
  #define ADC_LOLIM6_LLMT8_MASK         0x0800U
  #define ADC_LOLIM6_LLMT9_MASK         0x1000U
  #define ADC_LOLIM6_LLMT10_MASK        0x2000U
  #define ADC_LOLIM6_LLMT11_MASK        0x4000U
  #define ADC_LOLIM6_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM6_LLMT_BITNUM        0x03U
  #define ADC_LOLIM6                    *((volatile word *)0x0000F0A2)


  /*** ADC_LOLIM7 - ADC Low Limit Register 7; 0x0000F0A3 ***/
  union {
    word Word;
  } ADC_LOLIM7_STR;
  
  #define ADC_LOLIM7_LLMT0_MASK         0x08U
  #define ADC_LOLIM7_LLMT1_MASK         0x10U
  #define ADC_LOLIM7_LLMT2_MASK         0x20U
  #define ADC_LOLIM7_LLMT3_MASK         0x40U
  #define ADC_LOLIM7_LLMT4_MASK         0x80U
  #define ADC_LOLIM7_LLMT5_MASK         0x0100U
  #define ADC_LOLIM7_LLMT6_MASK         0x0200U
  #define ADC_LOLIM7_LLMT7_MASK         0x0400U
  #define ADC_LOLIM7_LLMT8_MASK         0x0800U
  #define ADC_LOLIM7_LLMT9_MASK         0x1000U
  #define ADC_LOLIM7_LLMT10_MASK        0x2000U
  #define ADC_LOLIM7_LLMT11_MASK        0x4000U
  #define ADC_LOLIM7_LLMT_MASK          0x7FF8U
  #define ADC_LOLIM7_LLMT_BITNUM        0x03U
  #define ADC_LOLIM7                    *((volatile word *)0x0000F0A3)


  /*** ADC_HILIM0 - ADC High Limit Register 0; 0x0000F0A4 ***/
  union {
    word Word;
  } ADC_HILIM0_STR;
  
  #define ADC_HILIM0_HLMT0_MASK         0x08U
  #define ADC_HILIM0_HLMT1_MASK         0x10U
  #define ADC_HILIM0_HLMT2_MASK         0x20U
  #define ADC_HILIM0_HLMT3_MASK         0x40U
  #define ADC_HILIM0_HLMT4_MASK         0x80U
  #define ADC_HILIM0_HLMT5_MASK         0x0100U
  #define ADC_HILIM0_HLMT6_MASK         0x0200U
  #define ADC_HILIM0_HLMT7_MASK         0x0400U
  #define ADC_HILIM0_HLMT8_MASK         0x0800U
  #define ADC_HILIM0_HLMT9_MASK         0x1000U
  #define ADC_HILIM0_HLMT10_MASK        0x2000U
  #define ADC_HILIM0_HLMT11_MASK        0x4000U
  #define ADC_HILIM0_HLMT_MASK          0x7FF8U
  #define ADC_HILIM0_HLMT_BITNUM        0x03U
  #define ADC_HILIM0                    *((volatile word *)0x0000F0A4)


  /*** ADC_HILIM1 - ADC High Limit Register 1; 0x0000F0A5 ***/
  union {
    word Word;
  } ADC_HILIM1_STR;
  
  #define ADC_HILIM1_HLMT0_MASK         0x08U
  #define ADC_HILIM1_HLMT1_MASK         0x10U
  #define ADC_HILIM1_HLMT2_MASK         0x20U
  #define ADC_HILIM1_HLMT3_MASK         0x40U
  #define ADC_HILIM1_HLMT4_MASK         0x80U
  #define ADC_HILIM1_HLMT5_MASK         0x0100U
  #define ADC_HILIM1_HLMT6_MASK         0x0200U
  #define ADC_HILIM1_HLMT7_MASK         0x0400U
  #define ADC_HILIM1_HLMT8_MASK         0x0800U
  #define ADC_HILIM1_HLMT9_MASK         0x1000U
  #define ADC_HILIM1_HLMT10_MASK        0x2000U
  #define ADC_HILIM1_HLMT11_MASK        0x4000U
  #define ADC_HILIM1_HLMT_MASK          0x7FF8U
  #define ADC_HILIM1_HLMT_BITNUM        0x03U
  #define ADC_HILIM1                    *((volatile word *)0x0000F0A5)


  /*** ADC_HILIM2 - ADC High Limit Register 2; 0x0000F0A6 ***/
  union {
    word Word;
  } ADC_HILIM2_STR;
  
  #define ADC_HILIM2_HLMT0_MASK         0x08U
  #define ADC_HILIM2_HLMT1_MASK         0x10U
  #define ADC_HILIM2_HLMT2_MASK         0x20U
  #define ADC_HILIM2_HLMT3_MASK         0x40U
  #define ADC_HILIM2_HLMT4_MASK         0x80U
  #define ADC_HILIM2_HLMT5_MASK         0x0100U
  #define ADC_HILIM2_HLMT6_MASK         0x0200U
  #define ADC_HILIM2_HLMT7_MASK         0x0400U
  #define ADC_HILIM2_HLMT8_MASK         0x0800U
  #define ADC_HILIM2_HLMT9_MASK         0x1000U
  #define ADC_HILIM2_HLMT10_MASK        0x2000U
  #define ADC_HILIM2_HLMT11_MASK        0x4000U
  #define ADC_HILIM2_HLMT_MASK          0x7FF8U
  #define ADC_HILIM2_HLMT_BITNUM        0x03U
  #define ADC_HILIM2                    *((volatile word *)0x0000F0A6)


  /*** ADC_HILIM3 - ADC High Limit Register 3; 0x0000F0A7 ***/
  union {
    word Word;
  } ADC_HILIM3_STR;
  
