goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define ADC_HILIM3_HLMT0_MASK         0x08U
  #define ADC_HILIM3_HLMT1_MASK         0x10U
  #define ADC_HILIM3_HLMT2_MASK         0x20U
  #define ADC_HILIM3_HLMT3_MASK         0x40U
  #define ADC_HILIM3_HLMT4_MASK         0x80U
  #define ADC_HILIM3_HLMT5_MASK         0x0100U
  #define ADC_HILIM3_HLMT6_MASK         0x0200U
  #define ADC_HILIM3_HLMT7_MASK         0x0400U
  #define ADC_HILIM3_HLMT8_MASK         0x0800U
  #define ADC_HILIM3_HLMT9_MASK         0x1000U
  #define ADC_HILIM3_HLMT10_MASK        0x2000U
  #define ADC_HILIM3_HLMT11_MASK        0x4000U
  #define ADC_HILIM3_HLMT_MASK          0x7FF8U
  #define ADC_HILIM3_HLMT_BITNUM        0x03U
  #define ADC_HILIM3                    *((volatile word *)0x0000F0A7)


  /*** ADC_HILIM4 - ADC High Limit Register 4; 0x0000F0A8 ***/
  union {
    word Word;
  } ADC_HILIM4_STR;
  
  #define ADC_HILIM4_HLMT0_MASK         0x08U
  #define ADC_HILIM4_HLMT1_MASK         0x10U
  #define ADC_HILIM4_HLMT2_MASK         0x20U
  #define ADC_HILIM4_HLMT3_MASK         0x40U
  #define ADC_HILIM4_HLMT4_MASK         0x80U
  #define ADC_HILIM4_HLMT5_MASK         0x0100U
  #define ADC_HILIM4_HLMT6_MASK         0x0200U
  #define ADC_HILIM4_HLMT7_MASK         0x0400U
  #define ADC_HILIM4_HLMT8_MASK         0x0800U
  #define ADC_HILIM4_HLMT9_MASK         0x1000U
  #define ADC_HILIM4_HLMT10_MASK        0x2000U
  #define ADC_HILIM4_HLMT11_MASK        0x4000U
  #define ADC_HILIM4_HLMT_MASK          0x7FF8U
  #define ADC_HILIM4_HLMT_BITNUM        0x03U
  #define ADC_HILIM4                    *((volatile word *)0x0000F0A8)


  /*** ADC_HILIM5 - ADC High Limit Register 5; 0x0000F0A9 ***/
  union {
    word Word;
  } ADC_HILIM5_STR;
  
  #define ADC_HILIM5_HLMT0_MASK         0x08U
  #define ADC_HILIM5_HLMT1_MASK         0x10U
  #define ADC_HILIM5_HLMT2_MASK         0x20U
  #define ADC_HILIM5_HLMT3_MASK         0x40U
  #define ADC_HILIM5_HLMT4_MASK         0x80U
  #define ADC_HILIM5_HLMT5_MASK         0x0100U
  #define ADC_HILIM5_HLMT6_MASK         0x0200U
  #define ADC_HILIM5_HLMT7_MASK         0x0400U
  #define ADC_HILIM5_HLMT8_MASK         0x0800U
  #define ADC_HILIM5_HLMT9_MASK         0x1000U
  #define ADC_HILIM5_HLMT10_MASK        0x2000U
  #define ADC_HILIM5_HLMT11_MASK        0x4000U
  #define ADC_HILIM5_HLMT_MASK          0x7FF8U
  #define ADC_HILIM5_HLMT_BITNUM        0x03U
  #define ADC_HILIM5                    *((volatile word *)0x0000F0A9)


  /*** ADC_HILIM6 - ADC High Limit Register 6; 0x0000F0AA ***/
  union {
    word Word;
  } ADC_HILIM6_STR;
  
  #define ADC_HILIM6_HLMT0_MASK         0x08U
  #define ADC_HILIM6_HLMT1_MASK         0x10U
  #define ADC_HILIM6_HLMT2_MASK         0x20U
  #define ADC_HILIM6_HLMT3_MASK         0x40U
  #define ADC_HILIM6_HLMT4_MASK         0x80U
  #define ADC_HILIM6_HLMT5_MASK         0x0100U
  #define ADC_HILIM6_HLMT6_MASK         0x0200U
  #define ADC_HILIM6_HLMT7_MASK         0x0400U
  #define ADC_HILIM6_HLMT8_MASK         0x0800U
  #define ADC_HILIM6_HLMT9_MASK         0x1000U
  #define ADC_HILIM6_HLMT10_MASK        0x2000U
  #define ADC_HILIM6_HLMT11_MASK        0x4000U
  #define ADC_HILIM6_HLMT_MASK          0x7FF8U
  #define ADC_HILIM6_HLMT_BITNUM        0x03U
  #define ADC_HILIM6                    *((volatile word *)0x0000F0AA)


  /*** ADC_HILIM7 - ADC High Limit Register 7; 0x0000F0AB ***/
  union {
    word Word;
  } ADC_HILIM7_STR;
  
  #define ADC_HILIM7_HLMT0_MASK         0x08U
  #define ADC_HILIM7_HLMT1_MASK         0x10U
  #define ADC_HILIM7_HLMT2_MASK         0x20U
  #define ADC_HILIM7_HLMT3_MASK         0x40U
  #define ADC_HILIM7_HLMT4_MASK         0x80U
  #define ADC_HILIM7_HLMT5_MASK         0x0100U
  #define ADC_HILIM7_HLMT6_MASK         0x0200U
  #define ADC_HILIM7_HLMT7_MASK         0x0400U
  #define ADC_HILIM7_HLMT8_MASK         0x0800U
  #define ADC_HILIM7_HLMT9_MASK         0x1000U
  #define ADC_HILIM7_HLMT10_MASK        0x2000U
  #define ADC_HILIM7_HLMT11_MASK        0x4000U
  #define ADC_HILIM7_HLMT_MASK          0x7FF8U
  #define ADC_HILIM7_HLMT_BITNUM        0x03U
  #define ADC_HILIM7                    *((volatile word *)0x0000F0AB)


  /*** ADC_OFFST0 - ADC Offset Register 0; 0x0000F0AC ***/
  union {
    word Word;
  } ADC_OFFST0_STR;
  
  #define ADC_OFFST0_OFFSET0_MASK       0x08U
  #define ADC_OFFST0_OFFSET1_MASK       0x10U
  #define ADC_OFFST0_OFFSET2_MASK       0x20U
  #define ADC_OFFST0_OFFSET3_MASK       0x40U
  #define ADC_OFFST0_OFFSET4_MASK       0x80U
  #define ADC_OFFST0_OFFSET5_MASK       0x0100U
  #define ADC_OFFST0_OFFSET6_MASK       0x0200U
  #define ADC_OFFST0_OFFSET7_MASK       0x0400U
  #define ADC_OFFST0_OFFSET8_MASK       0x0800U
  #define ADC_OFFST0_OFFSET9_MASK       0x1000U
  #define ADC_OFFST0_OFFSET10_MASK      0x2000U
  #define ADC_OFFST0_OFFSET11_MASK      0x4000U
  #define ADC_OFFST0_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST0_OFFSET_BITNUM      0x03U
  #define ADC_OFFST0                    *((volatile word *)0x0000F0AC)


  /*** ADC_OFFST1 - ADC Offset Register 1; 0x0000F0AD ***/
  union {
    word Word;
  } ADC_OFFST1_STR;
  
  #define ADC_OFFST1_OFFSET0_MASK       0x08U
  #define ADC_OFFST1_OFFSET1_MASK       0x10U
  #define ADC_OFFST1_OFFSET2_MASK       0x20U
  #define ADC_OFFST1_OFFSET3_MASK       0x40U
  #define ADC_OFFST1_OFFSET4_MASK       0x80U
  #define ADC_OFFST1_OFFSET5_MASK       0x0100U
  #define ADC_OFFST1_OFFSET6_MASK       0x0200U
  #define ADC_OFFST1_OFFSET7_MASK       0x0400U
  #define ADC_OFFST1_OFFSET8_MASK       0x0800U
  #define ADC_OFFST1_OFFSET9_MASK       0x1000U
  #define ADC_OFFST1_OFFSET10_MASK      0x2000U
  #define ADC_OFFST1_OFFSET11_MASK      0x4000U
  #define ADC_OFFST1_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST1_OFFSET_BITNUM      0x03U
  #define ADC_OFFST1                    *((volatile word *)0x0000F0AD)


  /*** ADC_OFFST2 - ADC Offset Register 2; 0x0000F0AE ***/
  union {
    word Word;
  } ADC_OFFST2_STR;
  
