goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define ADC_OFFST2_OFFSET0_MASK       0x08U
  #define ADC_OFFST2_OFFSET1_MASK       0x10U
  #define ADC_OFFST2_OFFSET2_MASK       0x20U
  #define ADC_OFFST2_OFFSET3_MASK       0x40U
  #define ADC_OFFST2_OFFSET4_MASK       0x80U
  #define ADC_OFFST2_OFFSET5_MASK       0x0100U
  #define ADC_OFFST2_OFFSET6_MASK       0x0200U
  #define ADC_OFFST2_OFFSET7_MASK       0x0400U
  #define ADC_OFFST2_OFFSET8_MASK       0x0800U
  #define ADC_OFFST2_OFFSET9_MASK       0x1000U
  #define ADC_OFFST2_OFFSET10_MASK      0x2000U
  #define ADC_OFFST2_OFFSET11_MASK      0x4000U
  #define ADC_OFFST2_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST2_OFFSET_BITNUM      0x03U
  #define ADC_OFFST2                    *((volatile word *)0x0000F0AE)


  /*** ADC_OFFST3 - ADC Offset Register 3; 0x0000F0AF ***/
  union {
    word Word;
  } ADC_OFFST3_STR;
  
  #define ADC_OFFST3_OFFSET0_MASK       0x08U
  #define ADC_OFFST3_OFFSET1_MASK       0x10U
  #define ADC_OFFST3_OFFSET2_MASK       0x20U
  #define ADC_OFFST3_OFFSET3_MASK       0x40U
  #define ADC_OFFST3_OFFSET4_MASK       0x80U
  #define ADC_OFFST3_OFFSET5_MASK       0x0100U
  #define ADC_OFFST3_OFFSET6_MASK       0x0200U
  #define ADC_OFFST3_OFFSET7_MASK       0x0400U
  #define ADC_OFFST3_OFFSET8_MASK       0x0800U
  #define ADC_OFFST3_OFFSET9_MASK       0x1000U
  #define ADC_OFFST3_OFFSET10_MASK      0x2000U
  #define ADC_OFFST3_OFFSET11_MASK      0x4000U
  #define ADC_OFFST3_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST3_OFFSET_BITNUM      0x03U
  #define ADC_OFFST3                    *((volatile word *)0x0000F0AF)


  /*** ADC_OFFST4 - ADC Offset Register 4; 0x0000F0B0 ***/
  union {
    word Word;
  } ADC_OFFST4_STR;
  
  #define ADC_OFFST4_OFFSET0_MASK       0x08U
  #define ADC_OFFST4_OFFSET1_MASK       0x10U
  #define ADC_OFFST4_OFFSET2_MASK       0x20U
  #define ADC_OFFST4_OFFSET3_MASK       0x40U
  #define ADC_OFFST4_OFFSET4_MASK       0x80U
  #define ADC_OFFST4_OFFSET5_MASK       0x0100U
  #define ADC_OFFST4_OFFSET6_MASK       0x0200U
  #define ADC_OFFST4_OFFSET7_MASK       0x0400U
  #define ADC_OFFST4_OFFSET8_MASK       0x0800U
  #define ADC_OFFST4_OFFSET9_MASK       0x1000U
  #define ADC_OFFST4_OFFSET10_MASK      0x2000U
  #define ADC_OFFST4_OFFSET11_MASK      0x4000U
  #define ADC_OFFST4_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST4_OFFSET_BITNUM      0x03U
  #define ADC_OFFST4                    *((volatile word *)0x0000F0B0)


  /*** ADC_OFFST5 - ADC Offset Register 5; 0x0000F0B1 ***/
  union {
    word Word;
  } ADC_OFFST5_STR;
  
  #define ADC_OFFST5_OFFSET0_MASK       0x08U
  #define ADC_OFFST5_OFFSET1_MASK       0x10U
  #define ADC_OFFST5_OFFSET2_MASK       0x20U
  #define ADC_OFFST5_OFFSET3_MASK       0x40U
  #define ADC_OFFST5_OFFSET4_MASK       0x80U
  #define ADC_OFFST5_OFFSET5_MASK       0x0100U
  #define ADC_OFFST5_OFFSET6_MASK       0x0200U
  #define ADC_OFFST5_OFFSET7_MASK       0x0400U
  #define ADC_OFFST5_OFFSET8_MASK       0x0800U
  #define ADC_OFFST5_OFFSET9_MASK       0x1000U
  #define ADC_OFFST5_OFFSET10_MASK      0x2000U
  #define ADC_OFFST5_OFFSET11_MASK      0x4000U
  #define ADC_OFFST5_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST5_OFFSET_BITNUM      0x03U
  #define ADC_OFFST5                    *((volatile word *)0x0000F0B1)


  /*** ADC_OFFST6 - ADC Offset Register 6; 0x0000F0B2 ***/
  union {
    word Word;
  } ADC_OFFST6_STR;
  
  #define ADC_OFFST6_OFFSET0_MASK       0x08U
  #define ADC_OFFST6_OFFSET1_MASK       0x10U
  #define ADC_OFFST6_OFFSET2_MASK       0x20U
  #define ADC_OFFST6_OFFSET3_MASK       0x40U
  #define ADC_OFFST6_OFFSET4_MASK       0x80U
  #define ADC_OFFST6_OFFSET5_MASK       0x0100U
  #define ADC_OFFST6_OFFSET6_MASK       0x0200U
  #define ADC_OFFST6_OFFSET7_MASK       0x0400U
  #define ADC_OFFST6_OFFSET8_MASK       0x0800U
  #define ADC_OFFST6_OFFSET9_MASK       0x1000U
  #define ADC_OFFST6_OFFSET10_MASK      0x2000U
  #define ADC_OFFST6_OFFSET11_MASK      0x4000U
  #define ADC_OFFST6_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST6_OFFSET_BITNUM      0x03U
  #define ADC_OFFST6                    *((volatile word *)0x0000F0B2)


  /*** ADC_OFFST7 - ADC Offset Register 7; 0x0000F0B3 ***/
  union {
    word Word;
  } ADC_OFFST7_STR;
  
  #define ADC_OFFST7_OFFSET0_MASK       0x08U
  #define ADC_OFFST7_OFFSET1_MASK       0x10U
  #define ADC_OFFST7_OFFSET2_MASK       0x20U
  #define ADC_OFFST7_OFFSET3_MASK       0x40U
  #define ADC_OFFST7_OFFSET4_MASK       0x80U
  #define ADC_OFFST7_OFFSET5_MASK       0x0100U
  #define ADC_OFFST7_OFFSET6_MASK       0x0200U
  #define ADC_OFFST7_OFFSET7_MASK       0x0400U
  #define ADC_OFFST7_OFFSET8_MASK       0x0800U
  #define ADC_OFFST7_OFFSET9_MASK       0x1000U
  #define ADC_OFFST7_OFFSET10_MASK      0x2000U
  #define ADC_OFFST7_OFFSET11_MASK      0x4000U
  #define ADC_OFFST7_OFFSET_MASK        0x7FF8U
  #define ADC_OFFST7_OFFSET_BITNUM      0x03U
  #define ADC_OFFST7                    *((volatile word *)0x0000F0B3)


  /*** ADC_PWR - ADC Power Control Register; 0x0000F0B4 ***/
  union {
    word Word;
  } ADC_PWR_STR;
  
  #define ADC_PWR_PD0_MASK              0x01U
  #define ADC_PWR_PD1_MASK              0x02U
  #define ADC_PWR_PD2_MASK              0x04U
  #define ADC_PWR_APD_MASK              0x08U
  #define ADC_PWR_PUDELAY0_MASK         0x10U
  #define ADC_PWR_PUDELAY1_MASK         0x20U
  #define ADC_PWR_PUDELAY2_MASK         0x40U
  #define ADC_PWR_PUDELAY3_MASK         0x80U
  #define ADC_PWR_PUDELAY4_MASK         0x0100U
  #define ADC_PWR_PUDELAY5_MASK         0x0200U
  #define ADC_PWR_PSTS0_MASK            0x0400U
  #define ADC_PWR_PSTS1_MASK            0x0800U
  #define ADC_PWR_PSTS2_MASK            0x1000U
  #define ADC_PWR_ASB_MASK              0x8000U
  #define ADC_PWR_PD_MASK               0x07U
  #define ADC_PWR_PD_BITNUM             0x00U
  #define ADC_PWR_PUDELAY_MASK          0x03F0U
  #define ADC_PWR_PUDELAY_BITNUM        0x04U
  #define ADC_PWR_PSTS_MASK             0x1C00U
  #define ADC_PWR_PSTS_BITNUM           0x0AU
  #define ADC_PWR                       *((volatile word *)0x0000F0B4)


  /*** ADC_CAL - ADC Calibration Register; 0x0000F0B5 ***/
  union {
    word Word;
  } ADC_CAL_STR;
  
  #define ADC_CAL_SEL_DAC0_MASK         0x01U
  #define ADC_CAL_SEL_DAC1_MASK         0x02U
  #define ADC_CAL_SEL_VREFLO_0_MASK     0x1000U
  #define ADC_CAL_SEL_VREFH_0_MASK      0x2000U
  #define ADC_CAL_SEL_VREFLO_1_MASK     0x4000U
  #define ADC_CAL_SEL_VREFH_1_MASK      0x8000U
  #define ADC_CAL_SEL_DAC_MASK          0x03U
  #define ADC_CAL_SEL_DAC_BITNUM        0x00U
  #define ADC_CAL                       *((volatile word *)0x0000F0B5)


