goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  word Reserved0[10];                  /* Reserved (unused) registers */

} ADC_PRPH;

/******************************************
*** Peripheral PWM
*******************************************/
typedef volatile struct {
  /*** PWM_CTRL - PWM control register; 0x0000F0C0 ***/
  union {
    word Word;
  } PWM_CTRL_STR;
  
  #define PWM_CTRL_PWMEN_MASK           0x01U
  #define PWM_CTRL_LDOK_MASK            0x02U
  #define PWM_CTRL_PWMF_MASK            0x10U
  #define PWM_CTRL_PWMRIE_MASK          0x20U
  #define PWM_CTRL_PRSC0_MASK           0x40U
  #define PWM_CTRL_PRSC1_MASK           0x80U
  #define PWM_CTRL_IPOL0_MASK           0x0100U
  #define PWM_CTRL_IPOL1_MASK           0x0200U
  #define PWM_CTRL_IPOL2_MASK           0x0400U
  #define PWM_CTRL_HALF_MASK            0x0800U
  #define PWM_CTRL_LDFQ0_MASK           0x1000U
  #define PWM_CTRL_LDFQ1_MASK           0x2000U
  #define PWM_CTRL_LDFQ2_MASK           0x4000U
  #define PWM_CTRL_LDFQ3_MASK           0x8000U
  #define PWM_CTRL_PRSC_MASK            0xC0U
  #define PWM_CTRL_PRSC_BITNUM          0x06U
  #define PWM_CTRL_IPOL_MASK            0x0700U
  #define PWM_CTRL_IPOL_BITNUM          0x08U
  #define PWM_CTRL_LDFQ_MASK            0xF000U
  #define PWM_CTRL_LDFQ_BITNUM          0x0CU
  #define PWM_CTRL                      *((volatile word *)0x0000F0C0)


  /*** PWM_FCTRL - PWM fault control register; 0x0000F0C1 ***/
  union {
    word Word;
  } PWM_FCTRL_STR;
  
  #define PWM_FCTRL_FMODE0_MASK         0x01U
  #define PWM_FCTRL_FIE0_MASK           0x02U
  #define PWM_FCTRL_FMODE1_MASK         0x04U
  #define PWM_FCTRL_FIE1_MASK           0x08U
  #define PWM_FCTRL_FMODE2_MASK         0x10U
  #define PWM_FCTRL_FIE2_MASK           0x20U
  #define PWM_FCTRL_FMODE3_MASK         0x40U
  #define PWM_FCTRL_FIE3_MASK           0x80U
  #define PWM_FCTRL_FPOL0_MASK          0x0100U
  #define PWM_FCTRL_FPOL1_MASK          0x0200U
  #define PWM_FCTRL_FPOL2_MASK          0x0400U
  #define PWM_FCTRL_FPOL3_MASK          0x0800U
  #define PWM_FCTRL_FPOL_MASK           0x0F00U
  #define PWM_FCTRL_FPOL_BITNUM         0x08U
  #define PWM_FCTRL                     *((volatile word *)0x0000F0C1)


  /*** PWM_FLTACK - PWM fault status acknowledge register; 0x0000F0C2 ***/
  union {
    word Word;
  } PWM_FLTACK_STR;
  
  #define PWM_FLTACK_FTACK0_MASK        0x01U
  #define PWM_FLTACK_FTACK1_MASK        0x04U
  #define PWM_FLTACK_FTACK2_MASK        0x10U
  #define PWM_FLTACK_FTACK3_MASK        0x40U
  #define PWM_FLTACK_FFLAG0_MASK        0x0100U
  #define PWM_FLTACK_FPIN0_MASK         0x0200U
  #define PWM_FLTACK_FFLAG1_MASK        0x0400U
  #define PWM_FLTACK_FPIN1_MASK         0x0800U
  #define PWM_FLTACK_FFLAG2_MASK        0x1000U
  #define PWM_FLTACK_FPIN2_MASK         0x2000U
  #define PWM_FLTACK_FFLAG3_MASK        0x4000U
  #define PWM_FLTACK_FPIN3_MASK         0x8000U
  #define PWM_FLTACK                    *((volatile word *)0x0000F0C2)


  /*** PWM_OUT - PWM output control register; 0x0000F0C3 ***/
  union {
    word Word;
  } PWM_OUT_STR;
  
  #define PWM_OUT_OUT0_MASK             0x01U
  #define PWM_OUT_OUT1_MASK             0x02U
  #define PWM_OUT_OUT2_MASK             0x04U
  #define PWM_OUT_OUT3_MASK             0x08U
  #define PWM_OUT_OUT4_MASK             0x10U
  #define PWM_OUT_OUT5_MASK             0x20U
  #define PWM_OUT_OUTCTL0_MASK          0x0100U
  #define PWM_OUT_OUTCTL1_MASK          0x0200U
  #define PWM_OUT_OUTCTL2_MASK          0x0400U
  #define PWM_OUT_OUTCTL3_MASK          0x0800U
  #define PWM_OUT_OUTCTL4_MASK          0x1000U
  #define PWM_OUT_OUTCTL5_MASK          0x2000U
  #define PWM_OUT_PAD_EN_MASK           0x8000U
  #define PWM_OUT_OUT_MASK              0x3FU
  #define PWM_OUT_OUT_BITNUM            0x00U
  #define PWM_OUT_OUTCTL_MASK           0x3F00U
  #define PWM_OUT_OUTCTL_BITNUM         0x08U
  #define PWM_OUT                       *((volatile word *)0x0000F0C3)


  /*** PWM_CNTR - PWM counter register; 0x0000F0C4 ***/
  union {
    word Word;
  } PWM_CNTR_STR;
  
  #define PWM_CNTR_CNT0_MASK            0x01U
  #define PWM_CNTR_CNT1_MASK            0x02U
  #define PWM_CNTR_CNT2_MASK            0x04U
  #define PWM_CNTR_CNT3_MASK            0x08U
  #define PWM_CNTR_CNT4_MASK            0x10U
  #define PWM_CNTR_CNT5_MASK            0x20U
  #define PWM_CNTR_CNT6_MASK            0x40U
  #define PWM_CNTR_CNT7_MASK            0x80U
  #define PWM_CNTR_CNT8_MASK            0x0100U
  #define PWM_CNTR_CNT9_MASK            0x0200U
  #define PWM_CNTR_CNT10_MASK           0x0400U
  #define PWM_CNTR_CNT11_MASK           0x0800U
  #define PWM_CNTR_CNT12_MASK           0x1000U
  #define PWM_CNTR_CNT13_MASK           0x2000U
  #define PWM_CNTR_CNT14_MASK           0x4000U
  #define PWM_CNTR_CNT_MASK             0x7FFFU
  #define PWM_CNTR_CNT_BITNUM           0x00U
  #define PWM_CNTR                      *((volatile word *)0x0000F0C4)


  /*** PWM_CMOD - PWM counter modulo register; 0x0000F0C5 ***/
  union {
    word Word;
  } PWM_CMOD_STR;
  
  #define PWM_CMOD_CM0_MASK             0x01U
  #define PWM_CMOD_CM1_MASK             0x02U
  #define PWM_CMOD_CM2_MASK             0x04U
  #define PWM_CMOD_CM3_MASK             0x08U
  #define PWM_CMOD_CM4_MASK             0x10U
  #define PWM_CMOD_CM5_MASK             0x20U
  #define PWM_CMOD_CM6_MASK             0x40U
  #define PWM_CMOD_CM7_MASK             0x80U
  #define PWM_CMOD_CM8_MASK             0x0100U
  #define PWM_CMOD_CM9_MASK             0x0200U
  #define PWM_CMOD_CM10_MASK            0x0400U
  #define PWM_CMOD_CM11_MASK            0x0800U
  #define PWM_CMOD_CM12_MASK            0x1000U
  #define PWM_CMOD_CM13_MASK            0x2000U
  #define PWM_CMOD_CM14_MASK            0x4000U
  #define PWM_CMOD_CM_MASK              0x7FFFU
  #define PWM_CMOD_CM_BITNUM            0x00U
  #define PWM_CMOD                      *((volatile word *)0x0000F0C5)


