goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** PWM_VAL0 - PWM value register 0; 0x0000F0C6 ***/
  union {
    word Word;
  } PWM_VAL0_STR;
  
  #define PWM_VAL0                      *((volatile word *)0x0000F0C6)


  /*** PWM_VAL1 - PWM value register 1; 0x0000F0C7 ***/
  union {
    word Word;
  } PWM_VAL1_STR;
  
  #define PWM_VAL1                      *((volatile word *)0x0000F0C7)


  /*** PWM_VAL2 - PWM value register 2; 0x0000F0C8 ***/
  union {
    word Word;
  } PWM_VAL2_STR;
  
  #define PWM_VAL2                      *((volatile word *)0x0000F0C8)


  /*** PWM_VAL3 - PWM value register 3; 0x0000F0C9 ***/
  union {
    word Word;
  } PWM_VAL3_STR;
  
  #define PWM_VAL3                      *((volatile word *)0x0000F0C9)


  /*** PWM_VAL4 - PWM value register 4; 0x0000F0CA ***/
  union {
    word Word;
  } PWM_VAL4_STR;
  
  #define PWM_VAL4                      *((volatile word *)0x0000F0CA)


  /*** PWM_VAL5 - PWM value register 5; 0x0000F0CB ***/
  union {
    word Word;
  } PWM_VAL5_STR;
  
  #define PWM_VAL5                      *((volatile word *)0x0000F0CB)


  /*** PWM_DTIM0 - PWM deadtime register 0; 0x0000F0CC ***/
  union {
    word Word;
  } PWM_DTIM0_STR;
  
  #define PWM_DTIM0_PWMDT00_MASK        0x01U
  #define PWM_DTIM0_PWMDT01_MASK        0x02U
  #define PWM_DTIM0_PWMDT02_MASK        0x04U
  #define PWM_DTIM0_PWMDT03_MASK        0x08U
  #define PWM_DTIM0_PWMDT04_MASK        0x10U
  #define PWM_DTIM0_PWMDT05_MASK        0x20U
  #define PWM_DTIM0_PWMDT06_MASK        0x40U
  #define PWM_DTIM0_PWMDT07_MASK        0x80U
  #define PWM_DTIM0_PWMDT08_MASK        0x0100U
  #define PWM_DTIM0_PWMDT09_MASK        0x0200U
  #define PWM_DTIM0_PWMDT010_MASK       0x0400U
  #define PWM_DTIM0_PWMDT011_MASK       0x0800U
  #define PWM_DTIM0_PWMDT0_MASK         0x0FFFU
  #define PWM_DTIM0_PWMDT0_BITNUM       0x00U
  #define PWM_DTIM0                     *((volatile word *)0x0000F0CC)


  /*** PWM_DTIM1 - PWM deadtime register 1; 0x0000F0CD ***/
  union {
    word Word;
  } PWM_DTIM1_STR;
  
  #define PWM_DTIM1_PWMDT10_MASK        0x01U
  #define PWM_DTIM1_PWMDT11_MASK        0x02U
  #define PWM_DTIM1_PWMDT12_MASK        0x04U
  #define PWM_DTIM1_PWMDT13_MASK        0x08U
  #define PWM_DTIM1_PWMDT14_MASK        0x10U
  #define PWM_DTIM1_PWMDT15_MASK        0x20U
  #define PWM_DTIM1_PWMDT16_MASK        0x40U
  #define PWM_DTIM1_PWMDT17_MASK        0x80U
  #define PWM_DTIM1_PWMDT18_MASK        0x0100U
  #define PWM_DTIM1_PWMDT19_MASK        0x0200U
  #define PWM_DTIM1_PWMDT110_MASK       0x0400U
  #define PWM_DTIM1_PWMDT111_MASK       0x0800U
  #define PWM_DTIM1_PWMDT1_MASK         0x0FFFU
  #define PWM_DTIM1_PWMDT1_BITNUM       0x00U
  #define PWM_DTIM1                     *((volatile word *)0x0000F0CD)


  /*** PWM_DMAP1 - PWM disable mapping register one; 0x0000F0CE ***/
  union {
    word Word;
  } PWM_DMAP1_STR;
  
  #define PWM_DMAP1_DISMAP0_MASK        0x01U
  #define PWM_DMAP1_DISMAP1_MASK        0x02U
  #define PWM_DMAP1_DISMAP2_MASK        0x04U
  #define PWM_DMAP1_DISMAP3_MASK        0x08U
  #define PWM_DMAP1_DISMAP4_MASK        0x10U
  #define PWM_DMAP1_DISMAP5_MASK        0x20U
  #define PWM_DMAP1_DISMAP6_MASK        0x40U
  #define PWM_DMAP1_DISMAP7_MASK        0x80U
  #define PWM_DMAP1_DISMAP8_MASK        0x0100U
  #define PWM_DMAP1_DISMAP9_MASK        0x0200U
  #define PWM_DMAP1_DISMAP10_MASK       0x0400U
  #define PWM_DMAP1_DISMAP11_MASK       0x0800U
  #define PWM_DMAP1_DISMAP12_MASK       0x1000U
  #define PWM_DMAP1_DISMAP13_MASK       0x2000U
  #define PWM_DMAP1_DISMAP14_MASK       0x4000U
  #define PWM_DMAP1_DISMAP15_MASK       0x8000U
  #define PWM_DMAP1                     *((volatile word *)0x0000F0CE)


  /*** PWM_DMAP2 - PWM disable mapping register two; 0x0000F0CF ***/
  union {
    word Word;
  } PWM_DMAP2_STR;
  
  #define PWM_DMAP2_DISMAP0_MASK        0x01U
  #define PWM_DMAP2_DISMAP1_MASK        0x02U
  #define PWM_DMAP2_DISMAP2_MASK        0x04U
  #define PWM_DMAP2_DISMAP3_MASK        0x08U
  #define PWM_DMAP2_DISMAP4_MASK        0x10U
  #define PWM_DMAP2_DISMAP5_MASK        0x20U
  #define PWM_DMAP2_DISMAP6_MASK        0x40U
  #define PWM_DMAP2_DISMAP7_MASK        0x80U
  #define PWM_DMAP2_DISMAP_MASK         0xFFU
  #define PWM_DMAP2_DISMAP_BITNUM       0x00U
  #define PWM_DMAP2                     *((volatile word *)0x0000F0CF)


  /*** PWM_CNFG - PWM config register; 0x0000F0D0 ***/
  union {
    word Word;
  } PWM_CNFG_STR;
  
  #define PWM_CNFG_WP_MASK              0x01U
  #define PWM_CNFG_INDEP01_MASK         0x02U
  #define PWM_CNFG_INDEP23_MASK         0x04U
  #define PWM_CNFG_INDEP45_MASK         0x08U
  #define PWM_CNFG_BOTNEG01_MASK        0x10U
  #define PWM_CNFG_BOTNEG23_MASK        0x20U
  #define PWM_CNFG_BOTNEG45_MASK        0x40U
  #define PWM_CNFG_TOPNEG01_MASK        0x0100U
  #define PWM_CNFG_TOPNEG23_MASK        0x0200U
  #define PWM_CNFG_TOPNEG45_MASK        0x0400U
  #define PWM_CNFG_EDG_MASK             0x1000U
  #define PWM_CNFG_WAIT_EN_MASK         0x2000U
  #define PWM_CNFG_DBG_EN_MASK          0x4000U
  #define PWM_CNFG                      *((volatile word *)0x0000F0D0)


  /*** PWM_CCTRL - PWM channel control register; 0x0000F0D1 ***/
  union {
    word Word;
  } PWM_CCTRL_STR;
  
  #define PWM_CCTRL_SWP01_MASK          0x01U
  #define PWM_CCTRL_SWP23_MASK          0x02U
  #define PWM_CCTRL_SWP45_MASK          0x04U
  #define PWM_CCTRL_VLMODE0_MASK        0x10U
  #define PWM_CCTRL_VLMODE1_MASK        0x20U
  #define PWM_CCTRL_MSK0_MASK           0x0100U
  #define PWM_CCTRL_MSK1_MASK           0x0200U
  #define PWM_CCTRL_MSK2_MASK           0x0400U
  #define PWM_CCTRL_MSK3_MASK           0x0800U
  #define PWM_CCTRL_MSK4_MASK           0x1000U
  #define PWM_CCTRL_MSK5_MASK           0x2000U
  #define PWM_CCTRL_nBX_MASK            0x4000U
  #define PWM_CCTRL_ENHA_MASK           0x8000U
  #define PWM_CCTRL_VLMODE_MASK         0x30U
  #define PWM_CCTRL_VLMODE_BITNUM       0x04U
  #define PWM_CCTRL_MSK_MASK            0x3F00U
  #define PWM_CCTRL_MSK_BITNUM          0x08U
  #define PWM_CCTRL                     *((volatile word *)0x0000F0D1)


