goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** INTC_IPR1 - Interrupt Priority Register 1; 0x0000F0E1 ***/
  union {
    word Word;
  } INTC_IPR1_STR;
  
  #define INTC_IPR1_HFM_ERR_IPL0_MASK   0x01U
  #define INTC_IPR1_HFM_ERR_IPL1_MASK   0x02U
  #define INTC_IPR1_HFM_CC_IPL0_MASK    0x04U
  #define INTC_IPR1_HFM_CC_IPL1_MASK    0x08U
  #define INTC_IPR1_HFM_CBE_IPL0_MASK   0x10U
  #define INTC_IPR1_HFM_CBE_IPL1_MASK   0x20U
  #define INTC_IPR1_MSCAN_ERR_IPL0_MASK 0x40U
  #define INTC_IPR1_MSCAN_ERR_IPL1_MASK 0x80U
  #define INTC_IPR1_MSCAN_RX_IPL0_MASK  0x0100U
  #define INTC_IPR1_MSCAN_RX_IPL1_MASK  0x0200U
  #define INTC_IPR1_MSCAN_TX_IPL0_MASK  0x0400U
  #define INTC_IPR1_MSCAN_TX_IPL1_MASK  0x0800U
  #define INTC_IPR1_MSCAN_WKUP_IPL0_MASK 0x1000U
  #define INTC_IPR1_MSCAN_WKUP_IPL1_MASK 0x2000U
  #define INTC_IPR1_GPIO_D_IPL0_MASK    0x4000U
  #define INTC_IPR1_GPIO_D_IPL1_MASK    0x8000U
  #define INTC_IPR1_HFM_ERR_IPL_MASK    0x03U
  #define INTC_IPR1_HFM_ERR_IPL_BITNUM  0x00U
  #define INTC_IPR1_HFM_CC_IPL_MASK     0x0CU
  #define INTC_IPR1_HFM_CC_IPL_BITNUM   0x02U
  #define INTC_IPR1_HFM_CBE_IPL_MASK    0x30U
  #define INTC_IPR1_HFM_CBE_IPL_BITNUM  0x04U
  #define INTC_IPR1_MSCAN_ERR_IPL_MASK  0xC0U
  #define INTC_IPR1_MSCAN_ERR_IPL_BITNUM 0x06U
  #define INTC_IPR1_MSCAN_RX_IPL_MASK   0x0300U
  #define INTC_IPR1_MSCAN_RX_IPL_BITNUM 0x08U
  #define INTC_IPR1_MSCAN_TX_IPL_MASK   0x0C00U
  #define INTC_IPR1_MSCAN_TX_IPL_BITNUM 0x0AU
  #define INTC_IPR1_MSCAN_WKUP_IPL_MASK 0x3000U
  #define INTC_IPR1_MSCAN_WKUP_IPL_BITNUM 0x0CU
  #define INTC_IPR1_GPIO_D_IPL_MASK     0xC000U
  #define INTC_IPR1_GPIO_D_IPL_BITNUM   0x0EU
  #define INTC_IPR1                     *((volatile word *)0x0000F0E1)


  /*** INTC_IPR2 - Interrupt Priority Register 2; 0x0000F0E2 ***/
  union {
    word Word;
  } INTC_IPR2_STR;
  
  #define INTC_IPR2_GPIO_C_IPL0_MASK    0x01U
  #define INTC_IPR2_GPIO_C_IPL1_MASK    0x02U
  #define INTC_IPR2_GPIO_B_IPL0_MASK    0x04U
  #define INTC_IPR2_GPIO_B_IPL1_MASK    0x08U
  #define INTC_IPR2_GPIO_A_IPL0_MASK    0x10U
  #define INTC_IPR2_GPIO_A_IPL1_MASK    0x20U
  #define INTC_IPR2_SPI0_RCV_IPL0_MASK  0x40U
  #define INTC_IPR2_SPI0_RCV_IPL1_MASK  0x80U
  #define INTC_IPR2_SPI0_XMIT_IPL0_MASK 0x0100U
  #define INTC_IPR2_SPI0_XMIT_IPL1_MASK 0x0200U
  #define INTC_IPR2_SPI1_RCV_IPL0_MASK  0x0400U
  #define INTC_IPR2_SPI1_RCV_IPL1_MASK  0x0800U
  #define INTC_IPR2_SPI1_XMIT_IPL0_MASK 0x1000U
  #define INTC_IPR2_SPI1_XMIT_IPL1_MASK 0x2000U
  #define INTC_IPR2_SCI0_XMIT_IPL0_MASK 0x4000U
  #define INTC_IPR2_SCI0_XMIT_IPL1_MASK 0x8000U
  #define INTC_IPR2_GPIO_C_IPL_MASK     0x03U
  #define INTC_IPR2_GPIO_C_IPL_BITNUM   0x00U
  #define INTC_IPR2_GPIO_B_IPL_MASK     0x0CU
  #define INTC_IPR2_GPIO_B_IPL_BITNUM   0x02U
  #define INTC_IPR2_GPIO_A_IPL_MASK     0x30U
  #define INTC_IPR2_GPIO_A_IPL_BITNUM   0x04U
  #define INTC_IPR2_SPI0_RCV_IPL_MASK   0xC0U
  #define INTC_IPR2_SPI0_RCV_IPL_BITNUM 0x06U
  #define INTC_IPR2_SPI0_XMIT_IPL_MASK  0x0300U
  #define INTC_IPR2_SPI0_XMIT_IPL_BITNUM 0x08U
  #define INTC_IPR2_SPI1_RCV_IPL_MASK   0x0C00U
  #define INTC_IPR2_SPI1_RCV_IPL_BITNUM 0x0AU
  #define INTC_IPR2_SPI1_XMIT_IPL_MASK  0x3000U
  #define INTC_IPR2_SPI1_XMIT_IPL_BITNUM 0x0CU
  #define INTC_IPR2_SCI0_XMIT_IPL_MASK  0xC000U
  #define INTC_IPR2_SCI0_XMIT_IPL_BITNUM 0x0EU
  #define INTC_IPR2                     *((volatile word *)0x0000F0E2)


  /*** INTC_IPR3 - Interrupt Priority Register 3; 0x0000F0E3 ***/
  union {
    word Word;
  } INTC_IPR3_STR;
  
  #define INTC_IPR3_SCI0_TIDL_IPL0_MASK 0x01U
  #define INTC_IPR3_SCI0_TIDL_IPL1_MASK 0x02U
  #define INTC_IPR3_SCI0_RERR_IPL0_MASK 0x04U
  #define INTC_IPR3_SCI0_RERR_IPL1_MASK 0x08U
  #define INTC_IPR3_SCI0_RCV_IPL0_MASK  0x10U
  #define INTC_IPR3_SCI0_RCV_IPL1_MASK  0x20U
  #define INTC_IPR3_SCI1_XMIT_IPL0_MASK 0x40U
  #define INTC_IPR3_SCI1_XMIT_IPL1_MASK 0x80U
  #define INTC_IPR3_SCI1_TIDL_IPL0_MASK 0x0100U
  #define INTC_IPR3_SCI1_TIDL_IPL1_MASK 0x0200U
  #define INTC_IPR3_SCI1_RERR_IPL0_MASK 0x0400U
  #define INTC_IPR3_SCI1_RERR_IPL1_MASK 0x0800U
  #define INTC_IPR3_SCI1_RCV_IPL0_MASK  0x1000U
  #define INTC_IPR3_SCI1_RCV_IPL1_MASK  0x2000U
  #define INTC_IPR3_I2C_ERR_IPL0_MASK   0x4000U
  #define INTC_IPR3_I2C_ERR_IPL1_MASK   0x8000U
  #define INTC_IPR3_SCI0_TIDL_IPL_MASK  0x03U
  #define INTC_IPR3_SCI0_TIDL_IPL_BITNUM 0x00U
  #define INTC_IPR3_SCI0_RERR_IPL_MASK  0x0CU
  #define INTC_IPR3_SCI0_RERR_IPL_BITNUM 0x02U
  #define INTC_IPR3_SCI0_RCV_IPL_MASK   0x30U
  #define INTC_IPR3_SCI0_RCV_IPL_BITNUM 0x04U
  #define INTC_IPR3_SCI1_XMIT_IPL_MASK  0xC0U
  #define INTC_IPR3_SCI1_XMIT_IPL_BITNUM 0x06U
  #define INTC_IPR3_SCI1_TIDL_IPL_MASK  0x0300U
  #define INTC_IPR3_SCI1_TIDL_IPL_BITNUM 0x08U
  #define INTC_IPR3_SCI1_RERR_IPL_MASK  0x0C00U
  #define INTC_IPR3_SCI1_RERR_IPL_BITNUM 0x0AU
  #define INTC_IPR3_SCI1_RCV_IPL_MASK   0x3000U
  #define INTC_IPR3_SCI1_RCV_IPL_BITNUM 0x0CU
  #define INTC_IPR3_I2C_ERR_IPL_MASK    0xC000U
  #define INTC_IPR3_I2C_ERR_IPL_BITNUM  0x0EU
  #define INTC_IPR3                     *((volatile word *)0x0000F0E3)


  /*** INTC_IPR4 - Interrupt Priority Register 4; 0x0000F0E4 ***/
  union {
    word Word;
  } INTC_IPR4_STR;
  
  #define INTC_IPR4_I2C_GEN_IPL0_MASK   0x01U
  #define INTC_IPR4_I2C_GEN_IPL1_MASK   0x02U
  #define INTC_IPR4_I2C_RX_IPL0_MASK    0x04U
  #define INTC_IPR4_I2C_RX_IPL1_MASK    0x08U
  #define INTC_IPR4_I2C_TX_IPL0_MASK    0x10U
  #define INTC_IPR4_I2C_TX_IPL1_MASK    0x20U
  #define INTC_IPR4_I2C_STAT_IPL0_MASK  0x40U
  #define INTC_IPR4_I2C_STAT_IPL1_MASK  0x80U
  #define INTC_IPR4_TMRA_0_IPL0_MASK    0x0100U
  #define INTC_IPR4_TMRA_0_IPL1_MASK    0x0200U
  #define INTC_IPR4_TMRA_1_IPL0_MASK    0x0400U
  #define INTC_IPR4_TMRA_1_IPL1_MASK    0x0800U
  #define INTC_IPR4_TMRA_2_IPL0_MASK    0x1000U
  #define INTC_IPR4_TMRA_2_IPL1_MASK    0x2000U
  #define INTC_IPR4_TMRA_3_IPL0_MASK    0x4000U
  #define INTC_IPR4_TMRA_3_IPL1_MASK    0x8000U
  #define INTC_IPR4_I2C_GEN_IPL_MASK    0x03U
  #define INTC_IPR4_I2C_GEN_IPL_BITNUM  0x00U
  #define INTC_IPR4_I2C_RX_IPL_MASK     0x0CU
  #define INTC_IPR4_I2C_RX_IPL_BITNUM   0x02U
  #define INTC_IPR4_I2C_TX_IPL_MASK     0x30U
  #define INTC_IPR4_I2C_TX_IPL_BITNUM   0x04U
  #define INTC_IPR4_I2C_STAT_IPL_MASK   0xC0U
  #define INTC_IPR4_I2C_STAT_IPL_BITNUM 0x06U
  #define INTC_IPR4_TMRA_0_IPL_MASK     0x0300U
  #define INTC_IPR4_TMRA_0_IPL_BITNUM   0x08U
  #define INTC_IPR4_TMRA_1_IPL_MASK     0x0C00U
  #define INTC_IPR4_TMRA_1_IPL_BITNUM   0x0AU
  #define INTC_IPR4_TMRA_2_IPL_MASK     0x3000U
  #define INTC_IPR4_TMRA_2_IPL_BITNUM   0x0CU
  #define INTC_IPR4_TMRA_3_IPL_MASK     0xC000U
  #define INTC_IPR4_TMRA_3_IPL_BITNUM   0x0EU
  #define INTC_IPR4                     *((volatile word *)0x0000F0E4)


  /*** INTC_IPR5 - Interrupt Priority Register 5; 0x0000F0E5 ***/
  union {
    word Word;
  } INTC_IPR5_STR;
  
  #define INTC_IPR5_TMRB_0_IPL0_MASK    0x01U
  #define INTC_IPR5_TMRB_0_IPL1_MASK    0x02U
  #define INTC_IPR5_TMRB_1_IPL0_MASK    0x04U
  #define INTC_IPR5_TMRB_1_IPL1_MASK    0x08U
  #define INTC_IPR5_TMRB_2_IPL0_MASK    0x10U
  #define INTC_IPR5_TMRB_2_IPL1_MASK    0x20U
  #define INTC_IPR5_TMRB_3_IPL0_MASK    0x40U
  #define INTC_IPR5_TMRB_3_IPL1_MASK    0x80U
  #define INTC_IPR5_COMPA_IPL0_MASK     0x0100U
  #define INTC_IPR5_COMPA_IPL1_MASK     0x0200U
  #define INTC_IPR5_COMPB_IPL0_MASK     0x0400U
  #define INTC_IPR5_COMPB_IPL1_MASK     0x0800U
  #define INTC_IPR5_PIT0_IPL0_MASK      0x1000U
  #define INTC_IPR5_PIT0_IPL1_MASK      0x2000U
  #define INTC_IPR5_PIT1_IPL0_MASK      0x4000U
  #define INTC_IPR5_PIT1_IPL1_MASK      0x8000U
  #define INTC_IPR5_TMRB_0_IPL_MASK     0x03U
  #define INTC_IPR5_TMRB_0_IPL_BITNUM   0x00U
  #define INTC_IPR5_TMRB_1_IPL_MASK     0x0CU
  #define INTC_IPR5_TMRB_1_IPL_BITNUM   0x02U
  #define INTC_IPR5_TMRB_2_IPL_MASK     0x30U
  #define INTC_IPR5_TMRB_2_IPL_BITNUM   0x04U
  #define INTC_IPR5_TMRB_3_IPL_MASK     0xC0U
  #define INTC_IPR5_TMRB_3_IPL_BITNUM   0x06U
  #define INTC_IPR5_COMPA_IPL_MASK      0x0300U
  #define INTC_IPR5_COMPA_IPL_BITNUM    0x08U
  #define INTC_IPR5_COMPB_IPL_MASK      0x0C00U
  #define INTC_IPR5_COMPB_IPL_BITNUM    0x0AU
  #define INTC_IPR5_PIT0_IPL_MASK       0x3000U
  #define INTC_IPR5_PIT0_IPL_BITNUM     0x0CU
  #define INTC_IPR5_PIT1_IPL_MASK       0xC000U
  #define INTC_IPR5_PIT1_IPL_BITNUM     0x0EU
  #define INTC_IPR5                     *((volatile word *)0x0000F0E5)


  /*** INTC_IPR6 - Interrupt Priority Register 6; 0x0000F0E6 ***/
  union {
    word Word;
  } INTC_IPR6_STR;
  
