goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define INTC_IPR6_PIT2_IPL0_MASK      0x01U
  #define INTC_IPR6_PIT2_IPL1_MASK      0x02U
  #define INTC_IPR6_ADCA_CC_IPL0_MASK   0x04U
  #define INTC_IPR6_ADCA_CC_IPL1_MASK   0x08U
  #define INTC_IPR6_ADCB_CC_IPL0_MASK   0x10U
  #define INTC_IPR6_ADCB_CC_IPL1_MASK   0x20U
  #define INTC_IPR6_ADC_ZC_IPL0_MASK    0x40U
  #define INTC_IPR6_ADC_ZC_IPL1_MASK    0x80U
  #define INTC_IPR6_PWM_RL_IPL0_MASK    0x0100U
  #define INTC_IPR6_PWM_RL_IPL1_MASK    0x0200U
  #define INTC_IPR6_PWM_F_IPL0_MASK     0x0400U
  #define INTC_IPR6_PWM_F_IPL1_MASK     0x0800U
  #define INTC_IPR6_PIT2_IPL_MASK       0x03U
  #define INTC_IPR6_PIT2_IPL_BITNUM     0x00U
  #define INTC_IPR6_ADCA_CC_IPL_MASK    0x0CU
  #define INTC_IPR6_ADCA_CC_IPL_BITNUM  0x02U
  #define INTC_IPR6_ADCB_CC_IPL_MASK    0x30U
  #define INTC_IPR6_ADCB_CC_IPL_BITNUM  0x04U
  #define INTC_IPR6_ADC_ZC_IPL_MASK     0xC0U
  #define INTC_IPR6_ADC_ZC_IPL_BITNUM   0x06U
  #define INTC_IPR6_PWM_RL_IPL_MASK     0x0300U
  #define INTC_IPR6_PWM_RL_IPL_BITNUM   0x08U
  #define INTC_IPR6_PWM_F_IPL_MASK      0x0C00U
  #define INTC_IPR6_PWM_F_IPL_BITNUM    0x0AU
  #define INTC_IPR6                     *((volatile word *)0x0000F0E6)


  /*** INTC_VBA - Vector Base Address Register; 0x0000F0E7 ***/
  union {
    word Word;
  } INTC_VBA_STR;
  
  #define INTC_VBA_VECTOR_BASE_ADDRESS0_MASK 0x01U
  #define INTC_VBA_VECTOR_BASE_ADDRESS1_MASK 0x02U
  #define INTC_VBA_VECTOR_BASE_ADDRESS2_MASK 0x04U
  #define INTC_VBA_VECTOR_BASE_ADDRESS3_MASK 0x08U
  #define INTC_VBA_VECTOR_BASE_ADDRESS4_MASK 0x10U
  #define INTC_VBA_VECTOR_BASE_ADDRESS5_MASK 0x20U
  #define INTC_VBA_VECTOR_BASE_ADDRESS6_MASK 0x40U
  #define INTC_VBA_VECTOR_BASE_ADDRESS7_MASK 0x80U
  #define INTC_VBA_VECTOR_BASE_ADDRESS8_MASK 0x0100U
  #define INTC_VBA_VECTOR_BASE_ADDRESS9_MASK 0x0200U
  #define INTC_VBA_VECTOR_BASE_ADDRESS10_MASK 0x0400U
  #define INTC_VBA_VECTOR_BASE_ADDRESS11_MASK 0x0800U
  #define INTC_VBA_VECTOR_BASE_ADDRESS12_MASK 0x1000U
  #define INTC_VBA_VECTOR_BASE_ADDRESS13_MASK 0x2000U
  #define INTC_VBA_VECTOR_BASE_ADDRESS_MASK 0x3FFFU
  #define INTC_VBA_VECTOR_BASE_ADDRESS_BITNUM 0x00U
  #define INTC_VBA                      *((volatile word *)0x0000F0E7)


  /*** INTC_FIM0 - Fast Interrupt 0 Match Register; 0x0000F0E8 ***/
  union {
    word Word;
  } INTC_FIM0_STR;
  
  #define INTC_FIM0_FAST_INTERRUPT_00_MASK 0x01U
  #define INTC_FIM0_FAST_INTERRUPT_01_MASK 0x02U
  #define INTC_FIM0_FAST_INTERRUPT_02_MASK 0x04U
  #define INTC_FIM0_FAST_INTERRUPT_03_MASK 0x08U
  #define INTC_FIM0_FAST_INTERRUPT_04_MASK 0x10U
  #define INTC_FIM0_FAST_INTERRUPT_05_MASK 0x20U
  #define INTC_FIM0_FAST_INTERRUPT_0_MASK 0x3FU
  #define INTC_FIM0_FAST_INTERRUPT_0_BITNUM 0x00U
  #define INTC_FIM0                     *((volatile word *)0x0000F0E8)


  /*** INTC_FIVAL0 - Fast Interrupt 0 Vector Address Low Register; 0x0000F0E9 ***/
  union {
    word Word;
  } INTC_FIVAL0_STR;
  
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW0_MASK 0x01U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW1_MASK 0x02U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW2_MASK 0x04U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW3_MASK 0x08U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW4_MASK 0x10U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW5_MASK 0x20U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW6_MASK 0x40U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW7_MASK 0x80U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW8_MASK 0x0100U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW9_MASK 0x0200U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW10_MASK 0x0400U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW11_MASK 0x0800U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW12_MASK 0x1000U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW13_MASK 0x2000U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW14_MASK 0x4000U
  #define INTC_FIVAL0_FAST_INTERRUPT_0_VECTOR_ADDRESS_LOW15_MASK 0x8000U
  #define INTC_FIVAL0                   *((volatile word *)0x0000F0E9)


  /*** INTC_FIVAH0 - Fast Interrupt 0 Vector Address High Register; 0x0000F0EA ***/
  union {
    word Word;
  } INTC_FIVAH0_STR;
  
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH0_MASK 0x01U
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH1_MASK 0x02U
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH2_MASK 0x04U
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH3_MASK 0x08U
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH4_MASK 0x10U
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH_MASK 0x1FU
  #define INTC_FIVAH0_FAST_INTERRUPT_0_VECTOR_ADDRESS_HIGH_BITNUM 0x00U
  #define INTC_FIVAH0                   *((volatile word *)0x0000F0EA)


  /*** INTC_FIM1 - Fast Interrupt 1 Match Register; 0x0000F0EB ***/
  union {
    word Word;
  } INTC_FIM1_STR;
  
  #define INTC_FIM1_FAST_INTERRUPT_10_MASK 0x01U
  #define INTC_FIM1_FAST_INTERRUPT_11_MASK 0x02U
  #define INTC_FIM1_FAST_INTERRUPT_12_MASK 0x04U
  #define INTC_FIM1_FAST_INTERRUPT_13_MASK 0x08U
  #define INTC_FIM1_FAST_INTERRUPT_14_MASK 0x10U
  #define INTC_FIM1_FAST_INTERRUPT_15_MASK 0x20U
  #define INTC_FIM1_FAST_INTERRUPT_1_MASK 0x3FU
  #define INTC_FIM1_FAST_INTERRUPT_1_BITNUM 0x00U
  #define INTC_FIM1                     *((volatile word *)0x0000F0EB)


  /*** INTC_FIVAL1 - Fast Interrupt 1 Vector Address Low Register; 0x0000F0EC ***/
  union {
    word Word;
  } INTC_FIVAL1_STR;
  
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW0_MASK 0x01U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW1_MASK 0x02U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW2_MASK 0x04U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW3_MASK 0x08U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW4_MASK 0x10U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW5_MASK 0x20U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW6_MASK 0x40U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW7_MASK 0x80U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW8_MASK 0x0100U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW9_MASK 0x0200U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW10_MASK 0x0400U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW11_MASK 0x0800U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW12_MASK 0x1000U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW13_MASK 0x2000U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW14_MASK 0x4000U
  #define INTC_FIVAL1_FAST_INTERRUPT_1_VECTOR_ADDRESS_LOW15_MASK 0x8000U
  #define INTC_FIVAL1                   *((volatile word *)0x0000F0EC)


