goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** INTC_FIVAH1 - Fast Interrupt 1 Vector Address High Register; 0x0000F0ED ***/
  union {
    word Word;
  } INTC_FIVAH1_STR;
  
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH0_MASK 0x01U
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH1_MASK 0x02U
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH2_MASK 0x04U
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH3_MASK 0x08U
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH4_MASK 0x10U
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH_MASK 0x1FU
  #define INTC_FIVAH1_FAST_INTERRUPT_1_VECTOR_ADDRESS_HIGH_BITNUM 0x00U
  #define INTC_FIVAH1                   *((volatile word *)0x0000F0ED)


  /*** INTC_IRQP0 - IRQ Pending Register 0; 0x0000F0EE ***/
  union {
    word Word;
  } INTC_IRQP0_STR;
  
  #define INTC_IRQP0_PENDING2_MASK      0x02U
  #define INTC_IRQP0_PENDING3_MASK      0x04U
  #define INTC_IRQP0_PENDING4_MASK      0x08U
  #define INTC_IRQP0_PENDING5_MASK      0x10U
  #define INTC_IRQP0_PENDING6_MASK      0x20U
  #define INTC_IRQP0_PENDING7_MASK      0x40U
  #define INTC_IRQP0_PENDING8_MASK      0x80U
  #define INTC_IRQP0_PENDING9_MASK      0x0100U
  #define INTC_IRQP0_PENDING10_MASK     0x0200U
  #define INTC_IRQP0_PENDING11_MASK     0x0400U
  #define INTC_IRQP0_PENDING12_MASK     0x0800U
  #define INTC_IRQP0_PENDING13_MASK     0x1000U
  #define INTC_IRQP0_PENDING14_MASK     0x2000U
  #define INTC_IRQP0_PENDING15_MASK     0x4000U
  #define INTC_IRQP0_PENDING16_MASK     0x8000U
  #define INTC_IRQP0_PENDING_2_MASK     0xFFFEU
  #define INTC_IRQP0_PENDING_2_BITNUM   0x01U
  #define INTC_IRQP0                    *((volatile word *)0x0000F0EE)


  /*** INTC_IRQP1 - IRQ Pending Register 1; 0x0000F0EF ***/
  union {
    word Word;
  } INTC_IRQP1_STR;
  
  #define INTC_IRQP1_PENDING17_MASK     0x01U
  #define INTC_IRQP1_PENDING18_MASK     0x02U
  #define INTC_IRQP1_PENDING19_MASK     0x04U
  #define INTC_IRQP1_PENDING20_MASK     0x08U
  #define INTC_IRQP1_PENDING21_MASK     0x10U
  #define INTC_IRQP1_PENDING22_MASK     0x20U
  #define INTC_IRQP1_PENDING23_MASK     0x40U
  #define INTC_IRQP1_PENDING24_MASK     0x80U
  #define INTC_IRQP1_PENDING25_MASK     0x0100U
  #define INTC_IRQP1_PENDING26_MASK     0x0200U
  #define INTC_IRQP1_PENDING27_MASK     0x0400U
  #define INTC_IRQP1_PENDING28_MASK     0x0800U
  #define INTC_IRQP1_PENDING29_MASK     0x1000U
  #define INTC_IRQP1_PENDING30_MASK     0x2000U
  #define INTC_IRQP1_PENDING31_MASK     0x4000U
  #define INTC_IRQP1_PENDING32_MASK     0x8000U
  #define INTC_IRQP1                    *((volatile word *)0x0000F0EF)


  /*** INTC_IRQP2 - IRQ Pending Register 2; 0x0000F0F0 ***/
  union {
    word Word;
  } INTC_IRQP2_STR;
  
  #define INTC_IRQP2_PENDING33_MASK     0x01U
  #define INTC_IRQP2_PENDING34_MASK     0x02U
  #define INTC_IRQP2_PENDING35_MASK     0x04U
  #define INTC_IRQP2_PENDING36_MASK     0x08U
  #define INTC_IRQP2_PENDING37_MASK     0x10U
  #define INTC_IRQP2_PENDING38_MASK     0x20U
  #define INTC_IRQP2_PENDING39_MASK     0x40U
  #define INTC_IRQP2_PENDING40_MASK     0x80U
  #define INTC_IRQP2_PENDING41_MASK     0x0100U
  #define INTC_IRQP2_PENDING42_MASK     0x0200U
  #define INTC_IRQP2_PENDING43_MASK     0x0400U
  #define INTC_IRQP2_PENDING44_MASK     0x0800U
  #define INTC_IRQP2_PENDING45_MASK     0x1000U
  #define INTC_IRQP2_PENDING46_MASK     0x2000U
  #define INTC_IRQP2_PENDING47_MASK     0x4000U
  #define INTC_IRQP2_PENDING48_MASK     0x8000U
  #define INTC_IRQP2                    *((volatile word *)0x0000F0F0)


  /*** INTC_IRQP3 - IRQ Pending Register 3; 0x0000F0F1 ***/
  union {
    word Word;
  } INTC_IRQP3_STR;
  
  #define INTC_IRQP3_PENDING49_MASK     0x01U
  #define INTC_IRQP3_PENDING50_MASK     0x02U
  #define INTC_IRQP3_PENDING51_MASK     0x04U
  #define INTC_IRQP3_PENDING52_MASK     0x08U
  #define INTC_IRQP3_PENDING53_MASK     0x10U
  #define INTC_IRQP3_PENDING54_MASK     0x20U
  #define INTC_IRQP3_PENDING55_MASK     0x40U
  #define INTC_IRQP3_PENDING56_MASK     0x80U
  #define INTC_IRQP3_PENDING57_MASK     0x0100U
  #define INTC_IRQP3_PENDING58_MASK     0x0200U
  #define INTC_IRQP3_PENDING59_MASK     0x0400U
  #define INTC_IRQP3_PENDING60_MASK     0x0800U
  #define INTC_IRQP3_PENDING61_MASK     0x1000U
  #define INTC_IRQP3_PENDING62_MASK     0x2000U
  #define INTC_IRQP3_PENDING63_MASK     0x4000U
  #define INTC_IRQP3_PENDING_49_MASK    0x7FFFU
  #define INTC_IRQP3_PENDING_49_BITNUM  0x00U
  #define INTC_IRQP3                    *((volatile word *)0x0000F0F1)


  /*** INTC_TIRQS0 - Test IRQ Source Register 0; 0x0000F0F2 ***/
  union {
    word Word;
  } INTC_TIRQS0_STR;
  
  #define INTC_TIRQS0_TEST_IRQ2_MASK    0x02U
  #define INTC_TIRQS0_TEST_IRQ3_MASK    0x04U
  #define INTC_TIRQS0_TEST_IRQ4_MASK    0x08U
  #define INTC_TIRQS0_TEST_IRQ5_MASK    0x10U
  #define INTC_TIRQS0_TEST_IRQ6_MASK    0x20U
  #define INTC_TIRQS0_TEST_IRQ7_MASK    0x40U
  #define INTC_TIRQS0_TEST_IRQ8_MASK    0x80U
  #define INTC_TIRQS0_TEST_IRQ9_MASK    0x0100U
  #define INTC_TIRQS0_TEST_IRQ10_MASK   0x0200U
  #define INTC_TIRQS0_TEST_IRQ11_MASK   0x0400U
  #define INTC_TIRQS0_TEST_IRQ12_MASK   0x0800U
  #define INTC_TIRQS0_TEST_IRQ13_MASK   0x1000U
  #define INTC_TIRQS0_TEST_IRQ14_MASK   0x2000U
  #define INTC_TIRQS0_TEST_IRQ15_MASK   0x4000U
  #define INTC_TIRQS0_TEST_IRQ16_MASK   0x8000U
  #define INTC_TIRQS0_TEST_IRQ_2_MASK   0xFFFEU
  #define INTC_TIRQS0_TEST_IRQ_2_BITNUM 0x01U
  #define INTC_TIRQS0                   *((volatile word *)0x0000F0F2)


  /*** INTC_TIRQS1 - Test IRQ Source Register 1; 0x0000F0F3 ***/
  union {
    word Word;
  } INTC_TIRQS1_STR;
  
  #define INTC_TIRQS1_TEST_IRQ17_MASK   0x01U
  #define INTC_TIRQS1_TEST_IRQ18_MASK   0x02U
  #define INTC_TIRQS1_TEST_IRQ19_MASK   0x04U
  #define INTC_TIRQS1_TEST_IRQ20_MASK   0x08U
  #define INTC_TIRQS1_TEST_IRQ21_MASK   0x10U
  #define INTC_TIRQS1_TEST_IRQ22_MASK   0x20U
  #define INTC_TIRQS1_TEST_IRQ23_MASK   0x40U
  #define INTC_TIRQS1_TEST_IRQ24_MASK   0x80U
  #define INTC_TIRQS1_TEST_IRQ25_MASK   0x0100U
  #define INTC_TIRQS1_TEST_IRQ26_MASK   0x0200U
  #define INTC_TIRQS1_TEST_IRQ27_MASK   0x0400U
  #define INTC_TIRQS1_TEST_IRQ28_MASK   0x0800U
  #define INTC_TIRQS1_TEST_IRQ29_MASK   0x1000U
  #define INTC_TIRQS1_TEST_IRQ30_MASK   0x2000U
  #define INTC_TIRQS1_TEST_IRQ31_MASK   0x4000U
  #define INTC_TIRQS1_TEST_IRQ32_MASK   0x8000U
  #define INTC_TIRQS1                   *((volatile word *)0x0000F0F3)


  /*** INTC_TIRQS2 - Test IRQ Source Register 2; 0x0000F0F4 ***/
  union {
    word Word;
  } INTC_TIRQS2_STR;
  
  #define INTC_TIRQS2_TEST_IRQ33_MASK   0x01U
  #define INTC_TIRQS2_TEST_IRQ34_MASK   0x02U
  #define INTC_TIRQS2_TEST_IRQ35_MASK   0x04U
  #define INTC_TIRQS2_TEST_IRQ36_MASK   0x08U
  #define INTC_TIRQS2_TEST_IRQ37_MASK   0x10U
  #define INTC_TIRQS2_TEST_IRQ38_MASK   0x20U
  #define INTC_TIRQS2_TEST_IRQ39_MASK   0x40U
  #define INTC_TIRQS2_TEST_IRQ40_MASK   0x80U
  #define INTC_TIRQS2_TEST_IRQ41_MASK   0x0100U
  #define INTC_TIRQS2_TEST_IRQ42_MASK   0x0200U
  #define INTC_TIRQS2_TEST_IRQ43_MASK   0x0400U
  #define INTC_TIRQS2_TEST_IRQ44_MASK   0x0800U
  #define INTC_TIRQS2_TEST_IRQ45_MASK   0x1000U
  #define INTC_TIRQS2_TEST_IRQ46_MASK   0x2000U
  #define INTC_TIRQS2_TEST_IRQ47_MASK   0x4000U
  #define INTC_TIRQS2_TEST_IRQ48_MASK   0x8000U
  #define INTC_TIRQS2                   *((volatile word *)0x0000F0F4)


