goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** INTC_TIRQS3 - Test IRQ Source Register 3; 0x0000F0F5 ***/
  union {
    word Word;
  } INTC_TIRQS3_STR;
  
  #define INTC_TIRQS3_TEST_IRQ49_MASK   0x01U
  #define INTC_TIRQS3_TEST_IRQ50_MASK   0x02U
  #define INTC_TIRQS3_TEST_IRQ51_MASK   0x04U
  #define INTC_TIRQS3_TEST_IRQ52_MASK   0x08U
  #define INTC_TIRQS3_TEST_IRQ53_MASK   0x10U
  #define INTC_TIRQS3_TEST_IRQ54_MASK   0x20U
  #define INTC_TIRQS3_TEST_IRQ55_MASK   0x40U
  #define INTC_TIRQS3_TEST_IRQ56_MASK   0x80U
  #define INTC_TIRQS3_TEST_IRQ57_MASK   0x0100U
  #define INTC_TIRQS3_TEST_IRQ58_MASK   0x0200U
  #define INTC_TIRQS3_TEST_IRQ59_MASK   0x0400U
  #define INTC_TIRQS3_TEST_IRQ60_MASK   0x0800U
  #define INTC_TIRQS3_TEST_IRQ61_MASK   0x1000U
  #define INTC_TIRQS3_TEST_IRQ62_MASK   0x2000U
  #define INTC_TIRQS3_TEST_IRQ63_MASK   0x4000U
  #define INTC_TIRQS3_TEST_IRQ_49_MASK  0x7FFFU
  #define INTC_TIRQS3_TEST_IRQ_49_BITNUM 0x00U
  #define INTC_TIRQS3                   *((volatile word *)0x0000F0F5)


  /*** INTC_CTRL - Interrupt Control Register; 0x0000F0F6 ***/
  union {
    word Word;
  } INTC_CTRL_STR;
  
  #define INTC_CTRL_INT_DIS_MASK        0x20U
  #define INTC_CTRL_VAB0_MASK           0x40U
  #define INTC_CTRL_VAB1_MASK           0x80U
  #define INTC_CTRL_VAB2_MASK           0x0100U
  #define INTC_CTRL_VAB3_MASK           0x0200U
  #define INTC_CTRL_VAB4_MASK           0x0400U
  #define INTC_CTRL_VAB5_MASK           0x0800U
  #define INTC_CTRL_VAB6_MASK           0x1000U
  #define INTC_CTRL_IPIC0_MASK          0x2000U
  #define INTC_CTRL_IPIC1_MASK          0x4000U
  #define INTC_CTRL_INT_MASK            0x8000U
  #define INTC_CTRL_VAB_MASK            0x1FC0U
  #define INTC_CTRL_VAB_BITNUM          0x06U
  #define INTC_CTRL_IPIC_MASK           0x6000U
  #define INTC_CTRL_IPIC_BITNUM         0x0DU
  #define INTC_CTRL                     *((volatile word *)0x0000F0F6)


  /*** INTC_TCTRL - Test Interrupt Control Register; 0x0000F0F7 ***/
  union {
    word Word;
  } INTC_TCTRL_STR;
  
  #define INTC_TCTRL_PIC_EN_MASK        0x01U
  #define INTC_TCTRL_IACK_MASK          0x02U
  #define INTC_TCTRL_SR0_MASK           0x04U
  #define INTC_TCTRL_SR1_MASK           0x08U
  #define INTC_TCTRL_MODE0_MASK         0x10U
  #define INTC_TCTRL_MODE1_MASK         0x20U
  #define INTC_TCTRL_VAB0_MASK          0x40U
  #define INTC_TCTRL_VAB1_MASK          0x80U
  #define INTC_TCTRL_VAB2_MASK          0x0100U
  #define INTC_TCTRL_VAB3_MASK          0x0200U
  #define INTC_TCTRL_VAB4_MASK          0x0400U
  #define INTC_TCTRL_VAB5_MASK          0x0800U
  #define INTC_TCTRL_VAB6_MASK          0x1000U
  #define INTC_TCTRL_VAB7_MASK          0x2000U
  #define INTC_TCTRL_VAB8_MASK          0x4000U
  #define INTC_TCTRL_VAB9_MASK          0x8000U
  #define INTC_TCTRL_SR_MASK            0x0CU
  #define INTC_TCTRL_SR_BITNUM          0x02U
  #define INTC_TCTRL_MODE_MASK          0x30U
  #define INTC_TCTRL_MODE_BITNUM        0x04U
  #define INTC_TCTRL_VAB_MASK           0xFFC0U
  #define INTC_TCTRL_VAB_BITNUM         0x06U
  #define INTC_TCTRL                    *((volatile word *)0x0000F0F7)


  word Reserved0[8];                   /* Reserved (unused) registers */

} INTC_PRPH;

/******************************************
*** Peripheral SIM
*******************************************/
typedef volatile struct {
  /*** SIM_CTRL - SIM Control Register; 0x0000F100 ***/
  union {
    word Word;
  } SIM_CTRL_STR;
  
  #define SIM_CTRL_WAIT_DISABLE0_MASK   0x01U
  #define SIM_CTRL_WAIT_DISABLE1_MASK   0x02U
  #define SIM_CTRL_STOP_DISABLE0_MASK   0x04U
  #define SIM_CTRL_STOP_DISABLE1_MASK   0x08U
  #define SIM_CTRL_SWRST_MASK           0x10U
  #define SIM_CTRL_ONCEEBL_MASK         0x20U
  #define SIM_CTRL_WAIT_DISABLE_MASK    0x03U
  #define SIM_CTRL_WAIT_DISABLE_BITNUM  0x00U
  #define SIM_CTRL_STOP_DISABLE_MASK    0x0CU
  #define SIM_CTRL_STOP_DISABLE_BITNUM  0x02U
  #define SIM_CTRL                      *((volatile word *)0x0000F100)


  /*** SIM_RSTAT - SIM Reset Status Register; 0x0000F101 ***/
  union {
    word Word;
  } SIM_RSTAT_STR;
  
  #define SIM_RSTAT_POR_MASK            0x04U
  #define SIM_RSTAT_EXTR_MASK           0x08U
  #define SIM_RSTAT_COP_LOR_MASK        0x10U
  #define SIM_RSTAT_COP_TOR_MASK        0x20U
  #define SIM_RSTAT_SWR_MASK            0x40U
  #define SIM_RSTAT                     *((volatile word *)0x0000F101)


  /*** SIM_SWC0 - SIM Software Control Register 0; 0x0000F102 ***/
  union {
    word Word;
  } SIM_SWC0_STR;
  
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_00_MASK 0x01U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_01_MASK 0x02U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_02_MASK 0x04U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_03_MASK 0x08U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_04_MASK 0x10U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_05_MASK 0x20U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_06_MASK 0x40U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_07_MASK 0x80U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_08_MASK 0x0100U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_09_MASK 0x0200U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_010_MASK 0x0400U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_011_MASK 0x0800U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_012_MASK 0x1000U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_013_MASK 0x2000U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_014_MASK 0x4000U
  #define SIM_SWC0_SOFTWARE_CONTROL_DATA_015_MASK 0x8000U
  #define SIM_SWC0                      *((volatile word *)0x0000F102)


  /*** SIM_SWC1 - SIM Software Control Register 1; 0x0000F103 ***/
  union {
    word Word;
  } SIM_SWC1_STR;
  
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_10_MASK 0x01U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_11_MASK 0x02U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_12_MASK 0x04U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_13_MASK 0x08U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_14_MASK 0x10U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_15_MASK 0x20U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_16_MASK 0x40U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_17_MASK 0x80U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_18_MASK 0x0100U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_19_MASK 0x0200U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_110_MASK 0x0400U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_111_MASK 0x0800U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_112_MASK 0x1000U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_113_MASK 0x2000U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_114_MASK 0x4000U
  #define SIM_SWC1_SOFTWARE_CONTROL_DATA_115_MASK 0x8000U
  #define SIM_SWC1                      *((volatile word *)0x0000F103)


