goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** SIM_SWC2 - SIM Software Control Register 2; 0x0000F104 ***/
  union {
    word Word;
  } SIM_SWC2_STR;
  
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_20_MASK 0x01U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_21_MASK 0x02U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_22_MASK 0x04U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_23_MASK 0x08U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_24_MASK 0x10U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_25_MASK 0x20U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_26_MASK 0x40U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_27_MASK 0x80U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_28_MASK 0x0100U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_29_MASK 0x0200U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_210_MASK 0x0400U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_211_MASK 0x0800U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_212_MASK 0x1000U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_213_MASK 0x2000U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_214_MASK 0x4000U
  #define SIM_SWC2_SOFTWARE_CONTROL_DATA_215_MASK 0x8000U
  #define SIM_SWC2                      *((volatile word *)0x0000F104)


  /*** SIM_SWC3 - SIM Software Control Register 3; 0x0000F105 ***/
  union {
    word Word;
  } SIM_SWC3_STR;
  
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_30_MASK 0x01U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_31_MASK 0x02U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_32_MASK 0x04U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_33_MASK 0x08U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_34_MASK 0x10U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_35_MASK 0x20U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_36_MASK 0x40U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_37_MASK 0x80U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_38_MASK 0x0100U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_39_MASK 0x0200U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_310_MASK 0x0400U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_311_MASK 0x0800U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_312_MASK 0x1000U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_313_MASK 0x2000U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_314_MASK 0x4000U
  #define SIM_SWC3_SOFTWARE_CONTROL_DATA_315_MASK 0x8000U
  #define SIM_SWC3                      *((volatile word *)0x0000F105)


  /*** SIM_MSHID - SIM Most Significant Half JTAG ID; 0x0000F106 ***/
  union {
    word Word;
  } SIM_MSHID_STR;
  
  #define SIM_MSHID_SIM_MSH_ID0_MASK    0x01U
  #define SIM_MSHID_SIM_MSH_ID1_MASK    0x02U
  #define SIM_MSHID_SIM_MSH_ID2_MASK    0x04U
  #define SIM_MSHID_SIM_MSH_ID3_MASK    0x08U
  #define SIM_MSHID_SIM_MSH_ID4_MASK    0x10U
  #define SIM_MSHID_SIM_MSH_ID5_MASK    0x20U
  #define SIM_MSHID_SIM_MSH_ID6_MASK    0x40U
  #define SIM_MSHID_SIM_MSH_ID7_MASK    0x80U
  #define SIM_MSHID_SIM_MSH_ID8_MASK    0x0100U
  #define SIM_MSHID_SIM_MSH_ID9_MASK    0x0200U
  #define SIM_MSHID_SIM_MSH_ID10_MASK   0x0400U
  #define SIM_MSHID_SIM_MSH_ID11_MASK   0x0800U
  #define SIM_MSHID_SIM_MSH_ID12_MASK   0x1000U
  #define SIM_MSHID_SIM_MSH_ID13_MASK   0x2000U
  #define SIM_MSHID_SIM_MSH_ID14_MASK   0x4000U
  #define SIM_MSHID_SIM_MSH_ID15_MASK   0x8000U
  #define SIM_MSHID                     *((volatile word *)0x0000F106)


  /*** SIM_LSHID - SIM Least Significant Half JTAG ID; 0x0000F107 ***/
  union {
    word Word;
  } SIM_LSHID_STR;
  
  #define SIM_LSHID_SIM_LSH_ID0_MASK    0x01U
  #define SIM_LSHID_SIM_LSH_ID1_MASK    0x02U
  #define SIM_LSHID_SIM_LSH_ID2_MASK    0x04U
  #define SIM_LSHID_SIM_LSH_ID3_MASK    0x08U
  #define SIM_LSHID_SIM_LSH_ID4_MASK    0x10U
  #define SIM_LSHID_SIM_LSH_ID5_MASK    0x20U
  #define SIM_LSHID_SIM_LSH_ID6_MASK    0x40U
  #define SIM_LSHID_SIM_LSH_ID7_MASK    0x80U
  #define SIM_LSHID_SIM_LSH_ID8_MASK    0x0100U
  #define SIM_LSHID_SIM_LSH_ID9_MASK    0x0200U
  #define SIM_LSHID_SIM_LSH_ID10_MASK   0x0400U
  #define SIM_LSHID_SIM_LSH_ID11_MASK   0x0800U
  #define SIM_LSHID_SIM_LSH_ID12_MASK   0x1000U
  #define SIM_LSHID_SIM_LSH_ID13_MASK   0x2000U
  #define SIM_LSHID_SIM_LSH_ID14_MASK   0x4000U
  #define SIM_LSHID_SIM_LSH_ID15_MASK   0x8000U
  #define SIM_LSHID                     *((volatile word *)0x0000F107)


  /*** SIM_PWR - Power Control Register; 0x0000F108 ***/
  union {
    word Word;
  } SIM_PWR_STR;
  
  #define SIM_PWR_LRSTDBY0_MASK         0x01U
  #define SIM_PWR_LRSTDBY1_MASK         0x02U
  #define SIM_PWR_LRSTDBY_MASK          0x03U
  #define SIM_PWR_LRSTDBY_BITNUM        0x00U
  #define SIM_PWR                       *((volatile word *)0x0000F108)


  word Reserved0[1];                   /* Reserved (unused) registers */
  
  /*** SIM_CLKOUT - SIM CLKO Select Register; 0x0000F10A ***/
  union {
    word Word;
  } SIM_CLKOUT_STR;
  
  #define SIM_CLKOUT_CLKOSEL0_MASK      0x01U
  #define SIM_CLKOUT_CLKOSEL1_MASK      0x02U
  #define SIM_CLKOUT_CLKOSEL2_MASK      0x04U
  #define SIM_CLKOUT_CLKOSEL3_MASK      0x08U
  #define SIM_CLKOUT_CLKOSEL4_MASK      0x10U
  #define SIM_CLKOUT_CLKDIS_MASK        0x20U
  #define SIM_CLKOUT_PWM0_b_MASK        0x40U
  #define SIM_CLKOUT_PWM1_b_MASK        0x80U
  #define SIM_CLKOUT_PWM2_b_MASK        0x0100U
  #define SIM_CLKOUT_PWM3_b_MASK        0x0200U
  #define SIM_CLKOUT_CLKOSEL_MASK       0x1FU
  #define SIM_CLKOUT_CLKOSEL_BITNUM     0x00U
  #define SIM_CLKOUT                    *((volatile word *)0x0000F10A)


  /*** SIM_PCR - SIM Peripheral Clock Rate Register; 0x0000F10B ***/
  union {
    word Word;
  } SIM_PCR_STR;
  
  #define SIM_PCR_I2C_CR_MASK           0x1000U
  #define SIM_PCR_PWM_CR_MASK           0x2000U
  #define SIM_PCR_TMRA_CR_MASK          0x4000U
  #define SIM_PCR_TMRB_CR_MASK          0x8000U
  #define SIM_PCR                       *((volatile word *)0x0000F10B)


  /*** SIM_PCE0 - SIM Peripheral Clock Enable Register 0; 0x0000F10C ***/
  union {
    word Word;
  } SIM_PCE0_STR;
  
  #define SIM_PCE0_PWM_MASK             0x01U
  #define SIM_PCE0_QSPI0_MASK           0x04U
  #define SIM_PCE0_QSPI1_MASK           0x08U
  #define SIM_PCE0_QSCI0_MASK           0x10U
  #define SIM_PCE0_QSCI1_MASK           0x20U
  #define SIM_PCE0_I2C_MASK             0x40U
  #define SIM_PCE0_ADC_MASK             0x0400U
  #define SIM_PCE0_DAC0_MASK            0x1000U
  #define SIM_PCE0_DAC1_MASK            0x2000U
  #define SIM_PCE0_CMPA_MASK            0x4000U
  #define SIM_PCE0_CMPB_MASK            0x8000U
  #define SIM_PCE0_QSPI_MASK            0x0CU
  #define SIM_PCE0_QSPI_BITNUM          0x02U
  #define SIM_PCE0_QSCI_MASK            0x30U
  #define SIM_PCE0_QSCI_BITNUM          0x04U
  #define SIM_PCE0_DAC_MASK             0x3000U
  #define SIM_PCE0_DAC_BITNUM           0x0CU
  #define SIM_PCE0_CMPx_MASK            0xC000U
  #define SIM_PCE0_CMPx_BITNUM          0x0EU
  #define SIM_PCE0                      *((volatile word *)0x0000F10C)


  /*** SIM_PCE1 - SIM Peripheral Clock Enable Register 1; 0x0000F10D ***/
  union {
    word Word;
  } SIM_PCE1_STR;
  
  #define SIM_PCE1_TA0_MASK             0x01U
  #define SIM_PCE1_TA1_MASK             0x02U
  #define SIM_PCE1_TA2_MASK             0x04U
  #define SIM_PCE1_TA3_MASK             0x08U
  #define SIM_PCE1_TB0_MASK             0x10U
  #define SIM_PCE1_TB1_MASK             0x20U
  #define SIM_PCE1_TB2_MASK             0x40U
  #define SIM_PCE1_TB3_MASK             0x80U
  #define SIM_PCE1_PIT0_MASK            0x1000U
  #define SIM_PCE1_PIT1_MASK            0x2000U
  #define SIM_PCE1_PIT2_MASK            0x4000U
  #define SIM_PCE1_TA_MASK              0x0FU
  #define SIM_PCE1_TA_BITNUM            0x00U
  #define SIM_PCE1_TB_MASK              0xF0U
  #define SIM_PCE1_TB_BITNUM            0x04U
  #define SIM_PCE1_PIT_MASK             0x7000U
  #define SIM_PCE1_PIT_BITNUM           0x0CU
  #define SIM_PCE1                      *((volatile word *)0x0000F10D)


  /*** SIM_SD0 - SIM STOP Disable Register 0; 0x0000F10E ***/
  union {
    word Word;
  } SIM_SD0_STR;
  
  #define SIM_SD0_PWM_SD_MASK           0x01U
  #define SIM_SD0_QSPI0_SD_MASK         0x04U
  #define SIM_SD0_QSPI1_SD_MASK         0x08U
  #define SIM_SD0_QSCI0_SD_MASK         0x10U
  #define SIM_SD0_QSCI1_SD_MASK         0x20U
  #define SIM_SD0_I2C_SD_MASK           0x40U
  #define SIM_SD0_ADC_SD_MASK           0x0400U
  #define SIM_SD0_DAC0_SD_MASK          0x1000U
  #define SIM_SD0_DAC1_SD_MASK          0x2000U
  #define SIM_SD0_CMPA_SD_MASK          0x4000U
  #define SIM_SD0_CMPB_SD_MASK          0x8000U
  #define SIM_SD0                       *((volatile word *)0x0000F10E)


