goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** SIM_SD1 - SIM STOP Disable Register 1; 0x0000F10F ***/
  union {
    word Word;
  } SIM_SD1_STR;
  
  #define SIM_SD1_TA0_SD_MASK           0x01U
  #define SIM_SD1_TA1_SD_MASK           0x02U
  #define SIM_SD1_TA2_SD_MASK           0x04U
  #define SIM_SD1_TA3_SD_MASK           0x08U
  #define SIM_SD1_TB0_SD_MASK           0x10U
  #define SIM_SD1_TB1_SD_MASK           0x20U
  #define SIM_SD1_TB2_SD_MASK           0x40U
  #define SIM_SD1_TB3_SD_MASK           0x80U
  #define SIM_SD1_PIT0_SD_MASK          0x1000U
  #define SIM_SD1_PIT1_SD_MASK          0x2000U
  #define SIM_SD1_PIT2_SD_MASK          0x4000U
  #define SIM_SD1                       *((volatile word *)0x0000F10F)


  /*** SIM_IOSAHI - SIM I/O Short Address Location High register; 0x0000F110 ***/
  union {
    word Word;
  } SIM_IOSAHI_STR;
  
  #define SIM_IOSAHI_ISAL0_MASK         0x01U
  #define SIM_IOSAHI_ISAL1_MASK         0x02U
  #define SIM_IOSAHI_ISAL_MASK          0x03U
  #define SIM_IOSAHI_ISAL_BITNUM        0x00U
  #define SIM_IOSAHI                    *((volatile word *)0x0000F110)


  /*** SIM_IOSALO - SIM I/O Short Address Location Low register; 0x0000F111 ***/
  union {
    word Word;
  } SIM_IOSALO_STR;
  
  #define SIM_IOSALO_ISAL0_MASK         0x01U
  #define SIM_IOSALO_ISAL1_MASK         0x02U
  #define SIM_IOSALO_ISAL2_MASK         0x04U
  #define SIM_IOSALO_ISAL3_MASK         0x08U
  #define SIM_IOSALO_ISAL4_MASK         0x10U
  #define SIM_IOSALO_ISAL5_MASK         0x20U
  #define SIM_IOSALO_ISAL6_MASK         0x40U
  #define SIM_IOSALO_ISAL7_MASK         0x80U
  #define SIM_IOSALO_ISAL8_MASK         0x0100U
  #define SIM_IOSALO_ISAL9_MASK         0x0200U
  #define SIM_IOSALO_ISAL10_MASK        0x0400U
  #define SIM_IOSALO_ISAL11_MASK        0x0800U
  #define SIM_IOSALO_ISAL12_MASK        0x1000U
  #define SIM_IOSALO_ISAL13_MASK        0x2000U
  #define SIM_IOSALO_ISAL14_MASK        0x4000U
  #define SIM_IOSALO_ISAL15_MASK        0x8000U
  #define SIM_IOSALO                    *((volatile word *)0x0000F111)


  /*** SIM_PROT - SIM Protection Register; 0x0000F112 ***/
  union {
    word Word;
  } SIM_PROT_STR;
  
  #define SIM_PROT_GIPSP0_MASK          0x01U
  #define SIM_PROT_GIPSP1_MASK          0x02U
  #define SIM_PROT_PCEP0_MASK           0x04U
  #define SIM_PROT_PCEP1_MASK           0x08U
  #define SIM_PROT_GIPSP_MASK           0x03U
  #define SIM_PROT_GIPSP_BITNUM         0x00U
  #define SIM_PROT_PCEP_MASK            0x0CU
  #define SIM_PROT_PCEP_BITNUM          0x02U
  #define SIM_PROT                      *((volatile word *)0x0000F112)


  /*** SIM_GPSA0 - SIM GPIO Peripheral Select Register 0 for GPIOA; 0x0000F113 ***/
  union {
    word Word;
  } SIM_GPSA0_STR;
  
  #define SIM_GPSA0_GPS_A40_MASK        0x0100U
  #define SIM_GPSA0_GPS_A41_MASK        0x0200U
  #define SIM_GPSA0_GPS_A50_MASK        0x0400U
  #define SIM_GPSA0_GPS_A51_MASK        0x0800U
  #define SIM_GPSA0_GPS_A6_MASK         0x1000U
  #define SIM_GPSA0_GPS_A4_MASK         0x0300U
  #define SIM_GPSA0_GPS_A4_BITNUM       0x08U
  #define SIM_GPSA0_GPS_A5_MASK         0x0C00U
  #define SIM_GPSA0_GPS_A5_BITNUM       0x0AU
  #define SIM_GPSA0                     *((volatile word *)0x0000F113)


  /*** SIM_GPSA1 - SIM GPIO Peripheral Select Register 1 for GPIOA; 0x0000F114 ***/
  union {
    word Word;
  } SIM_GPSA1_STR;
  
  #define SIM_GPSA1_GPS_A80_MASK        0x01U
  #define SIM_GPSA1_GPS_A81_MASK        0x02U
  #define SIM_GPSA1_GPS_A90_MASK        0x04U
  #define SIM_GPSA1_GPS_A91_MASK        0x08U
  #define SIM_GPSA1_GPS_A10_MASK        0x10U
  #define SIM_GPSA1_GPS_A11_MASK        0x40U
  #define SIM_GPSA1_GPS_A120_MASK       0x0100U
  #define SIM_GPSA1_GPS_A121_MASK       0x0200U
  #define SIM_GPSA1_GPS_A130_MASK       0x0400U
  #define SIM_GPSA1_GPS_A131_MASK       0x0800U
  #define SIM_GPSA1_GPS_A140_MASK       0x1000U
  #define SIM_GPSA1_GPS_A141_MASK       0x2000U
  #define SIM_GPSA1_GPS_A8_MASK         0x03U
  #define SIM_GPSA1_GPS_A8_BITNUM       0x00U
  #define SIM_GPSA1_GPS_A9_MASK         0x0CU
  #define SIM_GPSA1_GPS_A9_BITNUM       0x02U
  #define SIM_GPSA1_GPS_A12_MASK        0x0300U
  #define SIM_GPSA1_GPS_A12_BITNUM      0x08U
  #define SIM_GPSA1_GPS_A13_MASK        0x0C00U
  #define SIM_GPSA1_GPS_A13_BITNUM      0x0AU
  #define SIM_GPSA1_GPS_A14_MASK        0x3000U
  #define SIM_GPSA1_GPS_A14_BITNUM      0x0CU
  #define SIM_GPSA1                     *((volatile word *)0x0000F114)


  /*** SIM_GPSB0 - SIM GPIO Peripheral Select Register 0 for GPIOB; 0x0000F115 ***/
  union {
    word Word;
  } SIM_GPSB0_STR;
  
  #define SIM_GPSB0_GPS_B0_MASK         0x01U
  #define SIM_GPSB0_GPS_B1_MASK         0x04U
  #define SIM_GPSB0_GPS_B20_MASK        0x10U
  #define SIM_GPSB0_GPS_B21_MASK        0x20U
  #define SIM_GPSB0_GPS_B30_MASK        0x40U
  #define SIM_GPSB0_GPS_B31_MASK        0x80U
  #define SIM_GPSB0_GPS_B40_MASK        0x0100U
  #define SIM_GPSB0_GPS_B41_MASK        0x0200U
  #define SIM_GPSB0_GPS_B42_MASK        0x0400U
  #define SIM_GPSB0_GPS_B50_MASK        0x0800U
  #define SIM_GPSB0_GPS_B51_MASK        0x1000U
  #define SIM_GPSB0_GPS_B60_MASK        0x2000U
  #define SIM_GPSB0_GPS_B61_MASK        0x4000U
  #define SIM_GPSB0_GPS_B2_MASK         0x30U
  #define SIM_GPSB0_GPS_B2_BITNUM       0x04U
  #define SIM_GPSB0_GPS_B3_MASK         0xC0U
  #define SIM_GPSB0_GPS_B3_BITNUM       0x06U
  #define SIM_GPSB0_GPS_B4_MASK         0x0700U
  #define SIM_GPSB0_GPS_B4_BITNUM       0x08U
  #define SIM_GPSB0_GPS_B5_MASK         0x1800U
  #define SIM_GPSB0_GPS_B5_BITNUM       0x0BU
  #define SIM_GPSB0_GPS_B6_MASK         0x6000U
  #define SIM_GPSB0_GPS_B6_BITNUM       0x0DU
  #define SIM_GPSB0                     *((volatile word *)0x0000F115)


  /*** SIM_GPSB1 - SIM GPIO Peripheral Select Register 1 for GPIOB; 0x0000F116 ***/
  union {
    word Word;
  } SIM_GPSB1_STR;
  
  #define SIM_GPSB1_GPS_B7_MASK         0x01U
  #define SIM_GPSB1_GPS_B8_MASK         0x04U
  #define SIM_GPSB1_GPS_B9_MASK         0x10U
  #define SIM_GPSB1_GPS_B10_MASK        0x40U
  #define SIM_GPSB1_GPS_B11_MASK        0x0100U
  #define SIM_GPSB1                     *((volatile word *)0x0000F116)


  /*** SIM_GPSCD - SIM GPIO Peripheral Select Register for GPIOC and GPIOD; 0x0000F117 ***/
  union {
    word Word;
  } SIM_GPSCD_STR;
  
