goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define SIM_GPSCD_GPS_C8_MASK         0x04U
  #define SIM_GPSCD_GPS_C12_MASK        0x10U
  #define SIM_GPSCD_GPS_D5_MASK         0x1000U
  #define SIM_GPSCD                     *((volatile word *)0x0000F117)


  /*** SIM_IPS0 - SIM Internal Peripheral Select Register for PWM; 0x0000F118 ***/
  union {
    word Word;
  } SIM_IPS0_STR;
  
  #define SIM_IPS0_IPS_PSRC00_MASK      0x01U
  #define SIM_IPS0_IPS_PSRC01_MASK      0x02U
  #define SIM_IPS0_IPS_PSRC02_MASK      0x04U
  #define SIM_IPS0_IPS_PSRC10_MASK      0x08U
  #define SIM_IPS0_IPS_PSRC11_MASK      0x10U
  #define SIM_IPS0_IPS_PSRC12_MASK      0x20U
  #define SIM_IPS0_IPS_PSRC20_MASK      0x40U
  #define SIM_IPS0_IPS_PSRC21_MASK      0x80U
  #define SIM_IPS0_IPS_PSRC22_MASK      0x0100U
  #define SIM_IPS0_IPS_FAULT1_MASK      0x0800U
  #define SIM_IPS0_IPS_FAULT2_MASK      0x2000U
  #define SIM_IPS0_IPS_PSRC0_MASK       0x07U
  #define SIM_IPS0_IPS_PSRC0_BITNUM     0x00U
  #define SIM_IPS0_IPS_PSRC1_MASK       0x38U
  #define SIM_IPS0_IPS_PSRC1_BITNUM     0x03U
  #define SIM_IPS0_IPS_PSRC2_MASK       0x01C0U
  #define SIM_IPS0_IPS_PSRC2_BITNUM     0x06U
  #define SIM_IPS0                      *((volatile word *)0x0000F118)


  /*** SIM_IPS1 - SIM Internal Peripheral Select Register for DACs; 0x0000F119 ***/
  union {
    word Word;
  } SIM_IPS1_STR;
  
  #define SIM_IPS1_IPS_DSYNC00_MASK     0x01U
  #define SIM_IPS1_IPS_DSYNC01_MASK     0x02U
  #define SIM_IPS1_IPS_DSYNC02_MASK     0x04U
  #define SIM_IPS1_IPS_DSYNC10_MASK     0x10U
  #define SIM_IPS1_IPS_DSYNC11_MASK     0x20U
  #define SIM_IPS1_IPS_DSYNC12_MASK     0x40U
  #define SIM_IPS1_IPS_DSYNC0_MASK      0x07U
  #define SIM_IPS1_IPS_DSYNC0_BITNUM    0x00U
  #define SIM_IPS1_IPS_DSYNC1_MASK      0x70U
  #define SIM_IPS1_IPS_DSYNC1_BITNUM    0x04U
  #define SIM_IPS1                      *((volatile word *)0x0000F119)


  /*** SIM_IPS2 - SIM Internal Peripheral Select Register for TMRA; 0x0000F11A ***/
  union {
    word Word;
  } SIM_IPS2_STR;
  
  #define SIM_IPS2_IPS_TA1_MASK         0x10U
  #define SIM_IPS2_IPS_TA2_MASK         0x0100U
  #define SIM_IPS2_IPS_TA3_MASK         0x1000U
  #define SIM_IPS2                      *((volatile word *)0x0000F11A)


  word Reserved1[5];                   /* Reserved (unused) registers */

} SIM_PRPH;

/******************************************
*** Peripheral COP
*******************************************/
typedef volatile struct {
  /*** COP_CTRL - COP Control Register; 0x0000F120 ***/
  union {
    word Word;
  } COP_CTRL_STR;
  
  #define COP_CTRL_CWP_MASK             0x01U
  #define COP_CTRL_CEN_MASK             0x02U
  #define COP_CTRL_CWEN_MASK            0x04U
  #define COP_CTRL_CSEN_MASK            0x08U
  #define COP_CTRL_BYPS_MASK            0x10U
  #define COP_CTRL_CLOREN_MASK          0x20U
  #define COP_CTRL_CLKSEL_MASK          0x40U
  #define COP_CTRL                      *((volatile word *)0x0000F120)


  /*** COP_TOUT - Timeout Register; 0x0000F121 ***/
  union {
    word Word;
  } COP_TOUT_STR;
  
  #define COP_TOUT_TIMEOUT0_MASK        0x01U
  #define COP_TOUT_TIMEOUT1_MASK        0x02U
  #define COP_TOUT_TIMEOUT2_MASK        0x04U
  #define COP_TOUT_TIMEOUT3_MASK        0x08U
  #define COP_TOUT_TIMEOUT4_MASK        0x10U
  #define COP_TOUT_TIMEOUT5_MASK        0x20U
  #define COP_TOUT_TIMEOUT6_MASK        0x40U
  #define COP_TOUT_TIMEOUT7_MASK        0x80U
  #define COP_TOUT_TIMEOUT8_MASK        0x0100U
  #define COP_TOUT_TIMEOUT9_MASK        0x0200U
  #define COP_TOUT_TIMEOUT10_MASK       0x0400U
  #define COP_TOUT_TIMEOUT11_MASK       0x0800U
  #define COP_TOUT_TIMEOUT12_MASK       0x1000U
  #define COP_TOUT_TIMEOUT13_MASK       0x2000U
  #define COP_TOUT_TIMEOUT14_MASK       0x4000U
  #define COP_TOUT_TIMEOUT15_MASK       0x8000U
  #define COP_TOUT                      *((volatile word *)0x0000F121)


  /*** COP_CNTR - Counter Register; 0x0000F122 ***/
  union {
    word Word;
  } COP_CNTR_STR;
  
  #define COP_CNTR                      *((volatile word *)0x0000F122)


  word Reserved0[13];                  /* Reserved (unused) registers */

} COP_PRPH;

/******************************************
*** Peripheral OCCS
*******************************************/
typedef volatile struct {
  /*** OCCS_CTRL - PLL Control Register; 0x0000F130 ***/
  union {
    word Word;
  } OCCS_CTRL_STR;
  
  #define OCCS_CTRL_ZSRC0_MASK          0x01U
  #define OCCS_CTRL_ZSRC1_MASK          0x02U
  #define OCCS_CTRL_PRECS_MASK          0x04U
  #define OCCS_CTRL_PLLPD_MASK          0x10U
  #define OCCS_CTRL_LCKON_MASK          0x80U
  #define OCCS_CTRL_LOCIE_MASK          0x0800U
  #define OCCS_CTRL_PLLIE00_MASK        0x1000U
  #define OCCS_CTRL_PLLIE01_MASK        0x2000U
  #define OCCS_CTRL_PLLIE10_MASK        0x4000U
  #define OCCS_CTRL_PLLIE11_MASK        0x8000U
  #define OCCS_CTRL_ZSRC_MASK           0x03U
  #define OCCS_CTRL_ZSRC_BITNUM         0x00U
  #define OCCS_CTRL_PLLIE0_MASK         0x3000U
  #define OCCS_CTRL_PLLIE0_BITNUM       0x0CU
  #define OCCS_CTRL_PLLIE1_MASK         0xC000U
  #define OCCS_CTRL_PLLIE1_BITNUM       0x0EU
  #define OCCS_CTRL                     *((volatile word *)0x0000F130)


  /*** OCCS_DIVBY - PLL Divide- by Register; 0x0000F131 ***/
  union {
    word Word;
  } OCCS_DIVBY_STR;
  
  #define OCCS_DIVBY_PLLCOD0_MASK       0x0100U
  #define OCCS_DIVBY_PLLCOD1_MASK       0x0200U
  #define OCCS_DIVBY_PLLCOD2_MASK       0x0400U
  #define OCCS_DIVBY_LORTP0_MASK        0x1000U
  #define OCCS_DIVBY_LORTP1_MASK        0x2000U
  #define OCCS_DIVBY_LORTP2_MASK        0x4000U
  #define OCCS_DIVBY_LORTP3_MASK        0x8000U
  #define OCCS_DIVBY_PLLCOD_MASK        0x0700U
  #define OCCS_DIVBY_PLLCOD_BITNUM      0x08U
  #define OCCS_DIVBY_LORTP_MASK         0xF000U
  #define OCCS_DIVBY_LORTP_BITNUM       0x0CU
  #define OCCS_DIVBY                    *((volatile word *)0x0000F131)


  /*** OCCS_STAT - PLL Status Register; 0x0000F132 ***/
  union {
    word Word;
  } OCCS_STAT_STR;
  
  #define OCCS_STAT_ZSRC0_MASK          0x01U
  #define OCCS_STAT_ZSRC1_MASK          0x02U
  #define OCCS_STAT_PLLPDN_MASK         0x10U
  #define OCCS_STAT_LCK0_MASK           0x20U
  #define OCCS_STAT_LCK1_MASK           0x40U
  #define OCCS_STAT_LOCI_MASK           0x2000U
  #define OCCS_STAT_LOLI0_MASK          0x4000U
  #define OCCS_STAT_LOLI1_MASK          0x8000U
  #define OCCS_STAT_ZSRC_MASK           0x03U
  #define OCCS_STAT_ZSRC_BITNUM         0x00U
  #define OCCS_STAT_LCK_MASK            0x60U
  #define OCCS_STAT_LCK_BITNUM          0x05U
  #define OCCS_STAT_LOLI_MASK           0xC000U
  #define OCCS_STAT_LOLI_BITNUM         0x0EU
  #define OCCS_STAT                     *((volatile word *)0x0000F132)


  word Reserved0[2];                   /* Reserved (unused) registers */
  
  /*** OCCS_OCTRL - Oscillator Control Register; 0x0000F135 ***/
  union {
    word Word;
  } OCCS_OCTRL_STR;
  
  #define OCCS_OCTRL_TRIM0_MASK         0x01U
  #define OCCS_OCTRL_TRIM1_MASK         0x02U
  #define OCCS_OCTRL_TRIM2_MASK         0x04U
  #define OCCS_OCTRL_TRIM3_MASK         0x08U
  #define OCCS_OCTRL_TRIM4_MASK         0x10U
  #define OCCS_OCTRL_TRIM5_MASK         0x20U
  #define OCCS_OCTRL_TRIM6_MASK         0x40U
  #define OCCS_OCTRL_TRIM7_MASK         0x80U
  #define OCCS_OCTRL_TRIM8_MASK         0x0100U
  #define OCCS_OCTRL_TRIM9_MASK         0x0200U
  #define OCCS_OCTRL_EXT_SEL0_MASK      0x0400U
  #define OCCS_OCTRL_EXT_SEL1_MASK      0x0800U
  #define OCCS_OCTRL_CLK_MODE_MASK      0x1000U
  #define OCCS_OCTRL_COHL_MASK          0x2000U
  #define OCCS_OCTRL_ROSB_MASK          0x4000U
  #define OCCS_OCTRL_ROPD_MASK          0x8000U
  #define OCCS_OCTRL_TRIM_MASK          0x03FFU
  #define OCCS_OCTRL_TRIM_BITNUM        0x00U
  #define OCCS_OCTRL_EXT_SEL_MASK       0x0C00U
  #define OCCS_OCTRL_EXT_SEL_BITNUM     0x0AU
  #define OCCS_OCTRL                    *((volatile word *)0x0000F135)


  /*** OCCS_CLKCHK - External Clock Check Register; 0x0000F136 ***/
  union {
    word Word;
  } OCCS_CLKCHK_STR;
  
