goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define OCCS_CLKCHK_TARGET_CNT0_MASK  0x01U
  #define OCCS_CLKCHK_TARGET_CNT1_MASK  0x02U
  #define OCCS_CLKCHK_TARGET_CNT2_MASK  0x04U
  #define OCCS_CLKCHK_TARGET_CNT3_MASK  0x08U
  #define OCCS_CLKCHK_TARGET_CNT4_MASK  0x10U
  #define OCCS_CLKCHK_TARGET_CNT5_MASK  0x20U
  #define OCCS_CLKCHK_TARGET_CNT6_MASK  0x40U
  #define OCCS_CLKCHK_TARGET_CNT7_MASK  0x80U
  #define OCCS_CLKCHK_REF_CNT0_MASK     0x0100U
  #define OCCS_CLKCHK_REF_CNT1_MASK     0x0200U
  #define OCCS_CLKCHK_REF_CNT2_MASK     0x0400U
  #define OCCS_CLKCHK_REF_CNT3_MASK     0x0800U
  #define OCCS_CLKCHK_REF_CNT4_MASK     0x1000U
  #define OCCS_CLKCHK_REF_CNT5_MASK     0x2000U
  #define OCCS_CLKCHK_REF_CNT6_MASK     0x4000U
  #define OCCS_CLKCHK_CHK_EN_MASK       0x8000U
  #define OCCS_CLKCHK_TARGET_CNT_MASK   0xFFU
  #define OCCS_CLKCHK_TARGET_CNT_BITNUM 0x00U
  #define OCCS_CLKCHK_REF_CNT_MASK      0x7F00U
  #define OCCS_CLKCHK_REF_CNT_BITNUM    0x08U
  #define OCCS_CLKCHK                   *((volatile word *)0x0000F136)


  /*** OCCS_PROT - Protection Register; 0x0000F137 ***/
  union {
    word Word;
  } OCCS_PROT_STR;
  
  #define OCCS_PROT_PLLEP0_MASK         0x01U
  #define OCCS_PROT_PLLEP1_MASK         0x02U
  #define OCCS_PROT_OSCEP0_MASK         0x04U
  #define OCCS_PROT_OSCEP1_MASK         0x08U
  #define OCCS_PROT_FRQEP0_MASK         0x10U
  #define OCCS_PROT_FRQEP1_MASK         0x20U
  #define OCCS_PROT_PLLEP_MASK          0x03U
  #define OCCS_PROT_PLLEP_BITNUM        0x00U
  #define OCCS_PROT_OSCEP_MASK          0x0CU
  #define OCCS_PROT_OSCEP_BITNUM        0x02U
  #define OCCS_PROT_FRQEP_MASK          0x30U
  #define OCCS_PROT_FRQEP_BITNUM        0x04U
  #define OCCS_PROT                     *((volatile word *)0x0000F137)


  word Reserved1[8];                   /* Reserved (unused) registers */

} OCCS_PRPH;

/******************************************
*** Peripheral LVI
*******************************************/
typedef volatile struct {
  /*** PS_CTRL - Power Supervisor Control Register; 0x0000F140 ***/
  union {
    word Word;
  } PS_CTRL_STR;
  
  #define PS_CTRL_LVIE22_MASK           0x01U
  #define PS_CTRL_LVIE27_MASK           0x02U
  #define PS_CTRL                       *((volatile word *)0x0000F140)


  /*** PS_STAT - Power Supervisor Status Register; 0x0000F141 ***/
  union {
    word Word;
  } PS_STAT_STR;
  
  #define PS_STAT_LVIS22_MASK           0x01U
  #define PS_STAT_LVIS27_MASK           0x02U
  #define PS_STAT_LVIS22S_MASK          0x04U
  #define PS_STAT_LVIS27S_MASK          0x08U
  #define PS_STAT_LVI_MASK              0x10U
  #define PS_STAT                       *((volatile word *)0x0000F141)


  word Reserved0[14];                  /* Reserved (unused) registers */

} LVI_PRPH;

/******************************************
*** Peripheral GPIOA
*******************************************/
typedef volatile struct {
  /*** GPIO_A_PUPEN - GPIO A Pull-up Enable Register; 0x0000F150 ***/
  union {
    word Word;
  } GPIO_A_PUPEN_STR;
  
  #define GPIO_A_PUPEN_PU0_MASK         0x01U
  #define GPIO_A_PUPEN_PU1_MASK         0x02U
  #define GPIO_A_PUPEN_PU2_MASK         0x04U
  #define GPIO_A_PUPEN_PU3_MASK         0x08U
  #define GPIO_A_PUPEN_PU4_MASK         0x10U
  #define GPIO_A_PUPEN_PU5_MASK         0x20U
  #define GPIO_A_PUPEN_PU6_MASK         0x40U
  #define GPIO_A_PUPEN_PU7_MASK         0x80U
  #define GPIO_A_PUPEN_PU8_MASK         0x0100U
  #define GPIO_A_PUPEN_PU9_MASK         0x0200U
  #define GPIO_A_PUPEN_PU10_MASK        0x0400U
  #define GPIO_A_PUPEN_PU11_MASK        0x0800U
  #define GPIO_A_PUPEN_PU12_MASK        0x1000U
  #define GPIO_A_PUPEN_PU13_MASK        0x2000U
  #define GPIO_A_PUPEN_PU14_MASK        0x4000U
  #define GPIO_A_PUPEN_PU_MASK          0x7FFFU
  #define GPIO_A_PUPEN_PU_BITNUM        0x00U
  #define GPIO_A_PUPEN                  *((volatile word *)0x0000F150)


  /*** GPIO_A_DATA - GPIO A Data Register; 0x0000F151 ***/
  union {
    word Word;
  } GPIO_A_DATA_STR;
  
  #define GPIO_A_DATA_D0_MASK           0x01U
  #define GPIO_A_DATA_D1_MASK           0x02U
  #define GPIO_A_DATA_D2_MASK           0x04U
  #define GPIO_A_DATA_D3_MASK           0x08U
  #define GPIO_A_DATA_D4_MASK           0x10U
  #define GPIO_A_DATA_D5_MASK           0x20U
  #define GPIO_A_DATA_D6_MASK           0x40U
  #define GPIO_A_DATA_D7_MASK           0x80U
  #define GPIO_A_DATA_D8_MASK           0x0100U
  #define GPIO_A_DATA_D9_MASK           0x0200U
  #define GPIO_A_DATA_D10_MASK          0x0400U
  #define GPIO_A_DATA_D11_MASK          0x0800U
  #define GPIO_A_DATA_D12_MASK          0x1000U
  #define GPIO_A_DATA_D13_MASK          0x2000U
  #define GPIO_A_DATA_D14_MASK          0x4000U
  #define GPIO_A_DATA_D_MASK            0x7FFFU
  #define GPIO_A_DATA_D_BITNUM          0x00U
  #define GPIO_A_DATA                   *((volatile word *)0x0000F151)


  /*** GPIO_A_DDIR - GPIO A Data Direction Register; 0x0000F152 ***/
  union {
    word Word;
  } GPIO_A_DDIR_STR;
  
  #define GPIO_A_DDIR_DD0_MASK          0x01U
  #define GPIO_A_DDIR_DD1_MASK          0x02U
  #define GPIO_A_DDIR_DD2_MASK          0x04U
  #define GPIO_A_DDIR_DD3_MASK          0x08U
  #define GPIO_A_DDIR_DD4_MASK          0x10U
  #define GPIO_A_DDIR_DD5_MASK          0x20U
  #define GPIO_A_DDIR_DD6_MASK          0x40U
  #define GPIO_A_DDIR_DD7_MASK          0x80U
  #define GPIO_A_DDIR_DD8_MASK          0x0100U
  #define GPIO_A_DDIR_DD9_MASK          0x0200U
  #define GPIO_A_DDIR_DD10_MASK         0x0400U
  #define GPIO_A_DDIR_DD11_MASK         0x0800U
  #define GPIO_A_DDIR_DD12_MASK         0x1000U
  #define GPIO_A_DDIR_DD13_MASK         0x2000U
  #define GPIO_A_DDIR_DD14_MASK         0x4000U
  #define GPIO_A_DDIR_DD_MASK           0x7FFFU
  #define GPIO_A_DDIR_DD_BITNUM         0x00U
  #define GPIO_A_DDIR                   *((volatile word *)0x0000F152)


  /*** GPIO_A_PEREN - GPIO A Peripheral Enable Registers; 0x0000F153 ***/
  union {
    word Word;
  } GPIO_A_PEREN_STR;
  
