goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define GPIO_A_PEREN_PE0_MASK         0x01U
  #define GPIO_A_PEREN_PE1_MASK         0x02U
  #define GPIO_A_PEREN_PE2_MASK         0x04U
  #define GPIO_A_PEREN_PE3_MASK         0x08U
  #define GPIO_A_PEREN_PE4_MASK         0x10U
  #define GPIO_A_PEREN_PE5_MASK         0x20U
  #define GPIO_A_PEREN_PE6_MASK         0x40U
  #define GPIO_A_PEREN_PE7_MASK         0x80U
  #define GPIO_A_PEREN_PE8_MASK         0x0100U
  #define GPIO_A_PEREN_PE9_MASK         0x0200U
  #define GPIO_A_PEREN_PE10_MASK        0x0400U
  #define GPIO_A_PEREN_PE11_MASK        0x0800U
  #define GPIO_A_PEREN_PE12_MASK        0x1000U
  #define GPIO_A_PEREN_PE13_MASK        0x2000U
  #define GPIO_A_PEREN_PE14_MASK        0x4000U
  #define GPIO_A_PEREN_PE_MASK          0x7FFFU
  #define GPIO_A_PEREN_PE_BITNUM        0x00U
  #define GPIO_A_PEREN                  *((volatile word *)0x0000F153)


  /*** GPIO_A_IASSRT - GPIO A Interrupt Assert Register; 0x0000F154 ***/
  union {
    word Word;
  } GPIO_A_IASSRT_STR;
  
  #define GPIO_A_IASSRT_IA0_MASK        0x01U
  #define GPIO_A_IASSRT_IA1_MASK        0x02U
  #define GPIO_A_IASSRT_IA2_MASK        0x04U
  #define GPIO_A_IASSRT_IA3_MASK        0x08U
  #define GPIO_A_IASSRT_IA4_MASK        0x10U
  #define GPIO_A_IASSRT_IA5_MASK        0x20U
  #define GPIO_A_IASSRT_IA6_MASK        0x40U
  #define GPIO_A_IASSRT_IA7_MASK        0x80U
  #define GPIO_A_IASSRT_IA8_MASK        0x0100U
  #define GPIO_A_IASSRT_IA9_MASK        0x0200U
  #define GPIO_A_IASSRT_IA10_MASK       0x0400U
  #define GPIO_A_IASSRT_IA11_MASK       0x0800U
  #define GPIO_A_IASSRT_IA12_MASK       0x1000U
  #define GPIO_A_IASSRT_IA13_MASK       0x2000U
  #define GPIO_A_IASSRT_IA14_MASK       0x4000U
  #define GPIO_A_IASSRT_IA_MASK         0x7FFFU
  #define GPIO_A_IASSRT_IA_BITNUM       0x00U
  #define GPIO_A_IASSRT                 *((volatile word *)0x0000F154)


  /*** GPIO_A_IEN - GPIO A Interrupt Enable Register; 0x0000F155 ***/
  union {
    word Word;
  } GPIO_A_IEN_STR;
  
  #define GPIO_A_IEN_IEN0_MASK          0x01U
  #define GPIO_A_IEN_IEN1_MASK          0x02U
  #define GPIO_A_IEN_IEN2_MASK          0x04U
  #define GPIO_A_IEN_IEN3_MASK          0x08U
  #define GPIO_A_IEN_IEN4_MASK          0x10U
  #define GPIO_A_IEN_IEN5_MASK          0x20U
  #define GPIO_A_IEN_IEN6_MASK          0x40U
  #define GPIO_A_IEN_IEN7_MASK          0x80U
  #define GPIO_A_IEN_IEN8_MASK          0x0100U
  #define GPIO_A_IEN_IEN9_MASK          0x0200U
  #define GPIO_A_IEN_IEN10_MASK         0x0400U
  #define GPIO_A_IEN_IEN11_MASK         0x0800U
  #define GPIO_A_IEN_IEN12_MASK         0x1000U
  #define GPIO_A_IEN_IEN13_MASK         0x2000U
  #define GPIO_A_IEN_IEN14_MASK         0x4000U
  #define GPIO_A_IEN_IEN_MASK           0x7FFFU
  #define GPIO_A_IEN_IEN_BITNUM         0x00U
  #define GPIO_A_IEN                    *((volatile word *)0x0000F155)


  /*** GPIO_A_IPOL - GPIO A Interrupt Polarity Register; 0x0000F156 ***/
  union {
    word Word;
  } GPIO_A_IPOL_STR;
  
  #define GPIO_A_IPOL_IPOL0_MASK        0x01U
  #define GPIO_A_IPOL_IPOL1_MASK        0x02U
  #define GPIO_A_IPOL_IPOL2_MASK        0x04U
  #define GPIO_A_IPOL_IPOL3_MASK        0x08U
  #define GPIO_A_IPOL_IPOL4_MASK        0x10U
  #define GPIO_A_IPOL_IPOL5_MASK        0x20U
  #define GPIO_A_IPOL_IPOL6_MASK        0x40U
  #define GPIO_A_IPOL_IPOL7_MASK        0x80U
  #define GPIO_A_IPOL_IPOL8_MASK        0x0100U
  #define GPIO_A_IPOL_IPOL9_MASK        0x0200U
  #define GPIO_A_IPOL_IPOL10_MASK       0x0400U
  #define GPIO_A_IPOL_IPOL11_MASK       0x0800U
  #define GPIO_A_IPOL_IPOL12_MASK       0x1000U
  #define GPIO_A_IPOL_IPOL13_MASK       0x2000U
  #define GPIO_A_IPOL_IPOL14_MASK       0x4000U
  #define GPIO_A_IPOL_IPOL_MASK         0x7FFFU
  #define GPIO_A_IPOL_IPOL_BITNUM       0x00U
  #define GPIO_A_IPOL                   *((volatile word *)0x0000F156)


  /*** GPIO_A_IPEND - GPIO A Interrupt Pending Register; 0x0000F157 ***/
  union {
    word Word;
  } GPIO_A_IPEND_STR;
  
  #define GPIO_A_IPEND_IP0_MASK         0x01U
  #define GPIO_A_IPEND_IP1_MASK         0x02U
  #define GPIO_A_IPEND_IP2_MASK         0x04U
  #define GPIO_A_IPEND_IP3_MASK         0x08U
  #define GPIO_A_IPEND_IP4_MASK         0x10U
  #define GPIO_A_IPEND_IP5_MASK         0x20U
  #define GPIO_A_IPEND_IP6_MASK         0x40U
  #define GPIO_A_IPEND_IP7_MASK         0x80U
  #define GPIO_A_IPEND_IP8_MASK         0x0100U
  #define GPIO_A_IPEND_IP9_MASK         0x0200U
  #define GPIO_A_IPEND_IP10_MASK        0x0400U
  #define GPIO_A_IPEND_IP11_MASK        0x0800U
  #define GPIO_A_IPEND_IP12_MASK        0x1000U
  #define GPIO_A_IPEND_IP13_MASK        0x2000U
  #define GPIO_A_IPEND_IP14_MASK        0x4000U
  #define GPIO_A_IPEND_IP_MASK          0x7FFFU
  #define GPIO_A_IPEND_IP_BITNUM        0x00U
  #define GPIO_A_IPEND                  *((volatile word *)0x0000F157)


  /*** GPIO_A_IEDGE - GPIO A Interrupt Edge Sensitive Register; 0x0000F158 ***/
  union {
    word Word;
  } GPIO_A_IEDGE_STR;
  
  #define GPIO_A_IEDGE_IES0_MASK        0x01U
  #define GPIO_A_IEDGE_IES1_MASK        0x02U
  #define GPIO_A_IEDGE_IES2_MASK        0x04U
  #define GPIO_A_IEDGE_IES3_MASK        0x08U
  #define GPIO_A_IEDGE_IES4_MASK        0x10U
  #define GPIO_A_IEDGE_IES5_MASK        0x20U
  #define GPIO_A_IEDGE_IES6_MASK        0x40U
  #define GPIO_A_IEDGE_IES7_MASK        0x80U
  #define GPIO_A_IEDGE_IES8_MASK        0x0100U
  #define GPIO_A_IEDGE_IES9_MASK        0x0200U
  #define GPIO_A_IEDGE_IES10_MASK       0x0400U
  #define GPIO_A_IEDGE_IES11_MASK       0x0800U
  #define GPIO_A_IEDGE_IES12_MASK       0x1000U
  #define GPIO_A_IEDGE_IES13_MASK       0x2000U
  #define GPIO_A_IEDGE_IES14_MASK       0x4000U
  #define GPIO_A_IEDGE_IES_MASK         0x7FFFU
  #define GPIO_A_IEDGE_IES_BITNUM       0x00U
  #define GPIO_A_IEDGE                  *((volatile word *)0x0000F158)


  /*** GPIO_A_PPOUTM - GPIO A Push-Pull Mode Register; 0x0000F159 ***/
  union {
    word Word;
  } GPIO_A_PPOUTM_STR;
  
  #define GPIO_A_PPOUTM_PPMODE0_MASK    0x01U
  #define GPIO_A_PPOUTM_PPMODE1_MASK    0x02U
  #define GPIO_A_PPOUTM_PPMODE2_MASK    0x04U
  #define GPIO_A_PPOUTM_PPMODE3_MASK    0x08U
  #define GPIO_A_PPOUTM_PPMODE4_MASK    0x10U
  #define GPIO_A_PPOUTM_PPMODE5_MASK    0x20U
  #define GPIO_A_PPOUTM_PPMODE6_MASK    0x40U
  #define GPIO_A_PPOUTM_PPMODE7_MASK    0x80U
  #define GPIO_A_PPOUTM_PPMODE8_MASK    0x0100U
  #define GPIO_A_PPOUTM_PPMODE9_MASK    0x0200U
  #define GPIO_A_PPOUTM_PPMODE10_MASK   0x0400U
  #define GPIO_A_PPOUTM_PPMODE11_MASK   0x0800U
  #define GPIO_A_PPOUTM_PPMODE12_MASK   0x1000U
  #define GPIO_A_PPOUTM_PPMODE13_MASK   0x2000U
  #define GPIO_A_PPOUTM_PPMODE14_MASK   0x4000U
  #define GPIO_A_PPOUTM_PPMODE_MASK     0x7FFFU
  #define GPIO_A_PPOUTM_PPMODE_BITNUM   0x00U
  #define GPIO_A_PPOUTM                 *((volatile word *)0x0000F159)


  /*** GPIO_A_RDATA - GPIO A Raw Data Register; 0x0000F15A ***/
  union {
    word Word;
  } GPIO_A_RDATA_STR;
  
