goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define GPIO_A_RDATA_RAW_DATA0_MASK   0x01U
  #define GPIO_A_RDATA_RAW_DATA1_MASK   0x02U
  #define GPIO_A_RDATA_RAW_DATA2_MASK   0x04U
  #define GPIO_A_RDATA_RAW_DATA3_MASK   0x08U
  #define GPIO_A_RDATA_RAW_DATA4_MASK   0x10U
  #define GPIO_A_RDATA_RAW_DATA5_MASK   0x20U
  #define GPIO_A_RDATA_RAW_DATA6_MASK   0x40U
  #define GPIO_A_RDATA_RAW_DATA7_MASK   0x80U
  #define GPIO_A_RDATA_RAW_DATA8_MASK   0x0100U
  #define GPIO_A_RDATA_RAW_DATA9_MASK   0x0200U
  #define GPIO_A_RDATA_RAW_DATA10_MASK  0x0400U
  #define GPIO_A_RDATA_RAW_DATA11_MASK  0x0800U
  #define GPIO_A_RDATA_RAW_DATA12_MASK  0x1000U
  #define GPIO_A_RDATA_RAW_DATA13_MASK  0x2000U
  #define GPIO_A_RDATA_RAW_DATA14_MASK  0x4000U
  #define GPIO_A_RDATA_RAW_DATA_MASK    0x7FFFU
  #define GPIO_A_RDATA_RAW_DATA_BITNUM  0x00U
  #define GPIO_A_RDATA                  *((volatile word *)0x0000F15A)


  /*** GPIO_A_DRIVE - GPIO A Drive Strength Control Register; 0x0000F15B ***/
  union {
    word Word;
  } GPIO_A_DRIVE_STR;
  
  #define GPIO_A_DRIVE_DRIVE0_MASK      0x01U
  #define GPIO_A_DRIVE_DRIVE1_MASK      0x02U
  #define GPIO_A_DRIVE_DRIVE2_MASK      0x04U
  #define GPIO_A_DRIVE_DRIVE3_MASK      0x08U
  #define GPIO_A_DRIVE_DRIVE4_MASK      0x10U
  #define GPIO_A_DRIVE_DRIVE5_MASK      0x20U
  #define GPIO_A_DRIVE_DRIVE6_MASK      0x40U
  #define GPIO_A_DRIVE_DRIVE7_MASK      0x80U
  #define GPIO_A_DRIVE_DRIVE8_MASK      0x0100U
  #define GPIO_A_DRIVE_DRIVE9_MASK      0x0200U
  #define GPIO_A_DRIVE_DRIVE10_MASK     0x0400U
  #define GPIO_A_DRIVE_DRIVE11_MASK     0x0800U
  #define GPIO_A_DRIVE_DRIVE12_MASK     0x1000U
  #define GPIO_A_DRIVE_DRIVE13_MASK     0x2000U
  #define GPIO_A_DRIVE_DRIVE14_MASK     0x4000U
  #define GPIO_A_DRIVE_DRIVE_MASK       0x7FFFU
  #define GPIO_A_DRIVE_DRIVE_BITNUM     0x00U
  #define GPIO_A_DRIVE                  *((volatile word *)0x0000F15B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} GPIOA_PRPH;

/******************************************
*** Peripheral GPIOB
*******************************************/
typedef volatile struct {
  /*** GPIO_B_PUPEN - GPIO B Pull-up Enable Register; 0x0000F160 ***/
  union {
    word Word;
  } GPIO_B_PUPEN_STR;
  
  #define GPIO_B_PUPEN_PU0_MASK         0x01U
  #define GPIO_B_PUPEN_PU1_MASK         0x02U
  #define GPIO_B_PUPEN_PU2_MASK         0x04U
  #define GPIO_B_PUPEN_PU3_MASK         0x08U
  #define GPIO_B_PUPEN_PU4_MASK         0x10U
  #define GPIO_B_PUPEN_PU5_MASK         0x20U
  #define GPIO_B_PUPEN_PU6_MASK         0x40U
  #define GPIO_B_PUPEN_PU7_MASK         0x80U
  #define GPIO_B_PUPEN_PU8_MASK         0x0100U
  #define GPIO_B_PUPEN_PU9_MASK         0x0200U
  #define GPIO_B_PUPEN_PU10_MASK        0x0400U
  #define GPIO_B_PUPEN_PU11_MASK        0x0800U
  #define GPIO_B_PUPEN_PU12_MASK        0x1000U
  #define GPIO_B_PUPEN_PU13_MASK        0x2000U
  #define GPIO_B_PUPEN_PU_MASK          0x3FFFU
  #define GPIO_B_PUPEN_PU_BITNUM        0x00U
  #define GPIO_B_PUPEN                  *((volatile word *)0x0000F160)


  /*** GPIO_B_DATA - GPIO B Data Register; 0x0000F161 ***/
  union {
    word Word;
  } GPIO_B_DATA_STR;
  
  #define GPIO_B_DATA_D0_MASK           0x01U
  #define GPIO_B_DATA_D1_MASK           0x02U
  #define GPIO_B_DATA_D2_MASK           0x04U
  #define GPIO_B_DATA_D3_MASK           0x08U
  #define GPIO_B_DATA_D4_MASK           0x10U
  #define GPIO_B_DATA_D5_MASK           0x20U
  #define GPIO_B_DATA_D6_MASK           0x40U
  #define GPIO_B_DATA_D7_MASK           0x80U
  #define GPIO_B_DATA_D8_MASK           0x0100U
  #define GPIO_B_DATA_D9_MASK           0x0200U
  #define GPIO_B_DATA_D10_MASK          0x0400U
  #define GPIO_B_DATA_D11_MASK          0x0800U
  #define GPIO_B_DATA_D12_MASK          0x1000U
  #define GPIO_B_DATA_D13_MASK          0x2000U
  #define GPIO_B_DATA_D_MASK            0x3FFFU
  #define GPIO_B_DATA_D_BITNUM          0x00U
  #define GPIO_B_DATA                   *((volatile word *)0x0000F161)


  /*** GPIO_B_DDIR - GPIO B Data Direction Register; 0x0000F162 ***/
  union {
    word Word;
  } GPIO_B_DDIR_STR;
  
  #define GPIO_B_DDIR_DD0_MASK          0x01U
  #define GPIO_B_DDIR_DD1_MASK          0x02U
  #define GPIO_B_DDIR_DD2_MASK          0x04U
  #define GPIO_B_DDIR_DD3_MASK          0x08U
  #define GPIO_B_DDIR_DD4_MASK          0x10U
  #define GPIO_B_DDIR_DD5_MASK          0x20U
  #define GPIO_B_DDIR_DD6_MASK          0x40U
  #define GPIO_B_DDIR_DD7_MASK          0x80U
  #define GPIO_B_DDIR_DD8_MASK          0x0100U
  #define GPIO_B_DDIR_DD9_MASK          0x0200U
  #define GPIO_B_DDIR_DD10_MASK         0x0400U
  #define GPIO_B_DDIR_DD11_MASK         0x0800U
  #define GPIO_B_DDIR_DD12_MASK         0x1000U
  #define GPIO_B_DDIR_DD13_MASK         0x2000U
  #define GPIO_B_DDIR_DD_MASK           0x3FFFU
  #define GPIO_B_DDIR_DD_BITNUM         0x00U
  #define GPIO_B_DDIR                   *((volatile word *)0x0000F162)


  /*** GPIO_B_PEREN - GPIO B Peripheral Enable Registers; 0x0000F163 ***/
  union {
    word Word;
  } GPIO_B_PEREN_STR;
  
  #define GPIO_B_PEREN_PE0_MASK         0x01U
  #define GPIO_B_PEREN_PE1_MASK         0x02U
  #define GPIO_B_PEREN_PE2_MASK         0x04U
  #define GPIO_B_PEREN_PE3_MASK         0x08U
  #define GPIO_B_PEREN_PE4_MASK         0x10U
  #define GPIO_B_PEREN_PE5_MASK         0x20U
  #define GPIO_B_PEREN_PE6_MASK         0x40U
  #define GPIO_B_PEREN_PE7_MASK         0x80U
  #define GPIO_B_PEREN_PE8_MASK         0x0100U
  #define GPIO_B_PEREN_PE9_MASK         0x0200U
  #define GPIO_B_PEREN_PE10_MASK        0x0400U
  #define GPIO_B_PEREN_PE11_MASK        0x0800U
  #define GPIO_B_PEREN_PE12_MASK        0x1000U
  #define GPIO_B_PEREN_PE13_MASK        0x2000U
  #define GPIO_B_PEREN_PE_MASK          0x3FFFU
  #define GPIO_B_PEREN_PE_BITNUM        0x00U
  #define GPIO_B_PEREN                  *((volatile word *)0x0000F163)


