goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** GPIO_B_IASSRT - GPIO B Interrupt Assert Register; 0x0000F164 ***/
  union {
    word Word;
  } GPIO_B_IASSRT_STR;
  
  #define GPIO_B_IASSRT_IA0_MASK        0x01U
  #define GPIO_B_IASSRT_IA1_MASK        0x02U
  #define GPIO_B_IASSRT_IA2_MASK        0x04U
  #define GPIO_B_IASSRT_IA3_MASK        0x08U
  #define GPIO_B_IASSRT_IA4_MASK        0x10U
  #define GPIO_B_IASSRT_IA5_MASK        0x20U
  #define GPIO_B_IASSRT_IA6_MASK        0x40U
  #define GPIO_B_IASSRT_IA7_MASK        0x80U
  #define GPIO_B_IASSRT_IA8_MASK        0x0100U
  #define GPIO_B_IASSRT_IA9_MASK        0x0200U
  #define GPIO_B_IASSRT_IA10_MASK       0x0400U
  #define GPIO_B_IASSRT_IA11_MASK       0x0800U
  #define GPIO_B_IASSRT_IA12_MASK       0x1000U
  #define GPIO_B_IASSRT_IA13_MASK       0x2000U
  #define GPIO_B_IASSRT_IA_MASK         0x3FFFU
  #define GPIO_B_IASSRT_IA_BITNUM       0x00U
  #define GPIO_B_IASSRT                 *((volatile word *)0x0000F164)


  /*** GPIO_B_IEN - GPIO B Interrupt Enable Register; 0x0000F165 ***/
  union {
    word Word;
  } GPIO_B_IEN_STR;
  
  #define GPIO_B_IEN_IEN0_MASK          0x01U
  #define GPIO_B_IEN_IEN1_MASK          0x02U
  #define GPIO_B_IEN_IEN2_MASK          0x04U
  #define GPIO_B_IEN_IEN3_MASK          0x08U
  #define GPIO_B_IEN_IEN4_MASK          0x10U
  #define GPIO_B_IEN_IEN5_MASK          0x20U
  #define GPIO_B_IEN_IEN6_MASK          0x40U
  #define GPIO_B_IEN_IEN7_MASK          0x80U
  #define GPIO_B_IEN_IEN8_MASK          0x0100U
  #define GPIO_B_IEN_IEN9_MASK          0x0200U
  #define GPIO_B_IEN_IEN10_MASK         0x0400U
  #define GPIO_B_IEN_IEN11_MASK         0x0800U
  #define GPIO_B_IEN_IEN12_MASK         0x1000U
  #define GPIO_B_IEN_IEN13_MASK         0x2000U
  #define GPIO_B_IEN_IEN_MASK           0x3FFFU
  #define GPIO_B_IEN_IEN_BITNUM         0x00U
  #define GPIO_B_IEN                    *((volatile word *)0x0000F165)


  /*** GPIO_B_IPOL - GPIO B Interrupt Polarity Register; 0x0000F166 ***/
  union {
    word Word;
  } GPIO_B_IPOL_STR;
  
  #define GPIO_B_IPOL_IPOL0_MASK        0x01U
  #define GPIO_B_IPOL_IPOL1_MASK        0x02U
  #define GPIO_B_IPOL_IPOL2_MASK        0x04U
  #define GPIO_B_IPOL_IPOL3_MASK        0x08U
  #define GPIO_B_IPOL_IPOL4_MASK        0x10U
  #define GPIO_B_IPOL_IPOL5_MASK        0x20U
  #define GPIO_B_IPOL_IPOL6_MASK        0x40U
  #define GPIO_B_IPOL_IPOL7_MASK        0x80U
  #define GPIO_B_IPOL_IPOL8_MASK        0x0100U
  #define GPIO_B_IPOL_IPOL9_MASK        0x0200U
  #define GPIO_B_IPOL_IPOL10_MASK       0x0400U
  #define GPIO_B_IPOL_IPOL11_MASK       0x0800U
  #define GPIO_B_IPOL_IPOL12_MASK       0x1000U
  #define GPIO_B_IPOL_IPOL13_MASK       0x2000U
  #define GPIO_B_IPOL_IPOL_MASK         0x3FFFU
  #define GPIO_B_IPOL_IPOL_BITNUM       0x00U
  #define GPIO_B_IPOL                   *((volatile word *)0x0000F166)


  /*** GPIO_B_IPEND - GPIO B Interrupt Pending Register; 0x0000F167 ***/
  union {
    word Word;
  } GPIO_B_IPEND_STR;
  
  #define GPIO_B_IPEND_IP0_MASK         0x01U
  #define GPIO_B_IPEND_IP1_MASK         0x02U
  #define GPIO_B_IPEND_IP2_MASK         0x04U
  #define GPIO_B_IPEND_IP3_MASK         0x08U
  #define GPIO_B_IPEND_IP4_MASK         0x10U
  #define GPIO_B_IPEND_IP5_MASK         0x20U
  #define GPIO_B_IPEND_IP6_MASK         0x40U
  #define GPIO_B_IPEND_IP7_MASK         0x80U
  #define GPIO_B_IPEND_IP8_MASK         0x0100U
  #define GPIO_B_IPEND_IP9_MASK         0x0200U
  #define GPIO_B_IPEND_IP10_MASK        0x0400U
  #define GPIO_B_IPEND_IP11_MASK        0x0800U
  #define GPIO_B_IPEND_IP12_MASK        0x1000U
  #define GPIO_B_IPEND_IP13_MASK        0x2000U
  #define GPIO_B_IPEND_IP_MASK          0x3FFFU
  #define GPIO_B_IPEND_IP_BITNUM        0x00U
  #define GPIO_B_IPEND                  *((volatile word *)0x0000F167)


  /*** GPIO_B_IEDGE - GPIO B Interrupt Edge Sensitive Register; 0x0000F168 ***/
  union {
    word Word;
  } GPIO_B_IEDGE_STR;
  
  #define GPIO_B_IEDGE_IES0_MASK        0x01U
  #define GPIO_B_IEDGE_IES1_MASK        0x02U
  #define GPIO_B_IEDGE_IES2_MASK        0x04U
  #define GPIO_B_IEDGE_IES3_MASK        0x08U
  #define GPIO_B_IEDGE_IES4_MASK        0x10U
  #define GPIO_B_IEDGE_IES5_MASK        0x20U
  #define GPIO_B_IEDGE_IES6_MASK        0x40U
  #define GPIO_B_IEDGE_IES7_MASK        0x80U
  #define GPIO_B_IEDGE_IES8_MASK        0x0100U
  #define GPIO_B_IEDGE_IES9_MASK        0x0200U
  #define GPIO_B_IEDGE_IES10_MASK       0x0400U
  #define GPIO_B_IEDGE_IES11_MASK       0x0800U
  #define GPIO_B_IEDGE_IES12_MASK       0x1000U
  #define GPIO_B_IEDGE_IES13_MASK       0x2000U
  #define GPIO_B_IEDGE_IES_MASK         0x3FFFU
  #define GPIO_B_IEDGE_IES_BITNUM       0x00U
  #define GPIO_B_IEDGE                  *((volatile word *)0x0000F168)


  /*** GPIO_B_PPOUTM - GPIO B Push-Pull Mode Register; 0x0000F169 ***/
  union {
    word Word;
  } GPIO_B_PPOUTM_STR;
  
  #define GPIO_B_PPOUTM_PPMODE0_MASK    0x01U
  #define GPIO_B_PPOUTM_PPMODE1_MASK    0x02U
  #define GPIO_B_PPOUTM_PPMODE2_MASK    0x04U
  #define GPIO_B_PPOUTM_PPMODE3_MASK    0x08U
  #define GPIO_B_PPOUTM_PPMODE4_MASK    0x10U
  #define GPIO_B_PPOUTM_PPMODE5_MASK    0x20U
  #define GPIO_B_PPOUTM_PPMODE6_MASK    0x40U
  #define GPIO_B_PPOUTM_PPMODE7_MASK    0x80U
  #define GPIO_B_PPOUTM_PPMODE8_MASK    0x0100U
  #define GPIO_B_PPOUTM_PPMODE9_MASK    0x0200U
  #define GPIO_B_PPOUTM_PPMODE10_MASK   0x0400U
  #define GPIO_B_PPOUTM_PPMODE11_MASK   0x0800U
  #define GPIO_B_PPOUTM_PPMODE12_MASK   0x1000U
  #define GPIO_B_PPOUTM_PPMODE13_MASK   0x2000U
  #define GPIO_B_PPOUTM_PPMODE_MASK     0x3FFFU
  #define GPIO_B_PPOUTM_PPMODE_BITNUM   0x00U
  #define GPIO_B_PPOUTM                 *((volatile word *)0x0000F169)


  /*** GPIO_B_RDATA - GPIO B Raw Data Register; 0x0000F16A ***/
  union {
    word Word;
  } GPIO_B_RDATA_STR;
  
  #define GPIO_B_RDATA_RAW_DATA0_MASK   0x01U
  #define GPIO_B_RDATA_RAW_DATA1_MASK   0x02U
  #define GPIO_B_RDATA_RAW_DATA2_MASK   0x04U
  #define GPIO_B_RDATA_RAW_DATA3_MASK   0x08U
  #define GPIO_B_RDATA_RAW_DATA4_MASK   0x10U
  #define GPIO_B_RDATA_RAW_DATA5_MASK   0x20U
  #define GPIO_B_RDATA_RAW_DATA6_MASK   0x40U
  #define GPIO_B_RDATA_RAW_DATA7_MASK   0x80U
  #define GPIO_B_RDATA_RAW_DATA8_MASK   0x0100U
  #define GPIO_B_RDATA_RAW_DATA9_MASK   0x0200U
  #define GPIO_B_RDATA_RAW_DATA10_MASK  0x0400U
  #define GPIO_B_RDATA_RAW_DATA11_MASK  0x0800U
  #define GPIO_B_RDATA_RAW_DATA12_MASK  0x1000U
  #define GPIO_B_RDATA_RAW_DATA13_MASK  0x2000U
  #define GPIO_B_RDATA_RAW_DATA_MASK    0x3FFFU
  #define GPIO_B_RDATA_RAW_DATA_BITNUM  0x00U
  #define GPIO_B_RDATA                  *((volatile word *)0x0000F16A)


  /*** GPIO_B_DRIVE - GPIO B Drive Strength Control Register; 0x0000F16B ***/
  union {
    word Word;
  } GPIO_B_DRIVE_STR;
  
  #define GPIO_B_DRIVE_DRIVE0_MASK      0x01U
  #define GPIO_B_DRIVE_DRIVE1_MASK      0x02U
  #define GPIO_B_DRIVE_DRIVE2_MASK      0x04U
  #define GPIO_B_DRIVE_DRIVE3_MASK      0x08U
  #define GPIO_B_DRIVE_DRIVE4_MASK      0x10U
  #define GPIO_B_DRIVE_DRIVE5_MASK      0x20U
  #define GPIO_B_DRIVE_DRIVE6_MASK      0x40U
  #define GPIO_B_DRIVE_DRIVE7_MASK      0x80U
  #define GPIO_B_DRIVE_DRIVE8_MASK      0x0100U
  #define GPIO_B_DRIVE_DRIVE9_MASK      0x0200U
  #define GPIO_B_DRIVE_DRIVE10_MASK     0x0400U
  #define GPIO_B_DRIVE_DRIVE11_MASK     0x0800U
  #define GPIO_B_DRIVE_DRIVE12_MASK     0x1000U
  #define GPIO_B_DRIVE_DRIVE13_MASK     0x2000U
  #define GPIO_B_DRIVE_DRIVE_MASK       0x3FFFU
  #define GPIO_B_DRIVE_DRIVE_BITNUM     0x00U
  #define GPIO_B_DRIVE                  *((volatile word *)0x0000F16B)


  word Reserved0[4];                   /* Reserved (unused) registers */

