goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
} GPIOB_PRPH;

/******************************************
*** Peripheral GPIOC
*******************************************/
typedef volatile struct {
  /*** GPIO_C_PUPEN - GPIO C Pull-up Enable Register; 0x0000F170 ***/
  union {
    word Word;
  } GPIO_C_PUPEN_STR;
  
  #define GPIO_C_PUPEN_PU0_MASK         0x01U
  #define GPIO_C_PUPEN_PU1_MASK         0x02U
  #define GPIO_C_PUPEN_PU2_MASK         0x04U
  #define GPIO_C_PUPEN_PU3_MASK         0x08U
  #define GPIO_C_PUPEN_PU4_MASK         0x10U
  #define GPIO_C_PUPEN_PU5_MASK         0x20U
  #define GPIO_C_PUPEN_PU6_MASK         0x40U
  #define GPIO_C_PUPEN_PU7_MASK         0x80U
  #define GPIO_C_PUPEN_PU8_MASK         0x0100U
  #define GPIO_C_PUPEN_PU9_MASK         0x0200U
  #define GPIO_C_PUPEN_PU10_MASK        0x0400U
  #define GPIO_C_PUPEN_PU11_MASK        0x0800U
  #define GPIO_C_PUPEN_PU12_MASK        0x1000U
  #define GPIO_C_PUPEN_PU13_MASK        0x2000U
  #define GPIO_C_PUPEN_PU14_MASK        0x4000U
  #define GPIO_C_PUPEN_PU15_MASK        0x8000U
  #define GPIO_C_PUPEN                  *((volatile word *)0x0000F170)


  /*** GPIO_C_DATA - GPIO C Data Register; 0x0000F171 ***/
  union {
    word Word;
  } GPIO_C_DATA_STR;
  
  #define GPIO_C_DATA_D0_MASK           0x01U
  #define GPIO_C_DATA_D1_MASK           0x02U
  #define GPIO_C_DATA_D2_MASK           0x04U
  #define GPIO_C_DATA_D3_MASK           0x08U
  #define GPIO_C_DATA_D4_MASK           0x10U
  #define GPIO_C_DATA_D5_MASK           0x20U
  #define GPIO_C_DATA_D6_MASK           0x40U
  #define GPIO_C_DATA_D7_MASK           0x80U
  #define GPIO_C_DATA_D8_MASK           0x0100U
  #define GPIO_C_DATA_D9_MASK           0x0200U
  #define GPIO_C_DATA_D10_MASK          0x0400U
  #define GPIO_C_DATA_D11_MASK          0x0800U
  #define GPIO_C_DATA_D12_MASK          0x1000U
  #define GPIO_C_DATA_D13_MASK          0x2000U
  #define GPIO_C_DATA_D14_MASK          0x4000U
  #define GPIO_C_DATA_D15_MASK          0x8000U
  #define GPIO_C_DATA                   *((volatile word *)0x0000F171)


  /*** GPIO_C_DDIR - GPIO C Data Direction Register; 0x0000F172 ***/
  union {
    word Word;
  } GPIO_C_DDIR_STR;
  
  #define GPIO_C_DDIR_DD0_MASK          0x01U
  #define GPIO_C_DDIR_DD1_MASK          0x02U
  #define GPIO_C_DDIR_DD2_MASK          0x04U
  #define GPIO_C_DDIR_DD3_MASK          0x08U
  #define GPIO_C_DDIR_DD4_MASK          0x10U
  #define GPIO_C_DDIR_DD5_MASK          0x20U
  #define GPIO_C_DDIR_DD6_MASK          0x40U
  #define GPIO_C_DDIR_DD7_MASK          0x80U
  #define GPIO_C_DDIR_DD8_MASK          0x0100U
  #define GPIO_C_DDIR_DD9_MASK          0x0200U
  #define GPIO_C_DDIR_DD10_MASK         0x0400U
  #define GPIO_C_DDIR_DD11_MASK         0x0800U
  #define GPIO_C_DDIR_DD12_MASK         0x1000U
  #define GPIO_C_DDIR_DD13_MASK         0x2000U
  #define GPIO_C_DDIR_DD14_MASK         0x4000U
  #define GPIO_C_DDIR_DD15_MASK         0x8000U
  #define GPIO_C_DDIR                   *((volatile word *)0x0000F172)


  /*** GPIO_C_PEREN - GPIO C Peripheral Enable Registers; 0x0000F173 ***/
  union {
    word Word;
  } GPIO_C_PEREN_STR;
  
  #define GPIO_C_PEREN_PE0_MASK         0x01U
  #define GPIO_C_PEREN_PE1_MASK         0x02U
  #define GPIO_C_PEREN_PE2_MASK         0x04U
  #define GPIO_C_PEREN_PE3_MASK         0x08U
  #define GPIO_C_PEREN_PE4_MASK         0x10U
  #define GPIO_C_PEREN_PE5_MASK         0x20U
  #define GPIO_C_PEREN_PE6_MASK         0x40U
  #define GPIO_C_PEREN_PE7_MASK         0x80U
  #define GPIO_C_PEREN_PE8_MASK         0x0100U
  #define GPIO_C_PEREN_PE9_MASK         0x0200U
  #define GPIO_C_PEREN_PE10_MASK        0x0400U
  #define GPIO_C_PEREN_PE11_MASK        0x0800U
  #define GPIO_C_PEREN_PE12_MASK        0x1000U
  #define GPIO_C_PEREN_PE13_MASK        0x2000U
  #define GPIO_C_PEREN_PE14_MASK        0x4000U
  #define GPIO_C_PEREN_PE15_MASK        0x8000U
  #define GPIO_C_PEREN                  *((volatile word *)0x0000F173)


  /*** GPIO_C_IASSRT - GPIO C Interrupt Assert Register; 0x0000F174 ***/
  union {
    word Word;
  } GPIO_C_IASSRT_STR;
  
  #define GPIO_C_IASSRT_IA0_MASK        0x01U
  #define GPIO_C_IASSRT_IA1_MASK        0x02U
  #define GPIO_C_IASSRT_IA2_MASK        0x04U
  #define GPIO_C_IASSRT_IA3_MASK        0x08U
  #define GPIO_C_IASSRT_IA4_MASK        0x10U
  #define GPIO_C_IASSRT_IA5_MASK        0x20U
  #define GPIO_C_IASSRT_IA6_MASK        0x40U
  #define GPIO_C_IASSRT_IA7_MASK        0x80U
  #define GPIO_C_IASSRT_IA8_MASK        0x0100U
  #define GPIO_C_IASSRT_IA9_MASK        0x0200U
  #define GPIO_C_IASSRT_IA10_MASK       0x0400U
  #define GPIO_C_IASSRT_IA11_MASK       0x0800U
  #define GPIO_C_IASSRT_IA12_MASK       0x1000U
  #define GPIO_C_IASSRT_IA13_MASK       0x2000U
  #define GPIO_C_IASSRT_IA14_MASK       0x4000U
  #define GPIO_C_IASSRT_IA15_MASK       0x8000U
  #define GPIO_C_IASSRT                 *((volatile word *)0x0000F174)


  /*** GPIO_C_IEN - GPIO C Interrupt Enable Register; 0x0000F175 ***/
  union {
    word Word;
  } GPIO_C_IEN_STR;
  
  #define GPIO_C_IEN_IEN0_MASK          0x01U
  #define GPIO_C_IEN_IEN1_MASK          0x02U
  #define GPIO_C_IEN_IEN2_MASK          0x04U
  #define GPIO_C_IEN_IEN3_MASK          0x08U
  #define GPIO_C_IEN_IEN4_MASK          0x10U
  #define GPIO_C_IEN_IEN5_MASK          0x20U
  #define GPIO_C_IEN_IEN6_MASK          0x40U
  #define GPIO_C_IEN_IEN7_MASK          0x80U
  #define GPIO_C_IEN_IEN8_MASK          0x0100U
  #define GPIO_C_IEN_IEN9_MASK          0x0200U
  #define GPIO_C_IEN_IEN10_MASK         0x0400U
  #define GPIO_C_IEN_IEN11_MASK         0x0800U
  #define GPIO_C_IEN_IEN12_MASK         0x1000U
  #define GPIO_C_IEN_IEN13_MASK         0x2000U
  #define GPIO_C_IEN_IEN14_MASK         0x4000U
  #define GPIO_C_IEN_IEN15_MASK         0x8000U
  #define GPIO_C_IEN                    *((volatile word *)0x0000F175)


  /*** GPIO_C_IPOL - GPIO C Interrupt Polarity Register; 0x0000F176 ***/
  union {
    word Word;
  } GPIO_C_IPOL_STR;
  
  #define GPIO_C_IPOL_IPOL0_MASK        0x01U
  #define GPIO_C_IPOL_IPOL1_MASK        0x02U
  #define GPIO_C_IPOL_IPOL2_MASK        0x04U
  #define GPIO_C_IPOL_IPOL3_MASK        0x08U
  #define GPIO_C_IPOL_IPOL4_MASK        0x10U
  #define GPIO_C_IPOL_IPOL5_MASK        0x20U
  #define GPIO_C_IPOL_IPOL6_MASK        0x40U
  #define GPIO_C_IPOL_IPOL7_MASK        0x80U
  #define GPIO_C_IPOL_IPOL8_MASK        0x0100U
  #define GPIO_C_IPOL_IPOL9_MASK        0x0200U
  #define GPIO_C_IPOL_IPOL10_MASK       0x0400U
  #define GPIO_C_IPOL_IPOL11_MASK       0x0800U
  #define GPIO_C_IPOL_IPOL12_MASK       0x1000U
  #define GPIO_C_IPOL_IPOL13_MASK       0x2000U
  #define GPIO_C_IPOL_IPOL14_MASK       0x4000U
  #define GPIO_C_IPOL_IPOL15_MASK       0x8000U
  #define GPIO_C_IPOL                   *((volatile word *)0x0000F176)


  /*** GPIO_C_IPEND - GPIO C Interrupt Pending Register; 0x0000F177 ***/
  union {
    word Word;
  } GPIO_C_IPEND_STR;
  
  #define GPIO_C_IPEND_IP0_MASK         0x01U
  #define GPIO_C_IPEND_IP1_MASK         0x02U
  #define GPIO_C_IPEND_IP2_MASK         0x04U
  #define GPIO_C_IPEND_IP3_MASK         0x08U
  #define GPIO_C_IPEND_IP4_MASK         0x10U
  #define GPIO_C_IPEND_IP5_MASK         0x20U
  #define GPIO_C_IPEND_IP6_MASK         0x40U
  #define GPIO_C_IPEND_IP7_MASK         0x80U
  #define GPIO_C_IPEND_IP8_MASK         0x0100U
  #define GPIO_C_IPEND_IP9_MASK         0x0200U
  #define GPIO_C_IPEND_IP10_MASK        0x0400U
  #define GPIO_C_IPEND_IP11_MASK        0x0800U
  #define GPIO_C_IPEND_IP12_MASK        0x1000U
  #define GPIO_C_IPEND_IP13_MASK        0x2000U
  #define GPIO_C_IPEND_IP14_MASK        0x4000U
  #define GPIO_C_IPEND_IP15_MASK        0x8000U
  #define GPIO_C_IPEND                  *((volatile word *)0x0000F177)


  /*** GPIO_C_IEDGE - GPIO C Interrupt Edge Sensitive Register; 0x0000F178 ***/
  union {
    word Word;
  } GPIO_C_IEDGE_STR;
  
