goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define GPIO_C_IEDGE_IES0_MASK        0x01U
  #define GPIO_C_IEDGE_IES1_MASK        0x02U
  #define GPIO_C_IEDGE_IES2_MASK        0x04U
  #define GPIO_C_IEDGE_IES3_MASK        0x08U
  #define GPIO_C_IEDGE_IES4_MASK        0x10U
  #define GPIO_C_IEDGE_IES5_MASK        0x20U
  #define GPIO_C_IEDGE_IES6_MASK        0x40U
  #define GPIO_C_IEDGE_IES7_MASK        0x80U
  #define GPIO_C_IEDGE_IES8_MASK        0x0100U
  #define GPIO_C_IEDGE_IES9_MASK        0x0200U
  #define GPIO_C_IEDGE_IES10_MASK       0x0400U
  #define GPIO_C_IEDGE_IES11_MASK       0x0800U
  #define GPIO_C_IEDGE_IES12_MASK       0x1000U
  #define GPIO_C_IEDGE_IES13_MASK       0x2000U
  #define GPIO_C_IEDGE_IES14_MASK       0x4000U
  #define GPIO_C_IEDGE_IES15_MASK       0x8000U
  #define GPIO_C_IEDGE                  *((volatile word *)0x0000F178)


  /*** GPIO_C_PPOUTM - GPIO C Push-Pull Mode Register; 0x0000F179 ***/
  union {
    word Word;
  } GPIO_C_PPOUTM_STR;
  
  #define GPIO_C_PPOUTM_PPMODE0_MASK    0x01U
  #define GPIO_C_PPOUTM_PPMODE1_MASK    0x02U
  #define GPIO_C_PPOUTM_PPMODE2_MASK    0x04U
  #define GPIO_C_PPOUTM_PPMODE3_MASK    0x08U
  #define GPIO_C_PPOUTM_PPMODE4_MASK    0x10U
  #define GPIO_C_PPOUTM_PPMODE5_MASK    0x20U
  #define GPIO_C_PPOUTM_PPMODE6_MASK    0x40U
  #define GPIO_C_PPOUTM_PPMODE7_MASK    0x80U
  #define GPIO_C_PPOUTM_PPMODE8_MASK    0x0100U
  #define GPIO_C_PPOUTM_PPMODE9_MASK    0x0200U
  #define GPIO_C_PPOUTM_PPMODE10_MASK   0x0400U
  #define GPIO_C_PPOUTM_PPMODE11_MASK   0x0800U
  #define GPIO_C_PPOUTM_PPMODE12_MASK   0x1000U
  #define GPIO_C_PPOUTM_PPMODE13_MASK   0x2000U
  #define GPIO_C_PPOUTM_PPMODE14_MASK   0x4000U
  #define GPIO_C_PPOUTM_PPMODE15_MASK   0x8000U
  #define GPIO_C_PPOUTM                 *((volatile word *)0x0000F179)


  /*** GPIO_C_RDATA - GPIO C Raw Data Register; 0x0000F17A ***/
  union {
    word Word;
  } GPIO_C_RDATA_STR;
  
  #define GPIO_C_RDATA_RAW_DATA0_MASK   0x01U
  #define GPIO_C_RDATA_RAW_DATA1_MASK   0x02U
  #define GPIO_C_RDATA_RAW_DATA2_MASK   0x04U
  #define GPIO_C_RDATA_RAW_DATA3_MASK   0x08U
  #define GPIO_C_RDATA_RAW_DATA4_MASK   0x10U
  #define GPIO_C_RDATA_RAW_DATA5_MASK   0x20U
  #define GPIO_C_RDATA_RAW_DATA6_MASK   0x40U
  #define GPIO_C_RDATA_RAW_DATA7_MASK   0x80U
  #define GPIO_C_RDATA_RAW_DATA8_MASK   0x0100U
  #define GPIO_C_RDATA_RAW_DATA9_MASK   0x0200U
  #define GPIO_C_RDATA_RAW_DATA10_MASK  0x0400U
  #define GPIO_C_RDATA_RAW_DATA11_MASK  0x0800U
  #define GPIO_C_RDATA_RAW_DATA12_MASK  0x1000U
  #define GPIO_C_RDATA_RAW_DATA13_MASK  0x2000U
  #define GPIO_C_RDATA_RAW_DATA14_MASK  0x4000U
  #define GPIO_C_RDATA_RAW_DATA15_MASK  0x8000U
  #define GPIO_C_RDATA                  *((volatile word *)0x0000F17A)


  /*** GPIO_C_DRIVE - GPIO C Drive Strength Control Register; 0x0000F17B ***/
  union {
    word Word;
  } GPIO_C_DRIVE_STR;
  
  #define GPIO_C_DRIVE_DRIVE0_MASK      0x01U
  #define GPIO_C_DRIVE_DRIVE1_MASK      0x02U
  #define GPIO_C_DRIVE_DRIVE2_MASK      0x04U
  #define GPIO_C_DRIVE_DRIVE3_MASK      0x08U
  #define GPIO_C_DRIVE_DRIVE4_MASK      0x10U
  #define GPIO_C_DRIVE_DRIVE5_MASK      0x20U
  #define GPIO_C_DRIVE_DRIVE6_MASK      0x40U
  #define GPIO_C_DRIVE_DRIVE7_MASK      0x80U
  #define GPIO_C_DRIVE_DRIVE8_MASK      0x0100U
  #define GPIO_C_DRIVE_DRIVE9_MASK      0x0200U
  #define GPIO_C_DRIVE_DRIVE10_MASK     0x0400U
  #define GPIO_C_DRIVE_DRIVE11_MASK     0x0800U
  #define GPIO_C_DRIVE_DRIVE12_MASK     0x1000U
  #define GPIO_C_DRIVE_DRIVE13_MASK     0x2000U
  #define GPIO_C_DRIVE_DRIVE14_MASK     0x4000U
  #define GPIO_C_DRIVE_DRIVE15_MASK     0x8000U
  #define GPIO_C_DRIVE                  *((volatile word *)0x0000F17B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} GPIOC_PRPH;

/******************************************
*** Peripheral GPIOD
*******************************************/
typedef volatile struct {
  /*** GPIO_D_PUPEN - GPIO D Pull-up Enable Register; 0x0000F180 ***/
  union {
    word Word;
  } GPIO_D_PUPEN_STR;
  
  #define GPIO_D_PUPEN_PU0_MASK         0x01U
  #define GPIO_D_PUPEN_PU1_MASK         0x02U
  #define GPIO_D_PUPEN_PU2_MASK         0x04U
  #define GPIO_D_PUPEN_PU3_MASK         0x08U
  #define GPIO_D_PUPEN_PU4_MASK         0x10U
  #define GPIO_D_PUPEN_PU5_MASK         0x20U
  #define GPIO_D_PUPEN_PU6_MASK         0x40U
  #define GPIO_D_PUPEN_PU7_MASK         0x80U
  #define GPIO_D_PUPEN_PU_MASK          0xFFU
  #define GPIO_D_PUPEN_PU_BITNUM        0x00U
  #define GPIO_D_PUPEN                  *((volatile word *)0x0000F180)


  /*** GPIO_D_DATA - GPIO D Data Register; 0x0000F181 ***/
  union {
    word Word;
  } GPIO_D_DATA_STR;
  
  #define GPIO_D_DATA_D0_MASK           0x01U
  #define GPIO_D_DATA_D1_MASK           0x02U
  #define GPIO_D_DATA_D2_MASK           0x04U
  #define GPIO_D_DATA_D3_MASK           0x08U
  #define GPIO_D_DATA_D4_MASK           0x10U
  #define GPIO_D_DATA_D5_MASK           0x20U
  #define GPIO_D_DATA_D6_MASK           0x40U
  #define GPIO_D_DATA_D7_MASK           0x80U
  #define GPIO_D_DATA_D_MASK            0xFFU
  #define GPIO_D_DATA_D_BITNUM          0x00U
  #define GPIO_D_DATA                   *((volatile word *)0x0000F181)


  /*** GPIO_D_DDIR - GPIO D Data Direction Register; 0x0000F182 ***/
  union {
    word Word;
  } GPIO_D_DDIR_STR;
  
  #define GPIO_D_DDIR_DD0_MASK          0x01U
  #define GPIO_D_DDIR_DD1_MASK          0x02U
  #define GPIO_D_DDIR_DD2_MASK          0x04U
  #define GPIO_D_DDIR_DD3_MASK          0x08U
  #define GPIO_D_DDIR_DD4_MASK          0x10U
  #define GPIO_D_DDIR_DD5_MASK          0x20U
  #define GPIO_D_DDIR_DD6_MASK          0x40U
  #define GPIO_D_DDIR_DD7_MASK          0x80U
  #define GPIO_D_DDIR_DD_MASK           0xFFU
  #define GPIO_D_DDIR_DD_BITNUM         0x00U
  #define GPIO_D_DDIR                   *((volatile word *)0x0000F182)


  /*** GPIO_D_PEREN - GPIO D Peripheral Enable Registers; 0x0000F183 ***/
  union {
    word Word;
  } GPIO_D_PEREN_STR;
  
