goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define GPIO_D_PEREN_PE0_MASK         0x01U
  #define GPIO_D_PEREN_PE1_MASK         0x02U
  #define GPIO_D_PEREN_PE2_MASK         0x04U
  #define GPIO_D_PEREN_PE3_MASK         0x08U
  #define GPIO_D_PEREN_PE4_MASK         0x10U
  #define GPIO_D_PEREN_PE5_MASK         0x20U
  #define GPIO_D_PEREN_PE6_MASK         0x40U
  #define GPIO_D_PEREN_PE7_MASK         0x80U
  #define GPIO_D_PEREN_PE_MASK          0xFFU
  #define GPIO_D_PEREN_PE_BITNUM        0x00U
  #define GPIO_D_PEREN                  *((volatile word *)0x0000F183)


  /*** GPIO_D_IASSRT - GPIO D Interrupt Assert Register; 0x0000F184 ***/
  union {
    word Word;
  } GPIO_D_IASSRT_STR;
  
  #define GPIO_D_IASSRT_IA0_MASK        0x01U
  #define GPIO_D_IASSRT_IA1_MASK        0x02U
  #define GPIO_D_IASSRT_IA2_MASK        0x04U
  #define GPIO_D_IASSRT_IA3_MASK        0x08U
  #define GPIO_D_IASSRT_IA4_MASK        0x10U
  #define GPIO_D_IASSRT_IA5_MASK        0x20U
  #define GPIO_D_IASSRT_IA6_MASK        0x40U
  #define GPIO_D_IASSRT_IA7_MASK        0x80U
  #define GPIO_D_IASSRT_IA_MASK         0xFFU
  #define GPIO_D_IASSRT_IA_BITNUM       0x00U
  #define GPIO_D_IASSRT                 *((volatile word *)0x0000F184)


  /*** GPIO_D_IEN - GPIO D Interrupt Enable Register; 0x0000F185 ***/
  union {
    word Word;
  } GPIO_D_IEN_STR;
  
  #define GPIO_D_IEN_IEN0_MASK          0x01U
  #define GPIO_D_IEN_IEN1_MASK          0x02U
  #define GPIO_D_IEN_IEN2_MASK          0x04U
  #define GPIO_D_IEN_IEN3_MASK          0x08U
  #define GPIO_D_IEN_IEN4_MASK          0x10U
  #define GPIO_D_IEN_IEN5_MASK          0x20U
  #define GPIO_D_IEN_IEN6_MASK          0x40U
  #define GPIO_D_IEN_IEN7_MASK          0x80U
  #define GPIO_D_IEN_IEN_MASK           0xFFU
  #define GPIO_D_IEN_IEN_BITNUM         0x00U
  #define GPIO_D_IEN                    *((volatile word *)0x0000F185)


  /*** GPIO_D_IPOL - GPIO D Interrupt Polarity Register; 0x0000F186 ***/
  union {
    word Word;
  } GPIO_D_IPOL_STR;
  
  #define GPIO_D_IPOL_IPOL0_MASK        0x01U
  #define GPIO_D_IPOL_IPOL1_MASK        0x02U
  #define GPIO_D_IPOL_IPOL2_MASK        0x04U
  #define GPIO_D_IPOL_IPOL3_MASK        0x08U
  #define GPIO_D_IPOL_IPOL4_MASK        0x10U
  #define GPIO_D_IPOL_IPOL5_MASK        0x20U
  #define GPIO_D_IPOL_IPOL6_MASK        0x40U
  #define GPIO_D_IPOL_IPOL7_MASK        0x80U
  #define GPIO_D_IPOL_IPOL_MASK         0xFFU
  #define GPIO_D_IPOL_IPOL_BITNUM       0x00U
  #define GPIO_D_IPOL                   *((volatile word *)0x0000F186)


  /*** GPIO_D_IPEND - GPIO D Interrupt Pending Register; 0x0000F187 ***/
  union {
    word Word;
  } GPIO_D_IPEND_STR;
  
  #define GPIO_D_IPEND_IP0_MASK         0x01U
  #define GPIO_D_IPEND_IP1_MASK         0x02U
  #define GPIO_D_IPEND_IP2_MASK         0x04U
  #define GPIO_D_IPEND_IP3_MASK         0x08U
  #define GPIO_D_IPEND_IP4_MASK         0x10U
  #define GPIO_D_IPEND_IP5_MASK         0x20U
  #define GPIO_D_IPEND_IP6_MASK         0x40U
  #define GPIO_D_IPEND_IP7_MASK         0x80U
  #define GPIO_D_IPEND_IP_MASK          0xFFU
  #define GPIO_D_IPEND_IP_BITNUM        0x00U
  #define GPIO_D_IPEND                  *((volatile word *)0x0000F187)


  /*** GPIO_D_IEDGE - GPIO D Interrupt Edge Sensitive Register; 0x0000F188 ***/
  union {
    word Word;
  } GPIO_D_IEDGE_STR;
  
  #define GPIO_D_IEDGE_IES0_MASK        0x01U
  #define GPIO_D_IEDGE_IES1_MASK        0x02U
  #define GPIO_D_IEDGE_IES2_MASK        0x04U
  #define GPIO_D_IEDGE_IES3_MASK        0x08U
  #define GPIO_D_IEDGE_IES4_MASK        0x10U
  #define GPIO_D_IEDGE_IES5_MASK        0x20U
  #define GPIO_D_IEDGE_IES6_MASK        0x40U
  #define GPIO_D_IEDGE_IES7_MASK        0x80U
  #define GPIO_D_IEDGE_IES_MASK         0xFFU
  #define GPIO_D_IEDGE_IES_BITNUM       0x00U
  #define GPIO_D_IEDGE                  *((volatile word *)0x0000F188)


  /*** GPIO_D_PPOUTM - GPIO D Push-Pull Mode Register; 0x0000F189 ***/
  union {
    word Word;
  } GPIO_D_PPOUTM_STR;
  
  #define GPIO_D_PPOUTM_PPMODE0_MASK    0x01U
  #define GPIO_D_PPOUTM_PPMODE1_MASK    0x02U
  #define GPIO_D_PPOUTM_PPMODE2_MASK    0x04U
  #define GPIO_D_PPOUTM_PPMODE3_MASK    0x08U
  #define GPIO_D_PPOUTM_PPMODE4_MASK    0x10U
  #define GPIO_D_PPOUTM_PPMODE5_MASK    0x20U
  #define GPIO_D_PPOUTM_PPMODE6_MASK    0x40U
  #define GPIO_D_PPOUTM_PPMODE7_MASK    0x80U
  #define GPIO_D_PPOUTM_PPMODE_MASK     0xFFU
  #define GPIO_D_PPOUTM_PPMODE_BITNUM   0x00U
  #define GPIO_D_PPOUTM                 *((volatile word *)0x0000F189)


  /*** GPIO_D_RDATA - GPIO D Raw Data Register; 0x0000F18A ***/
  union {
    word Word;
  } GPIO_D_RDATA_STR;
  
  #define GPIO_D_RDATA_RAW_DATA0_MASK   0x01U
  #define GPIO_D_RDATA_RAW_DATA1_MASK   0x02U
  #define GPIO_D_RDATA_RAW_DATA2_MASK   0x04U
  #define GPIO_D_RDATA_RAW_DATA3_MASK   0x08U
  #define GPIO_D_RDATA_RAW_DATA4_MASK   0x10U
  #define GPIO_D_RDATA_RAW_DATA5_MASK   0x20U
  #define GPIO_D_RDATA_RAW_DATA6_MASK   0x40U
  #define GPIO_D_RDATA_RAW_DATA7_MASK   0x80U
  #define GPIO_D_RDATA_RAW_DATA_MASK    0xFFU
  #define GPIO_D_RDATA_RAW_DATA_BITNUM  0x00U
  #define GPIO_D_RDATA                  *((volatile word *)0x0000F18A)


  /*** GPIO_D_DRIVE - GPIO D Drive Strength Control Register; 0x0000F18B ***/
  union {
    word Word;
  } GPIO_D_DRIVE_STR;
  
  #define GPIO_D_DRIVE_DRIVE0_MASK      0x01U
  #define GPIO_D_DRIVE_DRIVE1_MASK      0x02U
  #define GPIO_D_DRIVE_DRIVE2_MASK      0x04U
  #define GPIO_D_DRIVE_DRIVE3_MASK      0x08U
  #define GPIO_D_DRIVE_DRIVE4_MASK      0x10U
  #define GPIO_D_DRIVE_DRIVE5_MASK      0x20U
  #define GPIO_D_DRIVE_DRIVE6_MASK      0x40U
  #define GPIO_D_DRIVE_DRIVE7_MASK      0x80U
  #define GPIO_D_DRIVE_DRIVE_MASK       0xFFU
  #define GPIO_D_DRIVE_DRIVE_BITNUM     0x00U
  #define GPIO_D_DRIVE                  *((volatile word *)0x0000F18B)


  word Reserved0[4];                   /* Reserved (unused) registers */

} GPIOD_PRPH;

/******************************************
*** Peripheral PIT0
*******************************************/
typedef volatile struct {
  /*** PIT0_CTRL - PIT 0 Control Register; 0x0000F190 ***/
  union {
    word Word;
  } PIT0_CTRL_STR;
  
  #define PIT0_CTRL_CNT_EN_MASK         0x01U
  #define PIT0_CTRL_PRIE_MASK           0x02U
  #define PIT0_CTRL_PRF_MASK            0x04U
  #define PIT0_CTRL_PRESCALER0_MASK     0x08U
  #define PIT0_CTRL_PRESCALER1_MASK     0x10U
  #define PIT0_CTRL_PRESCALER2_MASK     0x20U
  #define PIT0_CTRL_PRESCALER3_MASK     0x40U
  #define PIT0_CTRL_SLAVE_MASK          0x8000U
  #define PIT0_CTRL_PRESCALER_MASK      0x78U
  #define PIT0_CTRL_PRESCALER_BITNUM    0x03U
  #define PIT0_CTRL                     *((volatile word *)0x0000F190)


  /*** PIT0_MOD - PIT 0 Modulo Register; 0x0000F191 ***/
  union {
    word Word;
  } PIT0_MOD_STR;
  
