goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define PIT0_MOD                      *((volatile word *)0x0000F191)


  /*** PIT0_CNTR - PIT 0 Counter Register; 0x0000F192 ***/
  union {
    word Word;
  } PIT0_CNTR_STR;
  
  #define PIT0_CNTR                     *((volatile word *)0x0000F192)


  word Reserved0[13];                  /* Reserved (unused) registers */

} PIT0_PRPH;

/******************************************
*** Peripheral PIT1
*******************************************/
typedef volatile struct {
  /*** PIT1_CTRL - PIT 1 Control Register; 0x0000F1A0 ***/
  union {
    word Word;
  } PIT1_CTRL_STR;
  
  #define PIT1_CTRL_CNT_EN_MASK         0x01U
  #define PIT1_CTRL_PRIE_MASK           0x02U
  #define PIT1_CTRL_PRF_MASK            0x04U
  #define PIT1_CTRL_PRESCALER0_MASK     0x08U
  #define PIT1_CTRL_PRESCALER1_MASK     0x10U
  #define PIT1_CTRL_PRESCALER2_MASK     0x20U
  #define PIT1_CTRL_PRESCALER3_MASK     0x40U
  #define PIT1_CTRL_SLAVE_MASK          0x8000U
  #define PIT1_CTRL_PRESCALER_MASK      0x78U
  #define PIT1_CTRL_PRESCALER_BITNUM    0x03U
  #define PIT1_CTRL                     *((volatile word *)0x0000F1A0)


  /*** PIT1_MOD - PIT 1 Modulo Register; 0x0000F1A1 ***/
  union {
    word Word;
  } PIT1_MOD_STR;
  
  #define PIT1_MOD                      *((volatile word *)0x0000F1A1)


  /*** PIT1_CNTR - PIT 1 Counter Register; 0x0000F1A2 ***/
  union {
    word Word;
  } PIT1_CNTR_STR;
  
  #define PIT1_CNTR                     *((volatile word *)0x0000F1A2)


  word Reserved0[13];                  /* Reserved (unused) registers */

} PIT1_PRPH;

/******************************************
*** Peripheral PIT2
*******************************************/
typedef volatile struct {
  /*** PIT2_CTRL - PIT 2 Control Register; 0x0000F1B0 ***/
  union {
    word Word;
  } PIT2_CTRL_STR;
  
  #define PIT2_CTRL_CNT_EN_MASK         0x01U
  #define PIT2_CTRL_PRIE_MASK           0x02U
  #define PIT2_CTRL_PRF_MASK            0x04U
  #define PIT2_CTRL_PRESCALER0_MASK     0x08U
  #define PIT2_CTRL_PRESCALER1_MASK     0x10U
  #define PIT2_CTRL_PRESCALER2_MASK     0x20U
  #define PIT2_CTRL_PRESCALER3_MASK     0x40U
  #define PIT2_CTRL_SLAVE_MASK          0x8000U
  #define PIT2_CTRL_PRESCALER_MASK      0x78U
  #define PIT2_CTRL_PRESCALER_BITNUM    0x03U
  #define PIT2_CTRL                     *((volatile word *)0x0000F1B0)


  /*** PIT2_MOD - PIT 2 Modulo Register; 0x0000F1B1 ***/
  union {
    word Word;
  } PIT2_MOD_STR;
  
  #define PIT2_MOD                      *((volatile word *)0x0000F1B1)


  /*** PIT2_CNTR - PIT 2 Counter Register; 0x0000F1B2 ***/
  union {
    word Word;
  } PIT2_CNTR_STR;
  
  #define PIT2_CNTR                     *((volatile word *)0x0000F1B2)


  word Reserved0[13];                  /* Reserved (unused) registers */

} PIT2_PRPH;

/******************************************
*** Peripheral DAC0
*******************************************/
typedef volatile struct {
  /*** DAC0_CTRL - DAC 0 Control Register; 0x0000F1C0 ***/
  union {
    word Word;
  } DAC0_CTRL_STR;
  
  #define DAC0_CTRL_PDN_MASK            0x01U
  #define DAC0_CTRL_FORMAT_MASK         0x02U
  #define DAC0_CTRL_SYNC_EN_MASK        0x04U
  #define DAC0_CTRL_AUTO_MASK           0x08U
  #define DAC0_CTRL_DOWN_MASK           0x10U
  #define DAC0_CTRL_UP_MASK             0x20U
  #define DAC0_CTRL_FILT_EN_MASK        0x1000U
  #define DAC0_CTRL_FILT_CNT0_MASK      0x2000U
  #define DAC0_CTRL_FILT_CNT1_MASK      0x4000U
  #define DAC0_CTRL_FILT_CNT2_MASK      0x8000U
  #define DAC0_CTRL_FILT_CNT_MASK       0xE000U
  #define DAC0_CTRL_FILT_CNT_BITNUM     0x0DU
  #define DAC0_CTRL                     *((volatile word *)0x0000F1C0)


  /*** DAC0_DATA - DAC 0 Buffered Data Register; 0x0000F1C1 ***/
  union {
    word Word;
  } DAC0_DATA_STR;
  
  #define DAC0_DATA_DATA0_MASK          0x01U
  #define DAC0_DATA_DATA1_MASK          0x02U
  #define DAC0_DATA_DATA2_MASK          0x04U
  #define DAC0_DATA_DATA3_MASK          0x08U
  #define DAC0_DATA_DATA4_MASK          0x10U
  #define DAC0_DATA_DATA5_MASK          0x20U
  #define DAC0_DATA_DATA6_MASK          0x40U
  #define DAC0_DATA_DATA7_MASK          0x80U
  #define DAC0_DATA_DATA8_MASK          0x0100U
  #define DAC0_DATA_DATA9_MASK          0x0200U
  #define DAC0_DATA_DATA10_MASK         0x0400U
  #define DAC0_DATA_DATA11_MASK         0x0800U
  #define DAC0_DATA_DATA12_MASK         0x1000U
  #define DAC0_DATA_DATA13_MASK         0x2000U
  #define DAC0_DATA_DATA14_MASK         0x4000U
  #define DAC0_DATA_DATA15_MASK         0x8000U
  #define DAC0_DATA                     *((volatile word *)0x0000F1C1)


  /*** DAC0_STEP - DAC 0 Step Size Register; 0x0000F1C2 ***/
  union {
    word Word;
  } DAC0_STEP_STR;
  
  #define DAC0_STEP_STEP0_MASK          0x01U
  #define DAC0_STEP_STEP1_MASK          0x02U
  #define DAC0_STEP_STEP2_MASK          0x04U
  #define DAC0_STEP_STEP3_MASK          0x08U
  #define DAC0_STEP_STEP4_MASK          0x10U
  #define DAC0_STEP_STEP5_MASK          0x20U
  #define DAC0_STEP_STEP6_MASK          0x40U
  #define DAC0_STEP_STEP7_MASK          0x80U
  #define DAC0_STEP_STEP8_MASK          0x0100U
  #define DAC0_STEP_STEP9_MASK          0x0200U
  #define DAC0_STEP_STEP10_MASK         0x0400U
  #define DAC0_STEP_STEP11_MASK         0x0800U
  #define DAC0_STEP_STEP12_MASK         0x1000U
  #define DAC0_STEP_STEP13_MASK         0x2000U
  #define DAC0_STEP_STEP14_MASK         0x4000U
  #define DAC0_STEP_STEP15_MASK         0x8000U
  #define DAC0_STEP                     *((volatile word *)0x0000F1C2)


  /*** DAC0_MINVAL - DAC 0 Minimum Value Register; 0x0000F1C3 ***/
  union {
    word Word;
  } DAC0_MINVAL_STR;
  
  #define DAC0_MINVAL_MINVAL0_MASK      0x01U
  #define DAC0_MINVAL_MINVAL1_MASK      0x02U
  #define DAC0_MINVAL_MINVAL2_MASK      0x04U
  #define DAC0_MINVAL_MINVAL3_MASK      0x08U
  #define DAC0_MINVAL_MINVAL4_MASK      0x10U
  #define DAC0_MINVAL_MINVAL5_MASK      0x20U
  #define DAC0_MINVAL_MINVAL6_MASK      0x40U
  #define DAC0_MINVAL_MINVAL7_MASK      0x80U
  #define DAC0_MINVAL_MINVAL8_MASK      0x0100U
  #define DAC0_MINVAL_MINVAL9_MASK      0x0200U
  #define DAC0_MINVAL_MINVAL10_MASK     0x0400U
  #define DAC0_MINVAL_MINVAL11_MASK     0x0800U
  #define DAC0_MINVAL_MINVAL12_MASK     0x1000U
  #define DAC0_MINVAL_MINVAL13_MASK     0x2000U
  #define DAC0_MINVAL_MINVAL14_MASK     0x4000U
  #define DAC0_MINVAL_MINVAL15_MASK     0x8000U
  #define DAC0_MINVAL                   *((volatile word *)0x0000F1C3)


