goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** DAC0_MAXVAL - DAC 0 Maximum Value Register; 0x0000F1C4 ***/
  union {
    word Word;
  } DAC0_MAXVAL_STR;
  
  #define DAC0_MAXVAL_MAXVAL0_MASK      0x01U
  #define DAC0_MAXVAL_MAXVAL1_MASK      0x02U
  #define DAC0_MAXVAL_MAXVAL2_MASK      0x04U
  #define DAC0_MAXVAL_MAXVAL3_MASK      0x08U
  #define DAC0_MAXVAL_MAXVAL4_MASK      0x10U
  #define DAC0_MAXVAL_MAXVAL5_MASK      0x20U
  #define DAC0_MAXVAL_MAXVAL6_MASK      0x40U
  #define DAC0_MAXVAL_MAXVAL7_MASK      0x80U
  #define DAC0_MAXVAL_MAXVAL8_MASK      0x0100U
  #define DAC0_MAXVAL_MAXVAL9_MASK      0x0200U
  #define DAC0_MAXVAL_MAXVAL10_MASK     0x0400U
  #define DAC0_MAXVAL_MAXVAL11_MASK     0x0800U
  #define DAC0_MAXVAL_MAXVAL12_MASK     0x1000U
  #define DAC0_MAXVAL_MAXVAL13_MASK     0x2000U
  #define DAC0_MAXVAL_MAXVAL14_MASK     0x4000U
  #define DAC0_MAXVAL_MAXVAL15_MASK     0x8000U
  #define DAC0_MAXVAL                   *((volatile word *)0x0000F1C4)


  word Reserved0[11];                  /* Reserved (unused) registers */

} DAC0_PRPH;

/******************************************
*** Peripheral DAC1
*******************************************/
typedef volatile struct {
  /*** DAC1_CTRL - DAC 1 Control Register; 0x0000F1D0 ***/
  union {
    word Word;
  } DAC1_CTRL_STR;
  
  #define DAC1_CTRL_PDN_MASK            0x01U
  #define DAC1_CTRL_FORMAT_MASK         0x02U
  #define DAC1_CTRL_SYNC_EN_MASK        0x04U
  #define DAC1_CTRL_AUTO_MASK           0x08U
  #define DAC1_CTRL_DOWN_MASK           0x10U
  #define DAC1_CTRL_UP_MASK             0x20U
  #define DAC1_CTRL_FILT_EN_MASK        0x1000U
  #define DAC1_CTRL_FILT_CNT0_MASK      0x2000U
  #define DAC1_CTRL_FILT_CNT1_MASK      0x4000U
  #define DAC1_CTRL_FILT_CNT2_MASK      0x8000U
  #define DAC1_CTRL_FILT_CNT_MASK       0xE000U
  #define DAC1_CTRL_FILT_CNT_BITNUM     0x0DU
  #define DAC1_CTRL                     *((volatile word *)0x0000F1D0)


  /*** DAC1_DATA - DAC 1 Buffered Data Register; 0x0000F1D1 ***/
  union {
    word Word;
  } DAC1_DATA_STR;
  
  #define DAC1_DATA_DATA0_MASK          0x01U
  #define DAC1_DATA_DATA1_MASK          0x02U
  #define DAC1_DATA_DATA2_MASK          0x04U
  #define DAC1_DATA_DATA3_MASK          0x08U
  #define DAC1_DATA_DATA4_MASK          0x10U
  #define DAC1_DATA_DATA5_MASK          0x20U
  #define DAC1_DATA_DATA6_MASK          0x40U
  #define DAC1_DATA_DATA7_MASK          0x80U
  #define DAC1_DATA_DATA8_MASK          0x0100U
  #define DAC1_DATA_DATA9_MASK          0x0200U
  #define DAC1_DATA_DATA10_MASK         0x0400U
  #define DAC1_DATA_DATA11_MASK         0x0800U
  #define DAC1_DATA_DATA12_MASK         0x1000U
  #define DAC1_DATA_DATA13_MASK         0x2000U
  #define DAC1_DATA_DATA14_MASK         0x4000U
  #define DAC1_DATA_DATA15_MASK         0x8000U
  #define DAC1_DATA                     *((volatile word *)0x0000F1D1)


  /*** DAC1_STEP - DAC 1 Step Size Register; 0x0000F1D2 ***/
  union {
    word Word;
  } DAC1_STEP_STR;
  
  #define DAC1_STEP_STEP0_MASK          0x01U
  #define DAC1_STEP_STEP1_MASK          0x02U
  #define DAC1_STEP_STEP2_MASK          0x04U
  #define DAC1_STEP_STEP3_MASK          0x08U
  #define DAC1_STEP_STEP4_MASK          0x10U
  #define DAC1_STEP_STEP5_MASK          0x20U
  #define DAC1_STEP_STEP6_MASK          0x40U
  #define DAC1_STEP_STEP7_MASK          0x80U
  #define DAC1_STEP_STEP8_MASK          0x0100U
  #define DAC1_STEP_STEP9_MASK          0x0200U
  #define DAC1_STEP_STEP10_MASK         0x0400U
  #define DAC1_STEP_STEP11_MASK         0x0800U
  #define DAC1_STEP_STEP12_MASK         0x1000U
  #define DAC1_STEP_STEP13_MASK         0x2000U
  #define DAC1_STEP_STEP14_MASK         0x4000U
  #define DAC1_STEP_STEP15_MASK         0x8000U
  #define DAC1_STEP                     *((volatile word *)0x0000F1D2)


  /*** DAC1_MINVAL - DAC 1 Minimum Value Register; 0x0000F1D3 ***/
  union {
    word Word;
  } DAC1_MINVAL_STR;
  
  #define DAC1_MINVAL_MINVAL0_MASK      0x01U
  #define DAC1_MINVAL_MINVAL1_MASK      0x02U
  #define DAC1_MINVAL_MINVAL2_MASK      0x04U
  #define DAC1_MINVAL_MINVAL3_MASK      0x08U
  #define DAC1_MINVAL_MINVAL4_MASK      0x10U
  #define DAC1_MINVAL_MINVAL5_MASK      0x20U
  #define DAC1_MINVAL_MINVAL6_MASK      0x40U
  #define DAC1_MINVAL_MINVAL7_MASK      0x80U
  #define DAC1_MINVAL_MINVAL8_MASK      0x0100U
  #define DAC1_MINVAL_MINVAL9_MASK      0x0200U
  #define DAC1_MINVAL_MINVAL10_MASK     0x0400U
  #define DAC1_MINVAL_MINVAL11_MASK     0x0800U
  #define DAC1_MINVAL_MINVAL12_MASK     0x1000U
  #define DAC1_MINVAL_MINVAL13_MASK     0x2000U
  #define DAC1_MINVAL_MINVAL14_MASK     0x4000U
  #define DAC1_MINVAL_MINVAL15_MASK     0x8000U
  #define DAC1_MINVAL                   *((volatile word *)0x0000F1D3)


  /*** DAC1_MAXVAL - DAC 1 Maximum Value Register; 0x0000F1D4 ***/
  union {
    word Word;
  } DAC1_MAXVAL_STR;
  
  #define DAC1_MAXVAL_MAXVAL0_MASK      0x01U
  #define DAC1_MAXVAL_MAXVAL1_MASK      0x02U
  #define DAC1_MAXVAL_MAXVAL2_MASK      0x04U
  #define DAC1_MAXVAL_MAXVAL3_MASK      0x08U
  #define DAC1_MAXVAL_MAXVAL4_MASK      0x10U
  #define DAC1_MAXVAL_MAXVAL5_MASK      0x20U
  #define DAC1_MAXVAL_MAXVAL6_MASK      0x40U
  #define DAC1_MAXVAL_MAXVAL7_MASK      0x80U
  #define DAC1_MAXVAL_MAXVAL8_MASK      0x0100U
  #define DAC1_MAXVAL_MAXVAL9_MASK      0x0200U
  #define DAC1_MAXVAL_MAXVAL10_MASK     0x0400U
  #define DAC1_MAXVAL_MAXVAL11_MASK     0x0800U
  #define DAC1_MAXVAL_MAXVAL12_MASK     0x1000U
  #define DAC1_MAXVAL_MAXVAL13_MASK     0x2000U
  #define DAC1_MAXVAL_MAXVAL14_MASK     0x4000U
  #define DAC1_MAXVAL_MAXVAL15_MASK     0x8000U
  #define DAC1_MAXVAL                   *((volatile word *)0x0000F1D4)


  word Reserved0[11];                  /* Reserved (unused) registers */

} DAC1_PRPH;

/******************************************
*** Peripheral CMPA
*******************************************/
typedef volatile struct {
  /*** CMPA_CTRL - CMPA Control Register; 0x0000F1E0 ***/
  union {
    word Word;
  } CMPA_CTRL_STR;
  
