goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define CMPA_CTRL_PDN_MASK            0x01U
  #define CMPA_CTRL_INV_MASK            0x02U
  #define CMPA_CTRL_PSEL0_MASK          0x04U
  #define CMPA_CTRL_PSEL1_MASK          0x08U
  #define CMPA_CTRL_PSEL2_MASK          0x10U
  #define CMPA_CTRL_NSEL0_MASK          0x40U
  #define CMPA_CTRL_NSEL1_MASK          0x80U
  #define CMPA_CTRL_NSEL2_MASK          0x0100U
  #define CMPA_CTRL_ESEL0_MASK          0x0400U
  #define CMPA_CTRL_ESEL1_MASK          0x0800U
  #define CMPA_CTRL_FCIE_MASK           0x4000U
  #define CMPA_CTRL_RCIE_MASK           0x8000U
  #define CMPA_CTRL_PSEL_MASK           0x1CU
  #define CMPA_CTRL_PSEL_BITNUM         0x02U
  #define CMPA_CTRL_NSEL_MASK           0x01C0U
  #define CMPA_CTRL_NSEL_BITNUM         0x06U
  #define CMPA_CTRL_ESEL_MASK           0x0C00U
  #define CMPA_CTRL_ESEL_BITNUM         0x0AU
  #define CMPA_CTRL                     *((volatile word *)0x0000F1E0)


  /*** CMPA_STAT - CMPA Status Register; 0x0000F1E1 ***/
  union {
    word Word;
  } CMPA_STAT_STR;
  
  #define CMPA_STAT_COUT_MASK           0x01U
  #define CMPA_STAT_FC_MASK             0x4000U
  #define CMPA_STAT_RC_MASK             0x8000U
  #define CMPA_STAT                     *((volatile word *)0x0000F1E1)


  /*** CMPA_FILT - CMPA Filter Register; 0x0000F1E2 ***/
  union {
    word Word;
  } CMPA_FILT_STR;
  
  #define CMPA_FILT_FILT_PER0_MASK      0x01U
  #define CMPA_FILT_FILT_PER1_MASK      0x02U
  #define CMPA_FILT_FILT_PER2_MASK      0x04U
  #define CMPA_FILT_FILT_PER3_MASK      0x08U
  #define CMPA_FILT_FILT_PER4_MASK      0x10U
  #define CMPA_FILT_FILT_PER5_MASK      0x20U
  #define CMPA_FILT_FILT_PER6_MASK      0x40U
  #define CMPA_FILT_FILT_PER7_MASK      0x80U
  #define CMPA_FILT_FILT_CNT0_MASK      0x0100U
  #define CMPA_FILT_FILT_CNT1_MASK      0x0200U
  #define CMPA_FILT_FILT_CNT2_MASK      0x0400U
  #define CMPA_FILT_FILT_PER_MASK       0xFFU
  #define CMPA_FILT_FILT_PER_BITNUM     0x00U
  #define CMPA_FILT_FILT_CNT_MASK       0x0700U
  #define CMPA_FILT_FILT_CNT_BITNUM     0x08U
  #define CMPA_FILT                     *((volatile word *)0x0000F1E2)


  word Reserved0[13];                  /* Reserved (unused) registers */

} CMPA_PRPH;

/******************************************
*** Peripheral CMPB
*******************************************/
typedef volatile struct {
  /*** CMPB_CTRL - CMPB Control Register; 0x0000F1F0 ***/
  union {
    word Word;
  } CMPB_CTRL_STR;
  
  #define CMPB_CTRL_PDN_MASK            0x01U
  #define CMPB_CTRL_INV_MASK            0x02U
  #define CMPB_CTRL_PSEL0_MASK          0x04U
  #define CMPB_CTRL_PSEL1_MASK          0x08U
  #define CMPB_CTRL_PSEL2_MASK          0x10U
  #define CMPB_CTRL_NSEL0_MASK          0x40U
  #define CMPB_CTRL_NSEL1_MASK          0x80U
  #define CMPB_CTRL_NSEL2_MASK          0x0100U
  #define CMPB_CTRL_ESEL0_MASK          0x0400U
  #define CMPB_CTRL_ESEL1_MASK          0x0800U
  #define CMPB_CTRL_FCIE_MASK           0x4000U
  #define CMPB_CTRL_RCIE_MASK           0x8000U
  #define CMPB_CTRL_PSEL_MASK           0x1CU
  #define CMPB_CTRL_PSEL_BITNUM         0x02U
  #define CMPB_CTRL_NSEL_MASK           0x01C0U
  #define CMPB_CTRL_NSEL_BITNUM         0x06U
  #define CMPB_CTRL_ESEL_MASK           0x0C00U
  #define CMPB_CTRL_ESEL_BITNUM         0x0AU
  #define CMPB_CTRL                     *((volatile word *)0x0000F1F0)


  /*** CMPB_STAT - CMPB Status Register; 0x0000F1F1 ***/
  union {
    word Word;
  } CMPB_STAT_STR;
  
  #define CMPB_STAT_COUT_MASK           0x01U
  #define CMPB_STAT_FC_MASK             0x4000U
  #define CMPB_STAT_RC_MASK             0x8000U
  #define CMPB_STAT                     *((volatile word *)0x0000F1F1)


  /*** CMPB_FILT - CMPB Filter Register; 0x0000F1F2 ***/
  union {
    word Word;
  } CMPB_FILT_STR;
  
  #define CMPB_FILT_FILT_PER0_MASK      0x01U
  #define CMPB_FILT_FILT_PER1_MASK      0x02U
  #define CMPB_FILT_FILT_PER2_MASK      0x04U
  #define CMPB_FILT_FILT_PER3_MASK      0x08U
  #define CMPB_FILT_FILT_PER4_MASK      0x10U
  #define CMPB_FILT_FILT_PER5_MASK      0x20U
  #define CMPB_FILT_FILT_PER6_MASK      0x40U
  #define CMPB_FILT_FILT_PER7_MASK      0x80U
  #define CMPB_FILT_FILT_CNT0_MASK      0x0100U
  #define CMPB_FILT_FILT_CNT1_MASK      0x0200U
  #define CMPB_FILT_FILT_CNT2_MASK      0x0400U
  #define CMPB_FILT_FILT_PER_MASK       0xFFU
  #define CMPB_FILT_FILT_PER_BITNUM     0x00U
  #define CMPB_FILT_FILT_CNT_MASK       0x0700U
  #define CMPB_FILT_FILT_CNT_BITNUM     0x08U
  #define CMPB_FILT                     *((volatile word *)0x0000F1F2)


  word Reserved0[13];                  /* Reserved (unused) registers */

} CMPB_PRPH;

/******************************************
*** Peripheral QSCI0
*******************************************/
typedef volatile struct {
  /*** QSCI0_RATE - QSCI 0 Baud Rate Register; 0x0000F200 ***/
  union {
    word Word;
  } QSCI0_RATE_STR;
  
  #define QSCI0_RATE_FRAC_SBR0_MASK     0x01U
  #define QSCI0_RATE_FRAC_SBR1_MASK     0x02U
  #define QSCI0_RATE_FRAC_SBR2_MASK     0x04U
  #define QSCI0_RATE_SBR0_MASK          0x08U
  #define QSCI0_RATE_SBR1_MASK          0x10U
  #define QSCI0_RATE_SBR2_MASK          0x20U
  #define QSCI0_RATE_SBR3_MASK          0x40U
  #define QSCI0_RATE_SBR4_MASK          0x80U
  #define QSCI0_RATE_SBR5_MASK          0x0100U
  #define QSCI0_RATE_SBR6_MASK          0x0200U
  #define QSCI0_RATE_SBR7_MASK          0x0400U
  #define QSCI0_RATE_SBR8_MASK          0x0800U
  #define QSCI0_RATE_SBR9_MASK          0x1000U
  #define QSCI0_RATE_SBR10_MASK         0x2000U
  #define QSCI0_RATE_SBR11_MASK         0x4000U
  #define QSCI0_RATE_SBR12_MASK         0x8000U
  #define QSCI0_RATE_FRAC_SBR_MASK      0x07U
  #define QSCI0_RATE_FRAC_SBR_BITNUM    0x00U
  #define QSCI0_RATE_SBR_MASK           0xFFF8U
  #define QSCI0_RATE_SBR_BITNUM         0x03U
  #define QSCI0_RATE                    *((volatile word *)0x0000F200)


  /*** QSCI0_CTRL1 - QSCI 0 Control Register; 0x0000F201 ***/
  union {
    word Word;
  } QSCI0_CTRL1_STR;
  
