goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
} QSCI1_PRPH;

/******************************************
*** Peripheral QSPI0
*******************************************/
typedef volatile struct {
  /*** QSPI0_SCTRL - QSPI 0 Status and Control Register; 0x0000F220 ***/
  union {
    word Word;
  } QSPI0_SCTRL_STR;
  
  #define QSPI0_SCTRL_SPTE_MASK         0x01U
  #define QSPI0_SCTRL_MODF_MASK         0x02U
  #define QSPI0_SCTRL_OVRF_MASK         0x04U
  #define QSPI0_SCTRL_SPRF_MASK         0x08U
  #define QSPI0_SCTRL_SPTIE_MASK        0x10U
  #define QSPI0_SCTRL_SPE_MASK          0x20U
  #define QSPI0_SCTRL_CPHA_MASK         0x40U
  #define QSPI0_SCTRL_CPOL_MASK         0x80U
  #define QSPI0_SCTRL_SPMSTR_MASK       0x0100U
  #define QSPI0_SCTRL_SPRIE_MASK        0x0200U
  #define QSPI0_SCTRL_MODFEN_MASK       0x0400U
  #define QSPI0_SCTRL_ERRIE_MASK        0x0800U
  #define QSPI0_SCTRL_DSO_MASK          0x1000U
  #define QSPI0_SCTRL_SPR0_MASK         0x2000U
  #define QSPI0_SCTRL_SPR1_MASK         0x4000U
  #define QSPI0_SCTRL_SPR2_MASK         0x8000U
  #define QSPI0_SCTRL_SPR_MASK          0xE000U
  #define QSPI0_SCTRL_SPR_BITNUM        0x0DU
  #define QSPI0_SCTRL                   *((volatile word *)0x0000F220)


  /*** QSPI0_DSCTRL - QSPI 0 Data Size and Control Register; 0x0000F221 ***/
  union {
    word Word;
  } QSPI0_DSCTRL_STR;
  
  #define QSPI0_DSCTRL_DS0_MASK         0x01U
  #define QSPI0_DSCTRL_DS1_MASK         0x02U
  #define QSPI0_DSCTRL_DS2_MASK         0x04U
  #define QSPI0_DSCTRL_DS3_MASK         0x08U
  #define QSPI0_DSCTRL_SS_OVER_MASK     0x20U
  #define QSPI0_DSCTRL_SS_STRB_MASK     0x40U
  #define QSPI0_DSCTRL_SS_DDR_MASK      0x80U
  #define QSPI0_DSCTRL_SS_AUTO_MASK     0x0100U
  #define QSPI0_DSCTRL_SS_ODM_MASK      0x0200U
  #define QSPI0_DSCTRL_SS_DATA_MASK     0x0400U
  #define QSPI0_DSCTRL_SS_IN_MASK       0x0800U
  #define QSPI0_DSCTRL_BD2X_MASK        0x1000U
  #define QSPI0_DSCTRL_WOM_MASK         0x8000U
  #define QSPI0_DSCTRL_DS_MASK          0x0FU
  #define QSPI0_DSCTRL_DS_BITNUM        0x00U
  #define QSPI0_DSCTRL                  *((volatile word *)0x0000F221)


  /*** QSPI0_DRCV - QSPI 0 Data Receive Register; 0x0000F222 ***/
  union {
    word Word;
  } QSPI0_DRCV_STR;
  
  #define QSPI0_DRCV                    *((volatile word *)0x0000F222)


  /*** QSPI0_DXMIT - QSPI 0 Data Transmit Register; 0x0000F223 ***/
  union {
    word Word;
  } QSPI0_DXMIT_STR;
  
  #define QSPI0_DXMIT                   *((volatile word *)0x0000F223)


  /*** QSPI0_FIFO - QSPI 0 FIFO Control Register; 0x0000F224 ***/
  union {
    word Word;
  } QSPI0_FIFO_STR;
  
  #define QSPI0_FIFO_FIFO_ENA_MASK      0x01U
  #define QSPI0_FIFO_RFWM0_MASK         0x04U
  #define QSPI0_FIFO_RFWM1_MASK         0x08U
  #define QSPI0_FIFO_TFWM0_MASK         0x20U
  #define QSPI0_FIFO_TFWM1_MASK         0x40U
  #define QSPI0_FIFO_RFCNT0_MASK        0x0100U
  #define QSPI0_FIFO_RFCNT1_MASK        0x0200U
  #define QSPI0_FIFO_RFCNT2_MASK        0x0400U
  #define QSPI0_FIFO_TFCNT0_MASK        0x1000U
  #define QSPI0_FIFO_TFCNT1_MASK        0x2000U
  #define QSPI0_FIFO_TFCNT2_MASK        0x4000U
  #define QSPI0_FIFO_RFWM_MASK          0x0CU
  #define QSPI0_FIFO_RFWM_BITNUM        0x02U
  #define QSPI0_FIFO_TFWM_MASK          0x60U
  #define QSPI0_FIFO_TFWM_BITNUM        0x05U
  #define QSPI0_FIFO_RFCNT_MASK         0x0700U
  #define QSPI0_FIFO_RFCNT_BITNUM       0x08U
  #define QSPI0_FIFO_TFCNT_MASK         0x7000U
  #define QSPI0_FIFO_TFCNT_BITNUM       0x0CU
  #define QSPI0_FIFO                    *((volatile word *)0x0000F224)


  /*** QSPI0_DELAY - QSPI 0 Word Delay Register; 0x0000F225 ***/
  union {
    word Word;
  } QSPI0_DELAY_STR;
  
  #define QSPI0_DELAY_WAIT0_MASK        0x01U
  #define QSPI0_DELAY_WAIT1_MASK        0x02U
  #define QSPI0_DELAY_WAIT2_MASK        0x04U
  #define QSPI0_DELAY_WAIT3_MASK        0x08U
  #define QSPI0_DELAY_WAIT4_MASK        0x10U
  #define QSPI0_DELAY_WAIT5_MASK        0x20U
  #define QSPI0_DELAY_WAIT6_MASK        0x40U
  #define QSPI0_DELAY_WAIT7_MASK        0x80U
  #define QSPI0_DELAY_WAIT8_MASK        0x0100U
  #define QSPI0_DELAY_WAIT9_MASK        0x0200U
  #define QSPI0_DELAY_WAIT10_MASK       0x0400U
  #define QSPI0_DELAY_WAIT11_MASK       0x0800U
  #define QSPI0_DELAY_WAIT12_MASK       0x1000U
  #define QSPI0_DELAY_WAIT_MASK         0x1FFFU
  #define QSPI0_DELAY_WAIT_BITNUM       0x00U
  #define QSPI0_DELAY                   *((volatile word *)0x0000F225)


  word Reserved0[10];                  /* Reserved (unused) registers */

} QSPI0_PRPH;

/******************************************
*** Peripheral QSPI1
*******************************************/
typedef volatile struct {
  /*** QSPI1_SCTRL - QSPI 1 Status and Control Register; 0x0000F230 ***/
  union {
    word Word;
  } QSPI1_SCTRL_STR;
  
  #define QSPI1_SCTRL_SPTE_MASK         0x01U
  #define QSPI1_SCTRL_MODF_MASK         0x02U
  #define QSPI1_SCTRL_OVRF_MASK         0x04U
  #define QSPI1_SCTRL_SPRF_MASK         0x08U
  #define QSPI1_SCTRL_SPTIE_MASK        0x10U
  #define QSPI1_SCTRL_SPE_MASK          0x20U
  #define QSPI1_SCTRL_CPHA_MASK         0x40U
  #define QSPI1_SCTRL_CPOL_MASK         0x80U
  #define QSPI1_SCTRL_SPMSTR_MASK       0x0100U
  #define QSPI1_SCTRL_SPRIE_MASK        0x0200U
  #define QSPI1_SCTRL_MODFEN_MASK       0x0400U
  #define QSPI1_SCTRL_ERRIE_MASK        0x0800U
  #define QSPI1_SCTRL_DSO_MASK          0x1000U
  #define QSPI1_SCTRL_SPR0_MASK         0x2000U
  #define QSPI1_SCTRL_SPR1_MASK         0x4000U
  #define QSPI1_SCTRL_SPR2_MASK         0x8000U
  #define QSPI1_SCTRL_SPR_MASK          0xE000U
  #define QSPI1_SCTRL_SPR_BITNUM        0x0DU
  #define QSPI1_SCTRL                   *((volatile word *)0x0000F230)


  /*** QSPI1_DSCTRL - QSPI 1 Data Size and Control Register; 0x0000F231 ***/
  union {
    word Word;
  } QSPI1_DSCTRL_STR;
  
  #define QSPI1_DSCTRL_DS0_MASK         0x01U
  #define QSPI1_DSCTRL_DS1_MASK         0x02U
  #define QSPI1_DSCTRL_DS2_MASK         0x04U
  #define QSPI1_DSCTRL_DS3_MASK         0x08U
  #define QSPI1_DSCTRL_SS_OVER_MASK     0x20U
  #define QSPI1_DSCTRL_SS_STRB_MASK     0x40U
  #define QSPI1_DSCTRL_SS_DDR_MASK      0x80U
  #define QSPI1_DSCTRL_SS_AUTO_MASK     0x0100U
  #define QSPI1_DSCTRL_SS_ODM_MASK      0x0200U
  #define QSPI1_DSCTRL_SS_DATA_MASK     0x0400U
  #define QSPI1_DSCTRL_SS_IN_MASK       0x0800U
  #define QSPI1_DSCTRL_BD2X_MASK        0x1000U
  #define QSPI1_DSCTRL_WOM_MASK         0x8000U
  #define QSPI1_DSCTRL_DS_MASK          0x0FU
  #define QSPI1_DSCTRL_DS_BITNUM        0x00U
  #define QSPI1_DSCTRL                  *((volatile word *)0x0000F231)


