goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** QSPI1_DRCV - QSPI 1 Data Receive Register; 0x0000F232 ***/
  union {
    word Word;
  } QSPI1_DRCV_STR;
  
  #define QSPI1_DRCV                    *((volatile word *)0x0000F232)


  /*** QSPI1_DXMIT - QSPI 1 Data Transmit Register; 0x0000F233 ***/
  union {
    word Word;
  } QSPI1_DXMIT_STR;
  
  #define QSPI1_DXMIT                   *((volatile word *)0x0000F233)


  /*** QSPI1_FIFO - QSPI 1 FIFO Control Register; 0x0000F234 ***/
  union {
    word Word;
  } QSPI1_FIFO_STR;
  
  #define QSPI1_FIFO_FIFO_ENA_MASK      0x01U
  #define QSPI1_FIFO_RFWM0_MASK         0x04U
  #define QSPI1_FIFO_RFWM1_MASK         0x08U
  #define QSPI1_FIFO_TFWM0_MASK         0x20U
  #define QSPI1_FIFO_TFWM1_MASK         0x40U
  #define QSPI1_FIFO_RFCNT0_MASK        0x0100U
  #define QSPI1_FIFO_RFCNT1_MASK        0x0200U
  #define QSPI1_FIFO_RFCNT2_MASK        0x0400U
  #define QSPI1_FIFO_TFCNT0_MASK        0x1000U
  #define QSPI1_FIFO_TFCNT1_MASK        0x2000U
  #define QSPI1_FIFO_TFCNT2_MASK        0x4000U
  #define QSPI1_FIFO_RFWM_MASK          0x0CU
  #define QSPI1_FIFO_RFWM_BITNUM        0x02U
  #define QSPI1_FIFO_TFWM_MASK          0x60U
  #define QSPI1_FIFO_TFWM_BITNUM        0x05U
  #define QSPI1_FIFO_RFCNT_MASK         0x0700U
  #define QSPI1_FIFO_RFCNT_BITNUM       0x08U
  #define QSPI1_FIFO_TFCNT_MASK         0x7000U
  #define QSPI1_FIFO_TFCNT_BITNUM       0x0CU
  #define QSPI1_FIFO                    *((volatile word *)0x0000F234)


  /*** QSPI1_DELAY - QSPI 1 Word Delay Register; 0x0000F235 ***/
  union {
    word Word;
  } QSPI1_DELAY_STR;
  
  #define QSPI1_DELAY_WAIT0_MASK        0x01U
  #define QSPI1_DELAY_WAIT1_MASK        0x02U
  #define QSPI1_DELAY_WAIT2_MASK        0x04U
  #define QSPI1_DELAY_WAIT3_MASK        0x08U
  #define QSPI1_DELAY_WAIT4_MASK        0x10U
  #define QSPI1_DELAY_WAIT5_MASK        0x20U
  #define QSPI1_DELAY_WAIT6_MASK        0x40U
  #define QSPI1_DELAY_WAIT7_MASK        0x80U
  #define QSPI1_DELAY_WAIT8_MASK        0x0100U
  #define QSPI1_DELAY_WAIT9_MASK        0x0200U
  #define QSPI1_DELAY_WAIT10_MASK       0x0400U
  #define QSPI1_DELAY_WAIT11_MASK       0x0800U
  #define QSPI1_DELAY_WAIT12_MASK       0x1000U
  #define QSPI1_DELAY_WAIT_MASK         0x1FFFU
  #define QSPI1_DELAY_WAIT_BITNUM       0x00U
  #define QSPI1_DELAY                   *((volatile word *)0x0000F235)


  word Reserved0[74];                  /* Reserved (unused) registers */

} QSPI1_PRPH;

/******************************************
*** Peripheral I2C
*******************************************/
typedef volatile struct {
  /*** I2C_CTRL - I2C Control Register; 0x0000F280 ***/
  union {
    word Word;
  } I2C_CTRL_STR;
  
  #define I2C_CTRL_MSTEN_MASK           0x01U
  #define I2C_CTRL_SPD0_MASK            0x02U
  #define I2C_CTRL_SPD1_MASK            0x04U
  #define I2C_CTRL_ADDRSLV_MASK         0x08U
  #define I2C_CTRL_ADDRMST_MASK         0x10U
  #define I2C_CTRL_RSTEN_MASK           0x20U
  #define I2C_CTRL_SLVDIS_MASK          0x40U
  #define I2C_CTRL_SPD_MASK             0x06U
  #define I2C_CTRL_SPD_BITNUM           0x01U
  #define I2C_CTRL                      *((volatile word *)0x0000F280)


  word Reserved0[1];                   /* Reserved (unused) registers */
  
  /*** I2C_TAR - I2C Target Address Register; 0x0000F282 ***/
  union {
    word Word;
  } I2C_TAR_STR;
  
  #define I2C_TAR_TA0_MASK              0x01U
  #define I2C_TAR_TA1_MASK              0x02U
  #define I2C_TAR_TA2_MASK              0x04U
  #define I2C_TAR_TA3_MASK              0x08U
  #define I2C_TAR_TA4_MASK              0x10U
  #define I2C_TAR_TA5_MASK              0x20U
  #define I2C_TAR_TA6_MASK              0x40U
  #define I2C_TAR_TA7_MASK              0x80U
  #define I2C_TAR_TA8_MASK              0x0100U
  #define I2C_TAR_TA9_MASK              0x0200U
  #define I2C_TAR_GCSTRT_MASK           0x0400U
  #define I2C_TAR_SPCL_MASK             0x0800U
  #define I2C_TAR_ADDRMST_MASK          0x1000U
  #define I2C_TAR_TA_MASK               0x03FFU
  #define I2C_TAR_TA_BITNUM             0x00U
  #define I2C_TAR                       *((volatile word *)0x0000F282)


  word Reserved1[1];                   /* Reserved (unused) registers */
  
  /*** I2C_SAR - I2C Slave Address Register; 0x0000F284 ***/
  union {
    word Word;
  } I2C_SAR_STR;
  
  #define I2C_SAR_SA0_MASK              0x01U
  #define I2C_SAR_SA1_MASK              0x02U
  #define I2C_SAR_SA2_MASK              0x04U
  #define I2C_SAR_SA3_MASK              0x08U
  #define I2C_SAR_SA4_MASK              0x10U
  #define I2C_SAR_SA5_MASK              0x20U
  #define I2C_SAR_SA6_MASK              0x40U
  #define I2C_SAR_SA7_MASK              0x80U
  #define I2C_SAR_SA8_MASK              0x0100U
  #define I2C_SAR_SA9_MASK              0x0200U
  #define I2C_SAR_SA_MASK               0x03FFU
  #define I2C_SAR_SA_BITNUM             0x00U
  #define I2C_SAR                       *((volatile word *)0x0000F284)


  word Reserved2[3];                   /* Reserved (unused) registers */
  
  /*** I2C_DATA - I2C Data Buffer and Command Register; 0x0000F288 ***/
  union {
    word Word;
  } I2C_DATA_STR;
  
  #define I2C_DATA_DAT0_MASK            0x01U
  #define I2C_DATA_DAT1_MASK            0x02U
  #define I2C_DATA_DAT2_MASK            0x04U
  #define I2C_DATA_DAT3_MASK            0x08U
  #define I2C_DATA_DAT4_MASK            0x10U
  #define I2C_DATA_DAT5_MASK            0x20U
  #define I2C_DATA_DAT6_MASK            0x40U
  #define I2C_DATA_DAT7_MASK            0x80U
  #define I2C_DATA_CMD_MASK             0x0100U
  #define I2C_DATA_DAT_MASK             0xFFU
  #define I2C_DATA_DAT_BITNUM           0x00U
  #define I2C_DATA                      *((volatile word *)0x0000F288)


  word Reserved3[1];                   /* Reserved (unused) registers */
  
  /*** I2C_SSHCNT - I2C Standard Speed I2C Clock SCL High Count Register; 0x0000F28A ***/
  union {
    word Word;
  } I2C_SSHCNT_STR;
  
  #define I2C_SSHCNT_SSHCNT0_MASK       0x01U
  #define I2C_SSHCNT_SSHCNT1_MASK       0x02U
  #define I2C_SSHCNT_SSHCNT2_MASK       0x04U
  #define I2C_SSHCNT_SSHCNT3_MASK       0x08U
  #define I2C_SSHCNT_SSHCNT4_MASK       0x10U
  #define I2C_SSHCNT_SSHCNT5_MASK       0x20U
  #define I2C_SSHCNT_SSHCNT6_MASK       0x40U
  #define I2C_SSHCNT_SSHCNT7_MASK       0x80U
  #define I2C_SSHCNT_SSHCNT8_MASK       0x0100U
  #define I2C_SSHCNT_SSHCNT9_MASK       0x0200U
  #define I2C_SSHCNT_SSHCNT10_MASK      0x0400U
  #define I2C_SSHCNT_SSHCNT11_MASK      0x0800U
  #define I2C_SSHCNT_SSHCNT12_MASK      0x1000U
  #define I2C_SSHCNT_SSHCNT13_MASK      0x2000U
  #define I2C_SSHCNT_SSHCNT14_MASK      0x4000U
  #define I2C_SSHCNT_SSHCNT15_MASK      0x8000U
  #define I2C_SSHCNT                    *((volatile word *)0x0000F28A)


  word Reserved4[1];                   /* Reserved (unused) registers */
  
