goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** I2C_SSLCNT - I2C Standard Speed I2C Clock SCL Low Count Register; 0x0000F28C ***/
  union {
    word Word;
  } I2C_SSLCNT_STR;
  
  #define I2C_SSLCNT_SSLCNT0_MASK       0x01U
  #define I2C_SSLCNT_SSLCNT1_MASK       0x02U
  #define I2C_SSLCNT_SSLCNT2_MASK       0x04U
  #define I2C_SSLCNT_SSLCNT3_MASK       0x08U
  #define I2C_SSLCNT_SSLCNT4_MASK       0x10U
  #define I2C_SSLCNT_SSLCNT5_MASK       0x20U
  #define I2C_SSLCNT_SSLCNT6_MASK       0x40U
  #define I2C_SSLCNT_SSLCNT7_MASK       0x80U
  #define I2C_SSLCNT_SSLCNT8_MASK       0x0100U
  #define I2C_SSLCNT_SSLCNT9_MASK       0x0200U
  #define I2C_SSLCNT_SSLCNT10_MASK      0x0400U
  #define I2C_SSLCNT_SSLCNT11_MASK      0x0800U
  #define I2C_SSLCNT_SSLCNT12_MASK      0x1000U
  #define I2C_SSLCNT_SSLCNT13_MASK      0x2000U
  #define I2C_SSLCNT_SSLCNT14_MASK      0x4000U
  #define I2C_SSLCNT_SSLCNT15_MASK      0x8000U
  #define I2C_SSLCNT                    *((volatile word *)0x0000F28C)


  word Reserved5[1];                   /* Reserved (unused) registers */
  
  /*** I2C_FSHCNT - I2C Fast Speed I2C Clock SCL High Count Register; 0x0000F28E ***/
  union {
    word Word;
  } I2C_FSHCNT_STR;
  
  #define I2C_FSHCNT_FSHCNT0_MASK       0x01U
  #define I2C_FSHCNT_FSHCNT1_MASK       0x02U
  #define I2C_FSHCNT_FSHCNT2_MASK       0x04U
  #define I2C_FSHCNT_FSHCNT3_MASK       0x08U
  #define I2C_FSHCNT_FSHCNT4_MASK       0x10U
  #define I2C_FSHCNT_FSHCNT5_MASK       0x20U
  #define I2C_FSHCNT_FSHCNT6_MASK       0x40U
  #define I2C_FSHCNT_FSHCNT7_MASK       0x80U
  #define I2C_FSHCNT_FSHCNT8_MASK       0x0100U
  #define I2C_FSHCNT_FSHCNT9_MASK       0x0200U
  #define I2C_FSHCNT_FSHCNT10_MASK      0x0400U
  #define I2C_FSHCNT_FSHCNT11_MASK      0x0800U
  #define I2C_FSHCNT_FSHCNT12_MASK      0x1000U
  #define I2C_FSHCNT_FSHCNT13_MASK      0x2000U
  #define I2C_FSHCNT_FSHCNT14_MASK      0x4000U
  #define I2C_FSHCNT_FSHCNT15_MASK      0x8000U
  #define I2C_FSHCNT                    *((volatile word *)0x0000F28E)


  word Reserved6[1];                   /* Reserved (unused) registers */
  
  /*** I2C_FSLCNT - I2C Fast Speed I2C Clock SCL Low Count Register; 0x0000F290 ***/
  union {
    word Word;
  } I2C_FSLCNT_STR;
  
  #define I2C_FSLCNT_FSLCNT0_MASK       0x01U
  #define I2C_FSLCNT_FSLCNT1_MASK       0x02U
  #define I2C_FSLCNT_FSLCNT2_MASK       0x04U
  #define I2C_FSLCNT_FSLCNT3_MASK       0x08U
  #define I2C_FSLCNT_FSLCNT4_MASK       0x10U
  #define I2C_FSLCNT_FSLCNT5_MASK       0x20U
  #define I2C_FSLCNT_FSLCNT6_MASK       0x40U
  #define I2C_FSLCNT_FSLCNT7_MASK       0x80U
  #define I2C_FSLCNT_FSLCNT8_MASK       0x0100U
  #define I2C_FSLCNT_FSLCNT9_MASK       0x0200U
  #define I2C_FSLCNT_FSLCNT10_MASK      0x0400U
  #define I2C_FSLCNT_FSLCNT11_MASK      0x0800U
  #define I2C_FSLCNT_FSLCNT12_MASK      0x1000U
  #define I2C_FSLCNT_FSLCNT13_MASK      0x2000U
  #define I2C_FSLCNT_FSLCNT14_MASK      0x4000U
  #define I2C_FSLCNT_FSLCNT15_MASK      0x8000U
  #define I2C_FSLCNT                    *((volatile word *)0x0000F290)


  word Reserved7[5];                   /* Reserved (unused) registers */
  
  /*** I2C_ISTAT - I2C Interrupt Status Register; 0x0000F296 ***/
  union {
    word Word;
  } I2C_ISTAT_STR;
  
  #define I2C_ISTAT_RXUND_MASK          0x01U
  #define I2C_ISTAT_RXOVR_MASK          0x02U
  #define I2C_ISTAT_RXFULL_MASK         0x04U
  #define I2C_ISTAT_TXOVR_MASK          0x08U
  #define I2C_ISTAT_TXEMPTY_MASK        0x10U
  #define I2C_ISTAT_RDREQ_MASK          0x20U
  #define I2C_ISTAT_TXABRT_MASK         0x40U
  #define I2C_ISTAT_TXDONE_MASK         0x80U
  #define I2C_ISTAT_ACT_MASK            0x0100U
  #define I2C_ISTAT_STPDET_MASK         0x0200U
  #define I2C_ISTAT_STDET_MASK          0x0400U
  #define I2C_ISTAT_GC_MASK             0x0800U
  #define I2C_ISTAT                     *((volatile word *)0x0000F296)


  word Reserved8[1];                   /* Reserved (unused) registers */
  
  /*** I2C_IENBL - I2C Interrupt Enable Register; 0x0000F298 ***/
  union {
    word Word;
  } I2C_IENBL_STR;
  
  #define I2C_IENBL_RXUND_MASK          0x01U
  #define I2C_IENBL_RXOVR_MASK          0x02U
  #define I2C_IENBL_RXFULL_MASK         0x04U
  #define I2C_IENBL_TXOVR_MASK          0x08U
  #define I2C_IENBL_TXEMPTY_MASK        0x10U
  #define I2C_IENBL_RDREQ_MASK          0x20U
  #define I2C_IENBL_TXABRT_MASK         0x40U
  #define I2C_IENBL_TXDONE_MASK         0x80U
  #define I2C_IENBL_ACT_MASK            0x0100U
  #define I2C_IENBL_STPDET_MASK         0x0200U
  #define I2C_IENBL_STDET_MASK          0x0400U
  #define I2C_IENBL_GC_MASK             0x0800U
  #define I2C_IENBL                     *((volatile word *)0x0000F298)


  word Reserved9[1];                   /* Reserved (unused) registers */
  
  /*** I2C_RISTAT - I2C Raw Interrupt Status Register; 0x0000F29A ***/
  union {
    word Word;
  } I2C_RISTAT_STR;
  
  #define I2C_RISTAT_RXUND_MASK         0x01U
  #define I2C_RISTAT_RXOVR_MASK         0x02U
  #define I2C_RISTAT_RXFULL_MASK        0x04U
  #define I2C_RISTAT_TXOVR_MASK         0x08U
  #define I2C_RISTAT_TXEMPTY_MASK       0x10U
  #define I2C_RISTAT_RDREQ_MASK         0x20U
  #define I2C_RISTAT_TXABRT_MASK        0x40U
  #define I2C_RISTAT_TXDONE_MASK        0x80U
  #define I2C_RISTAT_ACT_MASK           0x0100U
  #define I2C_RISTAT_STPDET_MASK        0x0200U
  #define I2C_RISTAT_STDET_MASK         0x0400U
  #define I2C_RISTAT_GC_MASK            0x0800U
  #define I2C_RISTAT                    *((volatile word *)0x0000F29A)


  word Reserved10[1];                  /* Reserved (unused) registers */
  
  /*** I2C_RXFT - I2C Receive FIFO Threshold Register; 0x0000F29C ***/
  union {
    word Word;
  } I2C_RXFT_STR;
  
  #define I2C_RXFT_RXTL0_MASK           0x01U
  #define I2C_RXFT_RXTL1_MASK           0x02U
  #define I2C_RXFT_RXTL_MASK            0x03U
  #define I2C_RXFT_RXTL_BITNUM          0x00U
  #define I2C_RXFT                      *((volatile word *)0x0000F29C)


