goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  word Reserved11[1];                  /* Reserved (unused) registers */
  
  /*** I2C_TXFT - I2C Transmit FIFO Threshold Register; 0x0000F29E ***/
  union {
    word Word;
  } I2C_TXFT_STR;
  
  #define I2C_TXFT_TXTL0_MASK           0x01U
  #define I2C_TXFT_TXTL1_MASK           0x02U
  #define I2C_TXFT_TXTL_MASK            0x03U
  #define I2C_TXFT_TXTL_BITNUM          0x00U
  #define I2C_TXFT                      *((volatile word *)0x0000F29E)


  word Reserved12[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRINT - I2C Clear Combined and Individual Interrupt Register; 0x0000F2A0 ***/
  union {
    word Word;
  } I2C_CLRINT_STR;
  
  #define I2C_CLRINT_INT_MASK           0x01U
  #define I2C_CLRINT                    *((volatile word *)0x0000F2A0)


  word Reserved13[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRRXUND - I2C Clear Receive Under Interrupt Register; 0x0000F2A2 ***/
  union {
    word Word;
  } I2C_CLRRXUND_STR;
  
  #define I2C_CLRRXUND_RXUND_MASK       0x01U
  #define I2C_CLRRXUND                  *((volatile word *)0x0000F2A2)


  word Reserved14[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRRXOVR - I2C Clear Receive Over Interrupt Register; 0x0000F2A4 ***/
  union {
    word Word;
  } I2C_CLRRXOVR_STR;
  
  #define I2C_CLRRXOVR_RXOVR_MASK       0x01U
  #define I2C_CLRRXOVR                  *((volatile word *)0x0000F2A4)


  word Reserved15[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRTXOVR - I2C Clear Transmit Over Interrupt Register; 0x0000F2A6 ***/
  union {
    word Word;
  } I2C_CLRTXOVR_STR;
  
  #define I2C_CLRTXOVR_TXOVR_MASK       0x01U
  #define I2C_CLRTXOVR                  *((volatile word *)0x0000F2A6)


  word Reserved16[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRRDREQ - I2C Clear Read Required Interrupt Register; 0x0000F2A8 ***/
  union {
    word Word;
  } I2C_CLRRDREQ_STR;
  
  #define I2C_CLRRDREQ_RDREQ_MASK       0x01U
  #define I2C_CLRRDREQ                  *((volatile word *)0x0000F2A8)


  word Reserved17[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRTXABRT - I2C Clear Transmit Abort Interrupt Register; 0x0000F2AA ***/
  union {
    word Word;
  } I2C_CLRTXABRT_STR;
  
  #define I2C_CLRTXABRT_TXABRT_MASK     0x01U
  #define I2C_CLRTXABRT                 *((volatile word *)0x0000F2AA)


  word Reserved18[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRTXDONE - I2C Clear Transmit Done Interrupt Register; 0x0000F2AC ***/
  union {
    word Word;
  } I2C_CLRTXDONE_STR;
  
  #define I2C_CLRTXDONE_TXDONE_MASK     0x01U
  #define I2C_CLRTXDONE                 *((volatile word *)0x0000F2AC)


  word Reserved19[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRACT - I2C Clear Activity Interrupt Register; 0x0000F2AE ***/
  union {
    word Word;
  } I2C_CLRACT_STR;
  
  #define I2C_CLRACT_ACT_MASK           0x01U
  #define I2C_CLRACT                    *((volatile word *)0x0000F2AE)


  word Reserved20[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRSTPDET - I2C Clear Stop Detect Interrupt Register; 0x0000F2B0 ***/
  union {
    word Word;
  } I2C_CLRSTPDET_STR;
  
  #define I2C_CLRSTPDET_STPDET_MASK     0x01U
  #define I2C_CLRSTPDET                 *((volatile word *)0x0000F2B0)


  word Reserved21[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRSTDET - I2C Clear Start Detect Interrupt Register; 0x0000F2B2 ***/
  union {
    word Word;
  } I2C_CLRSTDET_STR;
  
  #define I2C_CLRSTDET_STDET_MASK       0x01U
  #define I2C_CLRSTDET                  *((volatile word *)0x0000F2B2)


  word Reserved22[1];                  /* Reserved (unused) registers */
  
  /*** I2C_CLRGC - I2C Clear General Call Interrupt Register; 0x0000F2B4 ***/
  union {
    word Word;
  } I2C_CLRGC_STR;
  
  #define I2C_CLRGC_GC_MASK             0x01U
  #define I2C_CLRGC                     *((volatile word *)0x0000F2B4)


  word Reserved23[1];                  /* Reserved (unused) registers */
  
  /*** I2C_ENBL - I2C Enable Register; 0x0000F2B6 ***/
  union {
    word Word;
  } I2C_ENBL_STR;
  
  #define I2C_ENBL_EN_MASK              0x01U
  #define I2C_ENBL                      *((volatile word *)0x0000F2B6)


  word Reserved24[1];                  /* Reserved (unused) registers */
  
  /*** I2C_STAT - I2C Status Register; 0x0000F2B8 ***/
  union {
    word Word;
  } I2C_STAT_STR;
  
  #define I2C_STAT_ACT_MASK             0x01U
  #define I2C_STAT_TFNF_MASK            0x02U
  #define I2C_STAT_TFE_MASK             0x04U
  #define I2C_STAT_RFNE_MASK            0x08U
  #define I2C_STAT_RFF_MASK             0x10U
  #define I2C_STAT_MSTACT_MASK          0x20U
  #define I2C_STAT_SLVACT_MASK          0x40U
  #define I2C_STAT                      *((volatile word *)0x0000F2B8)


  word Reserved25[1];                  /* Reserved (unused) registers */
  
  /*** I2C_TXFLR - I2C Transmit FIFO Level Register; 0x0000F2BA ***/
  union {
    word Word;
  } I2C_TXFLR_STR;
  
  #define I2C_TXFLR_TXFL0_MASK          0x01U
  #define I2C_TXFLR_TXFL1_MASK          0x02U
  #define I2C_TXFLR_TXFL2_MASK          0x04U
  #define I2C_TXFLR_TXFL_MASK           0x07U
  #define I2C_TXFLR_TXFL_BITNUM         0x00U
  #define I2C_TXFLR                     *((volatile word *)0x0000F2BA)


  word Reserved26[1];                  /* Reserved (unused) registers */
  
  /*** I2C_RXFLR - I2C Receive FIFO Level Register; 0x0000F2BC ***/
  union {
    word Word;
  } I2C_RXFLR_STR;
  
  #define I2C_RXFLR_RXFL0_MASK          0x01U
  #define I2C_RXFLR_RXFL1_MASK          0x02U
  #define I2C_RXFLR_RXFL2_MASK          0x04U
  #define I2C_RXFLR_RXFL_MASK           0x07U
  #define I2C_RXFLR_RXFL_BITNUM         0x00U
  #define I2C_RXFLR                     *((volatile word *)0x0000F2BC)


  word Reserved27[3];                  /* Reserved (unused) registers */
  
