goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define FM_OPT1_TRIM0_MASK            0x01U
  #define FM_OPT1_TRIM1_MASK            0x02U
  #define FM_OPT1_TRIM2_MASK            0x04U
  #define FM_OPT1_TRIM3_MASK            0x08U
  #define FM_OPT1_TRIM4_MASK            0x10U
  #define FM_OPT1_TRIM5_MASK            0x20U
  #define FM_OPT1_TRIM6_MASK            0x40U
  #define FM_OPT1_TRIM7_MASK            0x80U
  #define FM_OPT1_TRIM8_MASK            0x0100U
  #define FM_OPT1_TRIM9_MASK            0x0200U
  #define FM_OPT1_TRIM_MASK             0x03FFU
  #define FM_OPT1_TRIM_BITNUM           0x00U
  #define FM_OPT1                       *((volatile word *)0x0000F41B)


  word Reserved5[1];                   /* Reserved (unused) registers */
  
  /*** FM_TSTSIG - Flash Memory Test Array Signature Register; 0x0000F41D ***/
  union {
    word Word;
  } FM_TSTSIG_STR;
  
  #define FM_TSTSIG_TST_AREA_SIG0_MASK  0x01U
  #define FM_TSTSIG_TST_AREA_SIG1_MASK  0x02U
  #define FM_TSTSIG_TST_AREA_SIG2_MASK  0x04U
  #define FM_TSTSIG_TST_AREA_SIG3_MASK  0x08U
  #define FM_TSTSIG_TST_AREA_SIG4_MASK  0x10U
  #define FM_TSTSIG_TST_AREA_SIG5_MASK  0x20U
  #define FM_TSTSIG_TST_AREA_SIG6_MASK  0x40U
  #define FM_TSTSIG_TST_AREA_SIG7_MASK  0x80U
  #define FM_TSTSIG_TST_AREA_SIG8_MASK  0x0100U
  #define FM_TSTSIG_TST_AREA_SIG9_MASK  0x0200U
  #define FM_TSTSIG_TST_AREA_SIG10_MASK 0x0400U
  #define FM_TSTSIG_TST_AREA_SIG11_MASK 0x0800U
  #define FM_TSTSIG_TST_AREA_SIG12_MASK 0x1000U
  #define FM_TSTSIG_TST_AREA_SIG13_MASK 0x2000U
  #define FM_TSTSIG_TST_AREA_SIG14_MASK 0x4000U
  #define FM_TSTSIG_TST_AREA_SIG15_MASK 0x8000U
  #define FM_TSTSIG                     *((volatile word *)0x0000F41D)


  word Reserved6[994];                 /* Reserved (unused) registers */

} HFM_PRPH;

/******************************************
*** Peripheral MSCAN
*******************************************/
typedef volatile struct {
  /*** MSCAN_CTRL0 - MSCAN Control Register 0; 0x0000F800 ***/
  union {
    word Word;
  } MSCAN_CTRL0_STR;
  
  #define MSCAN_CTRL0_INITRQ_MASK       0x01U
  #define MSCAN_CTRL0_SLPRQ_MASK        0x02U
  #define MSCAN_CTRL0_WUPE_MASK         0x04U
  #define MSCAN_CTRL0_TIME_MASK         0x08U
  #define MSCAN_CTRL0_SYNCH_MASK        0x10U
  #define MSCAN_CTRL0_CSWAI_MASK        0x20U
  #define MSCAN_CTRL0_RXACT_MASK        0x40U
  #define MSCAN_CTRL0_RXFRM_MASK        0x80U
  #define MSCAN_CTRL0                   *((volatile word *)0x0000F800)


  /*** MSCAN_CTRL1 - MSCAN Control Register 1; 0x0000F801 ***/
  union {
    word Word;
  } MSCAN_CTRL1_STR;
  
  #define MSCAN_CTRL1_INITAK_MASK       0x01U
  #define MSCAN_CTRL1_SLPAK_MASK        0x02U
  #define MSCAN_CTRL1_WUPM_MASK         0x04U
  #define MSCAN_CTRL1_BORM_MASK         0x08U
  #define MSCAN_CTRL1_LISTEN_MASK       0x10U
  #define MSCAN_CTRL1_LOOPB_MASK        0x20U
  #define MSCAN_CTRL1_CLKSRC_MASK       0x40U
  #define MSCAN_CTRL1_CANE_MASK         0x80U
  #define MSCAN_CTRL1                   *((volatile word *)0x0000F801)


  /*** MSCAN_BTR0 - MSCAN Bus Timing Register 0; 0x0000F802 ***/
  union {
    word Word;
  } MSCAN_BTR0_STR;
  
  #define MSCAN_BTR0_BRP0_MASK          0x01U
  #define MSCAN_BTR0_BRP1_MASK          0x02U
  #define MSCAN_BTR0_BRP2_MASK          0x04U
  #define MSCAN_BTR0_BRP3_MASK          0x08U
  #define MSCAN_BTR0_BRP4_MASK          0x10U
  #define MSCAN_BTR0_BRP5_MASK          0x20U
  #define MSCAN_BTR0_SJW0_MASK          0x40U
  #define MSCAN_BTR0_SJW1_MASK          0x80U
  #define MSCAN_BTR0_BRP_MASK           0x3FU
  #define MSCAN_BTR0_BRP_BITNUM         0x00U
  #define MSCAN_BTR0_SJW_MASK           0xC0U
  #define MSCAN_BTR0_SJW_BITNUM         0x06U
  #define MSCAN_BTR0                    *((volatile word *)0x0000F802)


  /*** MSCAN_BTR1 - MSCAN Bus Timing Register 1; 0x0000F803 ***/
  union {
    word Word;
  } MSCAN_BTR1_STR;
  
  #define MSCAN_BTR1_TSEG10_MASK        0x01U
  #define MSCAN_BTR1_TSEG11_MASK        0x02U
  #define MSCAN_BTR1_TSEG12_MASK        0x04U
  #define MSCAN_BTR1_TSEG13_MASK        0x08U
  #define MSCAN_BTR1_TSEG20_MASK        0x10U
  #define MSCAN_BTR1_TSEG21_MASK        0x20U
  #define MSCAN_BTR1_TSEG22_MASK        0x40U
  #define MSCAN_BTR1_SAMP_MASK          0x80U
  #define MSCAN_BTR1_TSEG1_MASK         0x0FU
  #define MSCAN_BTR1_TSEG1_BITNUM       0x00U
  #define MSCAN_BTR1_TSEG2_MASK         0x70U
  #define MSCAN_BTR1_TSEG2_BITNUM       0x04U
  #define MSCAN_BTR1                    *((volatile word *)0x0000F803)


  /*** MSCAN_RFLG - MSCAN Receiver Flag Register; 0x0000F804 ***/
  union {
    word Word;
  } MSCAN_RFLG_STR;
  
  #define MSCAN_RFLG_RXF_MASK           0x01U
  #define MSCAN_RFLG_OVRIF_MASK         0x02U
  #define MSCAN_RFLG_TSTAT0_MASK        0x04U
  #define MSCAN_RFLG_TSTAT1_MASK        0x08U
  #define MSCAN_RFLG_RSTAT0_MASK        0x10U
  #define MSCAN_RFLG_RSTAT1_MASK        0x20U
  #define MSCAN_RFLG_CSCIF_MASK         0x40U
  #define MSCAN_RFLG_WUPIF_MASK         0x80U
  #define MSCAN_RFLG_TSTAT_MASK         0x0CU
  #define MSCAN_RFLG_TSTAT_BITNUM       0x02U
  #define MSCAN_RFLG_RSTAT_MASK         0x30U
  #define MSCAN_RFLG_RSTAT_BITNUM       0x04U
  #define MSCAN_RFLG                    *((volatile word *)0x0000F804)


  /*** MSCAN_RIER - MSCAN Receiver Interrupt Enable Register; 0x0000F805 ***/
  union {
    word Word;
  } MSCAN_RIER_STR;
  
  #define MSCAN_RIER_RXFIE_MASK         0x01U
  #define MSCAN_RIER_OVRIE_MASK         0x02U
  #define MSCAN_RIER_TSTATE0_MASK       0x04U
  #define MSCAN_RIER_TSTATE1_MASK       0x08U
  #define MSCAN_RIER_RSTATE0_MASK       0x10U
  #define MSCAN_RIER_RSTATE1_MASK       0x20U
  #define MSCAN_RIER_CSCIE_MASK         0x40U
  #define MSCAN_RIER_WUPIE_MASK         0x80U
  #define MSCAN_RIER_TSTATE_MASK        0x0CU
  #define MSCAN_RIER_TSTATE_BITNUM      0x02U
  #define MSCAN_RIER_RSTATE_MASK        0x30U
  #define MSCAN_RIER_RSTATE_BITNUM      0x04U
  #define MSCAN_RIER                    *((volatile word *)0x0000F805)


  /*** MSCAN_TFLG - MSCAN Transmitter Flag Register; 0x0000F806 ***/
  union {
    word Word;
  } MSCAN_TFLG_STR;
  
  #define MSCAN_TFLG_TXE0_MASK          0x01U
  #define MSCAN_TFLG_TXE1_MASK          0x02U
  #define MSCAN_TFLG_TXE2_MASK          0x04U
  #define MSCAN_TFLG_TXE_MASK           0x07U
  #define MSCAN_TFLG_TXE_BITNUM         0x00U
  #define MSCAN_TFLG                    *((volatile word *)0x0000F806)


  /*** MSCAN_TIER - MSCAN Transmitter Interrupt Enable Register; 0x0000F807 ***/
  union {
    word Word;
  } MSCAN_TIER_STR;
  
  #define MSCAN_TIER_TXEIE0_MASK        0x01U
  #define MSCAN_TIER_TXEIE1_MASK        0x02U
  #define MSCAN_TIER_TXEIE2_MASK        0x04U
  #define MSCAN_TIER_TXEIE_MASK         0x07U
  #define MSCAN_TIER_TXEIE_BITNUM       0x00U
  #define MSCAN_TIER                    *((volatile word *)0x0000F807)


  /*** MSCAN_TARQ - MSCAN Transmitter Message Abort Request Register; 0x0000F808 ***/
  union {
    word Word;
  } MSCAN_TARQ_STR;
  
  #define MSCAN_TARQ_ABTRQ0_MASK        0x01U
  #define MSCAN_TARQ_ABTRQ1_MASK        0x02U
  #define MSCAN_TARQ_ABTRQ2_MASK        0x04U
  #define MSCAN_TARQ_ABTRQ_MASK         0x07U
  #define MSCAN_TARQ_ABTRQ_BITNUM       0x00U
  #define MSCAN_TARQ                    *((volatile word *)0x0000F808)


  /*** MSCAN_TAAK - MSCAN Transmitter Message Abort Acknowledge Register; 0x0000F809 ***/
  union {
    word Word;
  } MSCAN_TAAK_STR;
  
  #define MSCAN_TAAK_ABTAK0_MASK        0x01U
  #define MSCAN_TAAK_ABTAK1_MASK        0x02U
  #define MSCAN_TAAK_ABTAK2_MASK        0x04U
  #define MSCAN_TAAK_ABTAK_MASK         0x07U
  #define MSCAN_TAAK_ABTAK_BITNUM       0x00U
  #define MSCAN_TAAK                    *((volatile word *)0x0000F809)


  /*** MSCAN_TBSEL - MSCAN Transmitter Buffer Selection Register; 0x0000F80A ***/
  union {
    word Word;
  } MSCAN_TBSEL_STR;
  
  #define MSCAN_TBSEL_TX0_MASK          0x01U
  #define MSCAN_TBSEL_TX1_MASK          0x02U
  #define MSCAN_TBSEL_TX2_MASK          0x04U
  #define MSCAN_TBSEL_TX_MASK           0x07U
  #define MSCAN_TBSEL_TX_BITNUM         0x00U
  #define MSCAN_TBSEL                   *((volatile word *)0x0000F80A)


  /*** MSCAN_IDAC - MSCAN Identifier Acceptance Control Register; 0x0000F80B ***/
  union {
    word Word;
  } MSCAN_IDAC_STR;
  
  #define MSCAN_IDAC_IDHIT0_MASK        0x01U
  #define MSCAN_IDAC_IDHIT1_MASK        0x02U
  #define MSCAN_IDAC_IDHIT2_MASK        0x04U
  #define MSCAN_IDAC_IDAM0_MASK         0x10U
  #define MSCAN_IDAC_IDAM1_MASK         0x20U
  #define MSCAN_IDAC_IDHIT_MASK         0x07U
  #define MSCAN_IDAC_IDHIT_BITNUM       0x00U
  #define MSCAN_IDAC_IDAM_MASK          0x30U
  #define MSCAN_IDAC_IDAM_BITNUM        0x04U
  #define MSCAN_IDAC                    *((volatile word *)0x0000F80B)


  word Reserved0[1];                   /* Reserved (unused) registers */
  
