goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** MSCAN_MISC - MSCAN Miscellaneous Register; 0x0000F80D ***/
  union {
    word Word;
  } MSCAN_MISC_STR;
  
  #define MSCAN_MISC_BOHOLD_MASK        0x01U
  #define MSCAN_MISC                    *((volatile word *)0x0000F80D)


  /*** MSCAN_RXERR - MSCAN Receive Error Counter Register; 0x0000F80E ***/
  union {
    word Word;
  } MSCAN_RXERR_STR;
  
  #define MSCAN_RXERR_RXERR0_MASK       0x01U
  #define MSCAN_RXERR_RXERR1_MASK       0x02U
  #define MSCAN_RXERR_RXERR2_MASK       0x04U
  #define MSCAN_RXERR_RXERR3_MASK       0x08U
  #define MSCAN_RXERR_RXERR4_MASK       0x10U
  #define MSCAN_RXERR_RXERR5_MASK       0x20U
  #define MSCAN_RXERR_RXERR6_MASK       0x40U
  #define MSCAN_RXERR_RXERR7_MASK       0x80U
  #define MSCAN_RXERR_RXERR_MASK        0xFFU
  #define MSCAN_RXERR_RXERR_BITNUM      0x00U
  #define MSCAN_RXERR                   *((volatile word *)0x0000F80E)


  /*** MSCAN_TXERR - MSCAN Transmit Error Counter Register; 0x0000F80F ***/
  union {
    word Word;
  } MSCAN_TXERR_STR;
  
  #define MSCAN_TXERR_TXERR0_MASK       0x01U
  #define MSCAN_TXERR_TXERR1_MASK       0x02U
  #define MSCAN_TXERR_TXERR2_MASK       0x04U
  #define MSCAN_TXERR_TXERR3_MASK       0x08U
  #define MSCAN_TXERR_TXERR4_MASK       0x10U
  #define MSCAN_TXERR_TXERR5_MASK       0x20U
  #define MSCAN_TXERR_TXERR6_MASK       0x40U
  #define MSCAN_TXERR_TXERR7_MASK       0x80U
  #define MSCAN_TXERR_TXERR_MASK        0xFFU
  #define MSCAN_TXERR_TXERR_BITNUM      0x00U
  #define MSCAN_TXERR                   *((volatile word *)0x0000F80F)


  /*** MSCAN_IDAR0 - MSCAN Identifier Acceptance Register 0; 0x0000F810 ***/
  union {
    word Word;
  } MSCAN_IDAR0_STR;
  
  #define MSCAN_IDAR0_AC0_MASK          0x01U
  #define MSCAN_IDAR0_AC1_MASK          0x02U
  #define MSCAN_IDAR0_AC2_MASK          0x04U
  #define MSCAN_IDAR0_AC3_MASK          0x08U
  #define MSCAN_IDAR0_AC4_MASK          0x10U
  #define MSCAN_IDAR0_AC5_MASK          0x20U
  #define MSCAN_IDAR0_AC6_MASK          0x40U
  #define MSCAN_IDAR0_AC7_MASK          0x80U
  #define MSCAN_IDAR0_AC_MASK           0xFFU
  #define MSCAN_IDAR0_AC_BITNUM         0x00U
  #define MSCAN_IDAR0                   *((volatile word *)0x0000F810)


  /*** MSCAN_IDAR1 - MSCAN Identifier Acceptance Register 1; 0x0000F811 ***/
  union {
    word Word;
  } MSCAN_IDAR1_STR;
  
  #define MSCAN_IDAR1_AC0_MASK          0x01U
  #define MSCAN_IDAR1_AC1_MASK          0x02U
  #define MSCAN_IDAR1_AC2_MASK          0x04U
  #define MSCAN_IDAR1_AC3_MASK          0x08U
  #define MSCAN_IDAR1_AC4_MASK          0x10U
  #define MSCAN_IDAR1_AC5_MASK          0x20U
  #define MSCAN_IDAR1_AC6_MASK          0x40U
  #define MSCAN_IDAR1_AC7_MASK          0x80U
  #define MSCAN_IDAR1_AC_MASK           0xFFU
  #define MSCAN_IDAR1_AC_BITNUM         0x00U
  #define MSCAN_IDAR1                   *((volatile word *)0x0000F811)


  /*** MSCAN_IDAR2 - MSCAN Identifier Acceptance Register 2; 0x0000F812 ***/
  union {
    word Word;
  } MSCAN_IDAR2_STR;
  
  #define MSCAN_IDAR2_AC0_MASK          0x01U
  #define MSCAN_IDAR2_AC1_MASK          0x02U
  #define MSCAN_IDAR2_AC2_MASK          0x04U
  #define MSCAN_IDAR2_AC3_MASK          0x08U
  #define MSCAN_IDAR2_AC4_MASK          0x10U
  #define MSCAN_IDAR2_AC5_MASK          0x20U
  #define MSCAN_IDAR2_AC6_MASK          0x40U
  #define MSCAN_IDAR2_AC7_MASK          0x80U
  #define MSCAN_IDAR2_AC_MASK           0xFFU
  #define MSCAN_IDAR2_AC_BITNUM         0x00U
  #define MSCAN_IDAR2                   *((volatile word *)0x0000F812)


  /*** MSCAN_IDAR3 - MSCAN Identifier Acceptance Register 3; 0x0000F813 ***/
  union {
    word Word;
  } MSCAN_IDAR3_STR;
  
  #define MSCAN_IDAR3_AC0_MASK          0x01U
  #define MSCAN_IDAR3_AC1_MASK          0x02U
  #define MSCAN_IDAR3_AC2_MASK          0x04U
  #define MSCAN_IDAR3_AC3_MASK          0x08U
  #define MSCAN_IDAR3_AC4_MASK          0x10U
  #define MSCAN_IDAR3_AC5_MASK          0x20U
  #define MSCAN_IDAR3_AC6_MASK          0x40U
  #define MSCAN_IDAR3_AC7_MASK          0x80U
  #define MSCAN_IDAR3_AC_MASK           0xFFU
  #define MSCAN_IDAR3_AC_BITNUM         0x00U
  #define MSCAN_IDAR3                   *((volatile word *)0x0000F813)


  /*** MSCAN_IDMR0 - MSCAN Identifier Mask Register 0; 0x0000F814 ***/
  union {
    word Word;
  } MSCAN_IDMR0_STR;
  
  #define MSCAN_IDMR0_AM0_MASK          0x01U
  #define MSCAN_IDMR0_AM1_MASK          0x02U
  #define MSCAN_IDMR0_AM2_MASK          0x04U
  #define MSCAN_IDMR0_AM3_MASK          0x08U
  #define MSCAN_IDMR0_AM4_MASK          0x10U
  #define MSCAN_IDMR0_AM5_MASK          0x20U
  #define MSCAN_IDMR0_AM6_MASK          0x40U
  #define MSCAN_IDMR0_AM7_MASK          0x80U
  #define MSCAN_IDMR0_AM_MASK           0xFFU
  #define MSCAN_IDMR0_AM_BITNUM         0x00U
  #define MSCAN_IDMR0                   *((volatile word *)0x0000F814)


  /*** MSCAN_IDMR1 - MSCAN Identifier Mask Register 1; 0x0000F815 ***/
  union {
    word Word;
  } MSCAN_IDMR1_STR;
  
  #define MSCAN_IDMR1_AM0_MASK          0x01U
  #define MSCAN_IDMR1_AM1_MASK          0x02U
  #define MSCAN_IDMR1_AM2_MASK          0x04U
  #define MSCAN_IDMR1_AM3_MASK          0x08U
  #define MSCAN_IDMR1_AM4_MASK          0x10U
  #define MSCAN_IDMR1_AM5_MASK          0x20U
  #define MSCAN_IDMR1_AM6_MASK          0x40U
  #define MSCAN_IDMR1_AM7_MASK          0x80U
  #define MSCAN_IDMR1_AM_MASK           0xFFU
  #define MSCAN_IDMR1_AM_BITNUM         0x00U
  #define MSCAN_IDMR1                   *((volatile word *)0x0000F815)


  /*** MSCAN_IDMR2 - MSCAN Identifier Mask Register 2; 0x0000F816 ***/
  union {
    word Word;
  } MSCAN_IDMR2_STR;
  
  #define MSCAN_IDMR2_AM0_MASK          0x01U
  #define MSCAN_IDMR2_AM1_MASK          0x02U
  #define MSCAN_IDMR2_AM2_MASK          0x04U
  #define MSCAN_IDMR2_AM3_MASK          0x08U
  #define MSCAN_IDMR2_AM4_MASK          0x10U
  #define MSCAN_IDMR2_AM5_MASK          0x20U
  #define MSCAN_IDMR2_AM6_MASK          0x40U
  #define MSCAN_IDMR2_AM7_MASK          0x80U
  #define MSCAN_IDMR2_AM_MASK           0xFFU
  #define MSCAN_IDMR2_AM_BITNUM         0x00U
  #define MSCAN_IDMR2                   *((volatile word *)0x0000F816)


  /*** MSCAN_IDMR3 - MSCAN Identifier Mask Register 3; 0x0000F817 ***/
  union {
    word Word;
  } MSCAN_IDMR3_STR;
  
  #define MSCAN_IDMR3_AM0_MASK          0x01U
  #define MSCAN_IDMR3_AM1_MASK          0x02U
  #define MSCAN_IDMR3_AM2_MASK          0x04U
  #define MSCAN_IDMR3_AM3_MASK          0x08U
  #define MSCAN_IDMR3_AM4_MASK          0x10U
  #define MSCAN_IDMR3_AM5_MASK          0x20U
  #define MSCAN_IDMR3_AM6_MASK          0x40U
  #define MSCAN_IDMR3_AM7_MASK          0x80U
  #define MSCAN_IDMR3_AM_MASK           0xFFU
  #define MSCAN_IDMR3_AM_BITNUM         0x00U
  #define MSCAN_IDMR3                   *((volatile word *)0x0000F817)


  /*** MSCAN_IDAR4 - MSCAN Identifier Acceptance Register 4; 0x0000F818 ***/
  union {
    word Word;
  } MSCAN_IDAR4_STR;
  
