goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  #define MSCAN_IDAR4_AC0_MASK          0x01U
  #define MSCAN_IDAR4_AC1_MASK          0x02U
  #define MSCAN_IDAR4_AC2_MASK          0x04U
  #define MSCAN_IDAR4_AC3_MASK          0x08U
  #define MSCAN_IDAR4_AC4_MASK          0x10U
  #define MSCAN_IDAR4_AC5_MASK          0x20U
  #define MSCAN_IDAR4_AC6_MASK          0x40U
  #define MSCAN_IDAR4_AC7_MASK          0x80U
  #define MSCAN_IDAR4_AC_MASK           0xFFU
  #define MSCAN_IDAR4_AC_BITNUM         0x00U
  #define MSCAN_IDAR4                   *((volatile word *)0x0000F818)


  /*** MSCAN_IDAR5 - MSCAN Identifier Acceptance Register 5; 0x0000F819 ***/
  union {
    word Word;
  } MSCAN_IDAR5_STR;
  
  #define MSCAN_IDAR5_AC0_MASK          0x01U
  #define MSCAN_IDAR5_AC1_MASK          0x02U
  #define MSCAN_IDAR5_AC2_MASK          0x04U
  #define MSCAN_IDAR5_AC3_MASK          0x08U
  #define MSCAN_IDAR5_AC4_MASK          0x10U
  #define MSCAN_IDAR5_AC5_MASK          0x20U
  #define MSCAN_IDAR5_AC6_MASK          0x40U
  #define MSCAN_IDAR5_AC7_MASK          0x80U
  #define MSCAN_IDAR5_AC_MASK           0xFFU
  #define MSCAN_IDAR5_AC_BITNUM         0x00U
  #define MSCAN_IDAR5                   *((volatile word *)0x0000F819)


  /*** MSCAN_IDAR6 - MSCAN Identifier Acceptance Register 6; 0x0000F81A ***/
  union {
    word Word;
  } MSCAN_IDAR6_STR;
  
  #define MSCAN_IDAR6_AC0_MASK          0x01U
  #define MSCAN_IDAR6_AC1_MASK          0x02U
  #define MSCAN_IDAR6_AC2_MASK          0x04U
  #define MSCAN_IDAR6_AC3_MASK          0x08U
  #define MSCAN_IDAR6_AC4_MASK          0x10U
  #define MSCAN_IDAR6_AC5_MASK          0x20U
  #define MSCAN_IDAR6_AC6_MASK          0x40U
  #define MSCAN_IDAR6_AC7_MASK          0x80U
  #define MSCAN_IDAR6_AC_MASK           0xFFU
  #define MSCAN_IDAR6_AC_BITNUM         0x00U
  #define MSCAN_IDAR6                   *((volatile word *)0x0000F81A)


  /*** MSCAN_IDAR7 - MSCAN Identifier Acceptance Register 7; 0x0000F81B ***/
  union {
    word Word;
  } MSCAN_IDAR7_STR;
  
  #define MSCAN_IDAR7_AC0_MASK          0x01U
  #define MSCAN_IDAR7_AC1_MASK          0x02U
  #define MSCAN_IDAR7_AC2_MASK          0x04U
  #define MSCAN_IDAR7_AC3_MASK          0x08U
  #define MSCAN_IDAR7_AC4_MASK          0x10U
  #define MSCAN_IDAR7_AC5_MASK          0x20U
  #define MSCAN_IDAR7_AC6_MASK          0x40U
  #define MSCAN_IDAR7_AC7_MASK          0x80U
  #define MSCAN_IDAR7_AC_MASK           0xFFU
  #define MSCAN_IDAR7_AC_BITNUM         0x00U
  #define MSCAN_IDAR7                   *((volatile word *)0x0000F81B)


  /*** MSCAN_IDMR4 - MSCAN Identifier Mask Register 4; 0x0000F81C ***/
  union {
    word Word;
  } MSCAN_IDMR4_STR;
  
  #define MSCAN_IDMR4_AM0_MASK          0x01U
  #define MSCAN_IDMR4_AM1_MASK          0x02U
  #define MSCAN_IDMR4_AM2_MASK          0x04U
  #define MSCAN_IDMR4_AM3_MASK          0x08U
  #define MSCAN_IDMR4_AM4_MASK          0x10U
  #define MSCAN_IDMR4_AM5_MASK          0x20U
  #define MSCAN_IDMR4_AM6_MASK          0x40U
  #define MSCAN_IDMR4_AM7_MASK          0x80U
  #define MSCAN_IDMR4_AM_MASK           0xFFU
  #define MSCAN_IDMR4_AM_BITNUM         0x00U
  #define MSCAN_IDMR4                   *((volatile word *)0x0000F81C)


  /*** MSCAN_IDMR5 - MSCAN Identifier Mask Register 5; 0x0000F81D ***/
  union {
    word Word;
  } MSCAN_IDMR5_STR;
  
  #define MSCAN_IDMR5_AM0_MASK          0x01U
  #define MSCAN_IDMR5_AM1_MASK          0x02U
  #define MSCAN_IDMR5_AM2_MASK          0x04U
  #define MSCAN_IDMR5_AM3_MASK          0x08U
  #define MSCAN_IDMR5_AM4_MASK          0x10U
  #define MSCAN_IDMR5_AM5_MASK          0x20U
  #define MSCAN_IDMR5_AM6_MASK          0x40U
  #define MSCAN_IDMR5_AM7_MASK          0x80U
  #define MSCAN_IDMR5_AM_MASK           0xFFU
  #define MSCAN_IDMR5_AM_BITNUM         0x00U
  #define MSCAN_IDMR5                   *((volatile word *)0x0000F81D)


  /*** MSCAN_IDMR6 - MSCAN Identifier Mask Register 6; 0x0000F81E ***/
  union {
    word Word;
  } MSCAN_IDMR6_STR;
  
  #define MSCAN_IDMR6_AM0_MASK          0x01U
  #define MSCAN_IDMR6_AM1_MASK          0x02U
  #define MSCAN_IDMR6_AM2_MASK          0x04U
  #define MSCAN_IDMR6_AM3_MASK          0x08U
  #define MSCAN_IDMR6_AM4_MASK          0x10U
  #define MSCAN_IDMR6_AM5_MASK          0x20U
  #define MSCAN_IDMR6_AM6_MASK          0x40U
  #define MSCAN_IDMR6_AM7_MASK          0x80U
  #define MSCAN_IDMR6_AM_MASK           0xFFU
  #define MSCAN_IDMR6_AM_BITNUM         0x00U
  #define MSCAN_IDMR6                   *((volatile word *)0x0000F81E)


  /*** MSCAN_IDMR7 - MSCAN Identifier Mask Register 7; 0x0000F81F ***/
  union {
    word Word;
  } MSCAN_IDMR7_STR;
  
  #define MSCAN_IDMR7_AM0_MASK          0x01U
  #define MSCAN_IDMR7_AM1_MASK          0x02U
  #define MSCAN_IDMR7_AM2_MASK          0x04U
  #define MSCAN_IDMR7_AM3_MASK          0x08U
  #define MSCAN_IDMR7_AM4_MASK          0x10U
  #define MSCAN_IDMR7_AM5_MASK          0x20U
  #define MSCAN_IDMR7_AM6_MASK          0x40U
  #define MSCAN_IDMR7_AM7_MASK          0x80U
  #define MSCAN_IDMR7_AM_MASK           0xFFU
  #define MSCAN_IDMR7_AM_BITNUM         0x00U
  #define MSCAN_IDMR7                   *((volatile word *)0x0000F81F)


} MSCAN_PRPH;

/******************************************
*** Peripheral MSCAN_RB
*******************************************/
typedef volatile struct {
  /*** MSCAN_RB_IDR0 - MSCAN Receive Buffer Identifier Register 0; 0x0000F820 ***/
  union {
    word Word;
  } MSCAN_RB_IDR0_STR;
  
  #define MSCAN_RB_IDR0_ID0_MASK        0x01U
  #define MSCAN_RB_IDR0_ID1_MASK        0x02U
  #define MSCAN_RB_IDR0_ID2_MASK        0x04U
  #define MSCAN_RB_IDR0_ID3_MASK        0x08U
  #define MSCAN_RB_IDR0_ID4_MASK        0x10U
  #define MSCAN_RB_IDR0_ID5_MASK        0x20U
  #define MSCAN_RB_IDR0_ID6_MASK        0x40U
  #define MSCAN_RB_IDR0_ID7_MASK        0x80U
  #define MSCAN_RB_IDR0_ID_MASK         0xFFU
  #define MSCAN_RB_IDR0_ID_BITNUM       0x00U
  #define MSCAN_RB_IDR0                 *((volatile word *)0x0000F820)


  /*** MSCAN_RB_IDR1 - MSCAN Receive Buffer Identifier Register 1; 0x0000F821 ***/
  union {
    word Word;
  } MSCAN_RB_IDR1_STR;
  
  #define MSCAN_RB_IDR1_ID0_MASK        0x01U
  #define MSCAN_RB_IDR1_ID1_MASK        0x02U
  #define MSCAN_RB_IDR1_ID2_MASK        0x04U
  #define MSCAN_RB_IDR1_ID3_MASK        0x08U
  #define MSCAN_RB_IDR1_ID4_MASK        0x10U
  #define MSCAN_RB_IDR1_ID5_MASK        0x20U
  #define MSCAN_RB_IDR1_ID6_MASK        0x40U
  #define MSCAN_RB_IDR1_ID7_MASK        0x80U
  #define MSCAN_RB_IDR1_ID_MASK         0xFFU
  #define MSCAN_RB_IDR1_ID_BITNUM       0x00U
  #define MSCAN_RB_IDR1                 *((volatile word *)0x0000F821)


  /*** MSCAN_RB_IDR2 - MSCAN Receive Buffer Identifier Register 2; 0x0000F822 ***/
  union {
    word Word;
  } MSCAN_RB_IDR2_STR;
  
  #define MSCAN_RB_IDR2_ID0_MASK        0x01U
  #define MSCAN_RB_IDR2_ID1_MASK        0x02U
  #define MSCAN_RB_IDR2_ID2_MASK        0x04U
  #define MSCAN_RB_IDR2_ID3_MASK        0x08U
  #define MSCAN_RB_IDR2_ID4_MASK        0x10U
  #define MSCAN_RB_IDR2_ID5_MASK        0x20U
  #define MSCAN_RB_IDR2_ID6_MASK        0x40U
  #define MSCAN_RB_IDR2_ID7_MASK        0x80U
  #define MSCAN_RB_IDR2_ID_MASK         0xFFU
  #define MSCAN_RB_IDR2_ID_BITNUM       0x00U
  #define MSCAN_RB_IDR2                 *((volatile word *)0x0000F822)


  /*** MSCAN_RB_IDR3 - MSCAN Receive Buffer Identifier Register 3; 0x0000F823 ***/
  union {
    word Word;
  } MSCAN_RB_IDR3_STR;
  
  #define MSCAN_RB_IDR3_ID0_MASK        0x01U
  #define MSCAN_RB_IDR3_ID1_MASK        0x02U
  #define MSCAN_RB_IDR3_ID2_MASK        0x04U
  #define MSCAN_RB_IDR3_ID3_MASK        0x08U
  #define MSCAN_RB_IDR3_ID4_MASK        0x10U
  #define MSCAN_RB_IDR3_ID5_MASK        0x20U
  #define MSCAN_RB_IDR3_ID6_MASK        0x40U
  #define MSCAN_RB_IDR3_ID7_MASK        0x80U
  #define MSCAN_RB_IDR3_ID_MASK         0xFFU
  #define MSCAN_RB_IDR3_ID_BITNUM       0x00U
  #define MSCAN_RB_IDR3                 *((volatile word *)0x0000F823)


