goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** MSCAN_RB_DSR0 - MSCAN Receive Buffer Data Segment Register 0; 0x0000F824 ***/
  union {
    word Word;
  } MSCAN_RB_DSR0_STR;
  
  #define MSCAN_RB_DSR0_DB0_MASK        0x01U
  #define MSCAN_RB_DSR0_DB1_MASK        0x02U
  #define MSCAN_RB_DSR0_DB2_MASK        0x04U
  #define MSCAN_RB_DSR0_DB3_MASK        0x08U
  #define MSCAN_RB_DSR0_DB4_MASK        0x10U
  #define MSCAN_RB_DSR0_DB5_MASK        0x20U
  #define MSCAN_RB_DSR0_DB6_MASK        0x40U
  #define MSCAN_RB_DSR0_DB7_MASK        0x80U
  #define MSCAN_RB_DSR0_DB_MASK         0xFFU
  #define MSCAN_RB_DSR0_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR0                 *((volatile word *)0x0000F824)


  /*** MSCAN_RB_DSR1 - MSCAN Receive Buffer Data Segment Register 1; 0x0000F825 ***/
  union {
    word Word;
  } MSCAN_RB_DSR1_STR;
  
  #define MSCAN_RB_DSR1_DB0_MASK        0x01U
  #define MSCAN_RB_DSR1_DB1_MASK        0x02U
  #define MSCAN_RB_DSR1_DB2_MASK        0x04U
  #define MSCAN_RB_DSR1_DB3_MASK        0x08U
  #define MSCAN_RB_DSR1_DB4_MASK        0x10U
  #define MSCAN_RB_DSR1_DB5_MASK        0x20U
  #define MSCAN_RB_DSR1_DB6_MASK        0x40U
  #define MSCAN_RB_DSR1_DB7_MASK        0x80U
  #define MSCAN_RB_DSR1_DB_MASK         0xFFU
  #define MSCAN_RB_DSR1_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR1                 *((volatile word *)0x0000F825)


  /*** MSCAN_RB_DSR2 - MSCAN Receive Buffer Data Segment Register 2; 0x0000F826 ***/
  union {
    word Word;
  } MSCAN_RB_DSR2_STR;
  
  #define MSCAN_RB_DSR2_DB0_MASK        0x01U
  #define MSCAN_RB_DSR2_DB1_MASK        0x02U
  #define MSCAN_RB_DSR2_DB2_MASK        0x04U
  #define MSCAN_RB_DSR2_DB3_MASK        0x08U
  #define MSCAN_RB_DSR2_DB4_MASK        0x10U
  #define MSCAN_RB_DSR2_DB5_MASK        0x20U
  #define MSCAN_RB_DSR2_DB6_MASK        0x40U
  #define MSCAN_RB_DSR2_DB7_MASK        0x80U
  #define MSCAN_RB_DSR2_DB_MASK         0xFFU
  #define MSCAN_RB_DSR2_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR2                 *((volatile word *)0x0000F826)


  /*** MSCAN_RB_DSR3 - MSCAN Receive Buffer Data Segment Register 3; 0x0000F827 ***/
  union {
    word Word;
  } MSCAN_RB_DSR3_STR;
  
  #define MSCAN_RB_DSR3_DB0_MASK        0x01U
  #define MSCAN_RB_DSR3_DB1_MASK        0x02U
  #define MSCAN_RB_DSR3_DB2_MASK        0x04U
  #define MSCAN_RB_DSR3_DB3_MASK        0x08U
  #define MSCAN_RB_DSR3_DB4_MASK        0x10U
  #define MSCAN_RB_DSR3_DB5_MASK        0x20U
  #define MSCAN_RB_DSR3_DB6_MASK        0x40U
  #define MSCAN_RB_DSR3_DB7_MASK        0x80U
  #define MSCAN_RB_DSR3_DB_MASK         0xFFU
  #define MSCAN_RB_DSR3_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR3                 *((volatile word *)0x0000F827)


  /*** MSCAN_RB_DSR4 - MSCAN Receive Buffer Data Segment Register 4; 0x0000F828 ***/
  union {
    word Word;
  } MSCAN_RB_DSR4_STR;
  
  #define MSCAN_RB_DSR4_DB0_MASK        0x01U
  #define MSCAN_RB_DSR4_DB1_MASK        0x02U
  #define MSCAN_RB_DSR4_DB2_MASK        0x04U
  #define MSCAN_RB_DSR4_DB3_MASK        0x08U
  #define MSCAN_RB_DSR4_DB4_MASK        0x10U
  #define MSCAN_RB_DSR4_DB5_MASK        0x20U
  #define MSCAN_RB_DSR4_DB6_MASK        0x40U
  #define MSCAN_RB_DSR4_DB7_MASK        0x80U
  #define MSCAN_RB_DSR4_DB_MASK         0xFFU
  #define MSCAN_RB_DSR4_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR4                 *((volatile word *)0x0000F828)


  /*** MSCAN_RB_DSR5 - MSCAN Receive Buffer Data Segment Register 5; 0x0000F829 ***/
  union {
    word Word;
  } MSCAN_RB_DSR5_STR;
  
  #define MSCAN_RB_DSR5_DB0_MASK        0x01U
  #define MSCAN_RB_DSR5_DB1_MASK        0x02U
  #define MSCAN_RB_DSR5_DB2_MASK        0x04U
  #define MSCAN_RB_DSR5_DB3_MASK        0x08U
  #define MSCAN_RB_DSR5_DB4_MASK        0x10U
  #define MSCAN_RB_DSR5_DB5_MASK        0x20U
  #define MSCAN_RB_DSR5_DB6_MASK        0x40U
  #define MSCAN_RB_DSR5_DB7_MASK        0x80U
  #define MSCAN_RB_DSR5_DB_MASK         0xFFU
  #define MSCAN_RB_DSR5_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR5                 *((volatile word *)0x0000F829)


  /*** MSCAN_RB_DSR6 - MSCAN Receive Buffer Data Segment Register 6; 0x0000F82A ***/
  union {
    word Word;
  } MSCAN_RB_DSR6_STR;
  
  #define MSCAN_RB_DSR6_DB0_MASK        0x01U
  #define MSCAN_RB_DSR6_DB1_MASK        0x02U
  #define MSCAN_RB_DSR6_DB2_MASK        0x04U
  #define MSCAN_RB_DSR6_DB3_MASK        0x08U
  #define MSCAN_RB_DSR6_DB4_MASK        0x10U
  #define MSCAN_RB_DSR6_DB5_MASK        0x20U
  #define MSCAN_RB_DSR6_DB6_MASK        0x40U
  #define MSCAN_RB_DSR6_DB7_MASK        0x80U
  #define MSCAN_RB_DSR6_DB_MASK         0xFFU
  #define MSCAN_RB_DSR6_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR6                 *((volatile word *)0x0000F82A)


  /*** MSCAN_RB_DSR7 - MSCAN Receive Buffer Data Segment Register 7; 0x0000F82B ***/
  union {
    word Word;
  } MSCAN_RB_DSR7_STR;
  
  #define MSCAN_RB_DSR7_DB0_MASK        0x01U
  #define MSCAN_RB_DSR7_DB1_MASK        0x02U
  #define MSCAN_RB_DSR7_DB2_MASK        0x04U
  #define MSCAN_RB_DSR7_DB3_MASK        0x08U
  #define MSCAN_RB_DSR7_DB4_MASK        0x10U
  #define MSCAN_RB_DSR7_DB5_MASK        0x20U
  #define MSCAN_RB_DSR7_DB6_MASK        0x40U
  #define MSCAN_RB_DSR7_DB7_MASK        0x80U
  #define MSCAN_RB_DSR7_DB_MASK         0xFFU
  #define MSCAN_RB_DSR7_DB_BITNUM       0x00U
  #define MSCAN_RB_DSR7                 *((volatile word *)0x0000F82B)


  /*** MSCAN_RB_DLR - MSCAN Receive Buffer Data Length Register; 0x0000F82C ***/
  union {
    word Word;
  } MSCAN_RB_DLR_STR;
  
  #define MSCAN_RB_DLR_DLC0_MASK        0x01U
  #define MSCAN_RB_DLR_DLC1_MASK        0x02U
  #define MSCAN_RB_DLR_DLC2_MASK        0x04U
  #define MSCAN_RB_DLR_DLC3_MASK        0x08U
  #define MSCAN_RB_DLR_DLC_MASK         0x0FU
  #define MSCAN_RB_DLR_DLC_BITNUM       0x00U
  #define MSCAN_RB_DLR                  *((volatile word *)0x0000F82C)


  word Reserved0[3];                   /* Reserved (unused) registers */

} MSCAN_RB_PRPH;

/******************************************
*** Peripheral MSCAN_TB
*******************************************/
typedef volatile struct {
  /*** MSCAN_TB_IDR0 - MSCAN Transmit Buffer Identifier Register 0; 0x0000F830 ***/
  union {
    word Word;
  } MSCAN_TB_IDR0_STR;
  
  #define MSCAN_TB_IDR0_ID0_MASK        0x01U
  #define MSCAN_TB_IDR0_ID1_MASK        0x02U
  #define MSCAN_TB_IDR0_ID2_MASK        0x04U
  #define MSCAN_TB_IDR0_ID3_MASK        0x08U
  #define MSCAN_TB_IDR0_ID4_MASK        0x10U
  #define MSCAN_TB_IDR0_ID5_MASK        0x20U
  #define MSCAN_TB_IDR0_ID6_MASK        0x40U
  #define MSCAN_TB_IDR0_ID7_MASK        0x80U
  #define MSCAN_TB_IDR0_ID_MASK         0xFFU
  #define MSCAN_TB_IDR0_ID_BITNUM       0x00U
  #define MSCAN_TB_IDR0                 *((volatile word *)0x0000F830)


  /*** MSCAN_TB_IDR1 - MSCAN Transmit Buffer Identifier Register 1; 0x0000F831 ***/
  union {
    word Word;
  } MSCAN_TB_IDR1_STR;
  
  #define MSCAN_TB_IDR1_ID0_MASK        0x01U
  #define MSCAN_TB_IDR1_ID1_MASK        0x02U
  #define MSCAN_TB_IDR1_ID2_MASK        0x04U
  #define MSCAN_TB_IDR1_ID3_MASK        0x08U
  #define MSCAN_TB_IDR1_ID4_MASK        0x10U
  #define MSCAN_TB_IDR1_ID5_MASK        0x20U
  #define MSCAN_TB_IDR1_ID6_MASK        0x40U
  #define MSCAN_TB_IDR1_ID7_MASK        0x80U
  #define MSCAN_TB_IDR1_ID_MASK         0xFFU
  #define MSCAN_TB_IDR1_ID_BITNUM       0x00U
  #define MSCAN_TB_IDR1                 *((volatile word *)0x0000F831)


