goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** MSCAN_TB_IDR2 - MSCAN Transmit Buffer Identifier Register 2; 0x0000F832 ***/
  union {
    word Word;
  } MSCAN_TB_IDR2_STR;
  
  #define MSCAN_TB_IDR2_ID0_MASK        0x01U
  #define MSCAN_TB_IDR2_ID1_MASK        0x02U
  #define MSCAN_TB_IDR2_ID2_MASK        0x04U
  #define MSCAN_TB_IDR2_ID3_MASK        0x08U
  #define MSCAN_TB_IDR2_ID4_MASK        0x10U
  #define MSCAN_TB_IDR2_ID5_MASK        0x20U
  #define MSCAN_TB_IDR2_ID6_MASK        0x40U
  #define MSCAN_TB_IDR2_ID7_MASK        0x80U
  #define MSCAN_TB_IDR2_ID_MASK         0xFFU
  #define MSCAN_TB_IDR2_ID_BITNUM       0x00U
  #define MSCAN_TB_IDR2                 *((volatile word *)0x0000F832)


  /*** MSCAN_TB_IDR3 - MSCAN Transmit Buffer Identifier Register 3; 0x0000F833 ***/
  union {
    word Word;
  } MSCAN_TB_IDR3_STR;
  
  #define MSCAN_TB_IDR3_ID0_MASK        0x01U
  #define MSCAN_TB_IDR3_ID1_MASK        0x02U
  #define MSCAN_TB_IDR3_ID2_MASK        0x04U
  #define MSCAN_TB_IDR3_ID3_MASK        0x08U
  #define MSCAN_TB_IDR3_ID4_MASK        0x10U
  #define MSCAN_TB_IDR3_ID5_MASK        0x20U
  #define MSCAN_TB_IDR3_ID6_MASK        0x40U
  #define MSCAN_TB_IDR3_ID7_MASK        0x80U
  #define MSCAN_TB_IDR3_ID_MASK         0xFFU
  #define MSCAN_TB_IDR3_ID_BITNUM       0x00U
  #define MSCAN_TB_IDR3                 *((volatile word *)0x0000F833)


  /*** MSCAN_TB_DSR0 - MSCAN Transmit Buffer Data Segment Register 0; 0x0000F834 ***/
  union {
    word Word;
  } MSCAN_TB_DSR0_STR;
  
  #define MSCAN_TB_DSR0_DB0_MASK        0x01U
  #define MSCAN_TB_DSR0_DB1_MASK        0x02U
  #define MSCAN_TB_DSR0_DB2_MASK        0x04U
  #define MSCAN_TB_DSR0_DB3_MASK        0x08U
  #define MSCAN_TB_DSR0_DB4_MASK        0x10U
  #define MSCAN_TB_DSR0_DB5_MASK        0x20U
  #define MSCAN_TB_DSR0_DB6_MASK        0x40U
  #define MSCAN_TB_DSR0_DB7_MASK        0x80U
  #define MSCAN_TB_DSR0_DB_MASK         0xFFU
  #define MSCAN_TB_DSR0_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR0                 *((volatile word *)0x0000F834)


  /*** MSCAN_TB_DSR1 - MSCAN Transmit Buffer Data Segment Register 1; 0x0000F835 ***/
  union {
    word Word;
  } MSCAN_TB_DSR1_STR;
  
  #define MSCAN_TB_DSR1_DB0_MASK        0x01U
  #define MSCAN_TB_DSR1_DB1_MASK        0x02U
  #define MSCAN_TB_DSR1_DB2_MASK        0x04U
  #define MSCAN_TB_DSR1_DB3_MASK        0x08U
  #define MSCAN_TB_DSR1_DB4_MASK        0x10U
  #define MSCAN_TB_DSR1_DB5_MASK        0x20U
  #define MSCAN_TB_DSR1_DB6_MASK        0x40U
  #define MSCAN_TB_DSR1_DB7_MASK        0x80U
  #define MSCAN_TB_DSR1_DB_MASK         0xFFU
  #define MSCAN_TB_DSR1_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR1                 *((volatile word *)0x0000F835)


  /*** MSCAN_TB_DSR2 - MSCAN Transmit Buffer Data Segment Register 2; 0x0000F836 ***/
  union {
    word Word;
  } MSCAN_TB_DSR2_STR;
  
  #define MSCAN_TB_DSR2_DB0_MASK        0x01U
  #define MSCAN_TB_DSR2_DB1_MASK        0x02U
  #define MSCAN_TB_DSR2_DB2_MASK        0x04U
  #define MSCAN_TB_DSR2_DB3_MASK        0x08U
  #define MSCAN_TB_DSR2_DB4_MASK        0x10U
  #define MSCAN_TB_DSR2_DB5_MASK        0x20U
  #define MSCAN_TB_DSR2_DB6_MASK        0x40U
  #define MSCAN_TB_DSR2_DB7_MASK        0x80U
  #define MSCAN_TB_DSR2_DB_MASK         0xFFU
  #define MSCAN_TB_DSR2_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR2                 *((volatile word *)0x0000F836)


  /*** MSCAN_TB_DSR3 - MSCAN Transmit Buffer Data Segment Register 3; 0x0000F837 ***/
  union {
    word Word;
  } MSCAN_TB_DSR3_STR;
  
  #define MSCAN_TB_DSR3_DB0_MASK        0x01U
  #define MSCAN_TB_DSR3_DB1_MASK        0x02U
  #define MSCAN_TB_DSR3_DB2_MASK        0x04U
  #define MSCAN_TB_DSR3_DB3_MASK        0x08U
  #define MSCAN_TB_DSR3_DB4_MASK        0x10U
  #define MSCAN_TB_DSR3_DB5_MASK        0x20U
  #define MSCAN_TB_DSR3_DB6_MASK        0x40U
  #define MSCAN_TB_DSR3_DB7_MASK        0x80U
  #define MSCAN_TB_DSR3_DB_MASK         0xFFU
  #define MSCAN_TB_DSR3_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR3                 *((volatile word *)0x0000F837)


  /*** MSCAN_TB_DSR4 - MSCAN Transmit Buffer Data Segment Register 4; 0x0000F838 ***/
  union {
    word Word;
  } MSCAN_TB_DSR4_STR;
  
  #define MSCAN_TB_DSR4_DB0_MASK        0x01U
  #define MSCAN_TB_DSR4_DB1_MASK        0x02U
  #define MSCAN_TB_DSR4_DB2_MASK        0x04U
  #define MSCAN_TB_DSR4_DB3_MASK        0x08U
  #define MSCAN_TB_DSR4_DB4_MASK        0x10U
  #define MSCAN_TB_DSR4_DB5_MASK        0x20U
  #define MSCAN_TB_DSR4_DB6_MASK        0x40U
  #define MSCAN_TB_DSR4_DB7_MASK        0x80U
  #define MSCAN_TB_DSR4_DB_MASK         0xFFU
  #define MSCAN_TB_DSR4_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR4                 *((volatile word *)0x0000F838)


  /*** MSCAN_TB_DSR5 - MSCAN Transmit Buffer Data Segment Register 5; 0x0000F839 ***/
  union {
    word Word;
  } MSCAN_TB_DSR5_STR;
  
  #define MSCAN_TB_DSR5_DB0_MASK        0x01U
  #define MSCAN_TB_DSR5_DB1_MASK        0x02U
  #define MSCAN_TB_DSR5_DB2_MASK        0x04U
  #define MSCAN_TB_DSR5_DB3_MASK        0x08U
  #define MSCAN_TB_DSR5_DB4_MASK        0x10U
  #define MSCAN_TB_DSR5_DB5_MASK        0x20U
  #define MSCAN_TB_DSR5_DB6_MASK        0x40U
  #define MSCAN_TB_DSR5_DB7_MASK        0x80U
  #define MSCAN_TB_DSR5_DB_MASK         0xFFU
  #define MSCAN_TB_DSR5_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR5                 *((volatile word *)0x0000F839)


  /*** MSCAN_TB_DSR6 - MSCAN Transmit Buffer Data Segment Register 6; 0x0000F83A ***/
  union {
    word Word;
  } MSCAN_TB_DSR6_STR;
  
  #define MSCAN_TB_DSR6_DB0_MASK        0x01U
  #define MSCAN_TB_DSR6_DB1_MASK        0x02U
  #define MSCAN_TB_DSR6_DB2_MASK        0x04U
  #define MSCAN_TB_DSR6_DB3_MASK        0x08U
  #define MSCAN_TB_DSR6_DB4_MASK        0x10U
  #define MSCAN_TB_DSR6_DB5_MASK        0x20U
  #define MSCAN_TB_DSR6_DB6_MASK        0x40U
  #define MSCAN_TB_DSR6_DB7_MASK        0x80U
  #define MSCAN_TB_DSR6_DB_MASK         0xFFU
  #define MSCAN_TB_DSR6_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR6                 *((volatile word *)0x0000F83A)


