goexrois/dsp/dsc_board_lib/old_lib/mc56f802x3x.h
  /*** MSCAN_TB_DSR7 - MSCAN Transmit Buffer Data Segment Register 7; 0x0000F83B ***/
  union {
    word Word;
  } MSCAN_TB_DSR7_STR;
  
  #define MSCAN_TB_DSR7_DB0_MASK        0x01U
  #define MSCAN_TB_DSR7_DB1_MASK        0x02U
  #define MSCAN_TB_DSR7_DB2_MASK        0x04U
  #define MSCAN_TB_DSR7_DB3_MASK        0x08U
  #define MSCAN_TB_DSR7_DB4_MASK        0x10U
  #define MSCAN_TB_DSR7_DB5_MASK        0x20U
  #define MSCAN_TB_DSR7_DB6_MASK        0x40U
  #define MSCAN_TB_DSR7_DB7_MASK        0x80U
  #define MSCAN_TB_DSR7_DB_MASK         0xFFU
  #define MSCAN_TB_DSR7_DB_BITNUM       0x00U
  #define MSCAN_TB_DSR7                 *((volatile word *)0x0000F83B)


  /*** MSCAN_TB_DLR - MSCAN Transmit Buffer Data Length Register; 0x0000F83C ***/
  union {
    word Word;
  } MSCAN_TB_DLR_STR;
  
  #define MSCAN_TB_DLR_DLC0_MASK        0x01U
  #define MSCAN_TB_DLR_DLC1_MASK        0x02U
  #define MSCAN_TB_DLR_DLC2_MASK        0x04U
  #define MSCAN_TB_DLR_DLC3_MASK        0x08U
  #define MSCAN_TB_DLR_DLC_MASK         0x0FU
  #define MSCAN_TB_DLR_DLC_BITNUM       0x00U
  #define MSCAN_TB_DLR                  *((volatile word *)0x0000F83C)


  /*** MSCAN_TB_TBPR - MSCAN Transmit Buffer Priority Register; 0x0000F83D ***/
  union {
    word Word;
  } MSCAN_TB_TBPR_STR;
  
  #define MSCAN_TB_TBPR_PRIO0_MASK      0x01U
  #define MSCAN_TB_TBPR_PRIO1_MASK      0x02U
  #define MSCAN_TB_TBPR_PRIO2_MASK      0x04U
  #define MSCAN_TB_TBPR_PRIO3_MASK      0x08U
  #define MSCAN_TB_TBPR_PRIO4_MASK      0x10U
  #define MSCAN_TB_TBPR_PRIO5_MASK      0x20U
  #define MSCAN_TB_TBPR_PRIO6_MASK      0x40U
  #define MSCAN_TB_TBPR_PRIO7_MASK      0x80U
  #define MSCAN_TB_TBPR_PRIO_MASK       0xFFU
  #define MSCAN_TB_TBPR_PRIO_BITNUM     0x00U
  #define MSCAN_TB_TBPR                 *((volatile word *)0x0000F83D)


  /*** MSCAN_TB_TSRH - MSCAN Transmit Buffer Time Stamp Register; 0x0000F83E ***/
  union {
    word Word;
  } MSCAN_TB_TSRH_STR;
  
  #define MSCAN_TB_TSRH_TSR0_MASK       0x01U
  #define MSCAN_TB_TSRH_TSR1_MASK       0x02U
  #define MSCAN_TB_TSRH_TSR2_MASK       0x04U
  #define MSCAN_TB_TSRH_TSR3_MASK       0x08U
  #define MSCAN_TB_TSRH_TSR4_MASK       0x10U
  #define MSCAN_TB_TSRH_TSR5_MASK       0x20U
  #define MSCAN_TB_TSRH_TSR6_MASK       0x40U
  #define MSCAN_TB_TSRH_TSR7_MASK       0x80U
  #define MSCAN_TB_TSRH_TSR_MASK        0xFFU
  #define MSCAN_TB_TSRH_TSR_BITNUM      0x00U
  #define MSCAN_TB_TSRH                 *((volatile word *)0x0000F83E)


  /*** MSCAN_TB_TSRL - MSCAN Transmit Buffer Time Stamp Register; 0x0000F83F ***/
  union {
    word Word;
  } MSCAN_TB_TSRL_STR;
  
  #define MSCAN_TB_TSRL_TSR0_MASK       0x01U
  #define MSCAN_TB_TSRL_TSR1_MASK       0x02U
  #define MSCAN_TB_TSRL_TSR2_MASK       0x04U
  #define MSCAN_TB_TSRL_TSR3_MASK       0x08U
  #define MSCAN_TB_TSRL_TSR4_MASK       0x10U
  #define MSCAN_TB_TSRL_TSR5_MASK       0x20U
  #define MSCAN_TB_TSRL_TSR6_MASK       0x40U
  #define MSCAN_TB_TSRL_TSR7_MASK       0x80U
  #define MSCAN_TB_TSRL_TSR_MASK        0xFFU
  #define MSCAN_TB_TSRL_TSR_BITNUM      0x00U
  #define MSCAN_TB_TSRL                 *((volatile word *)0x0000F83F)


} MSCAN_TB_PRPH;




#endif
/* __IO_Map_H */

/*
** ###################################################################
**
**     This file was created by UNIS Processor Expert 2.98.02 [03.79]
**     for the Freescale 56800 series of microcontrollers.
**
** ###################################################################
*/
